window.grammarData1 = [
  {
    "tile": "a. い形容詞 - 否定型",
    "desp": "([[strike|い]] [br1])",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "高",
                "f": "たか"
              },
              {
                "k": "い[[blue|です]]。 [[dash|-]]"
              },
              {
                "k": "高",
                "f": "たか"
              },
              {
                "k": "[[strike|い]] [br2]"
              }
            ],
            "zh": "高的，貴的。 [[dash|-]]  不高，不貴。"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "安",
                "f": "やす"
              },
              {
                "k": "い[[blue|です]]。 [[dash|-]] "
              },
              {
                "k": "安",
                "f": "やす"
              },
              {
                "k": "[[strike|い]] [br2]"
              }
            ],
            "zh": "便宜的。  [[dash|-]]  不便宜。"
          }
        ]
      }
    ],
    "br1": [
      "+ く + ないです。",
      "+ く + ありません。"
    ],
    "br2": [
      "くないです。",
      "くありません。"
    ]

  },
  {
    "tile": "い形容詞 特例",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "いいです。- [[icon|error-icon]] い[[strike|い]] [br1]"
              },
            ],
            "zh": ""
          },
          {
            "jp": [
              {
                "k": "よいです。- [[icon|success-icon]] よ[[strike|い]] [br1]"
              },
            ],
            "zh": "好   -    不好"
          }
        ]
      }
    ],
    "br1": [
      "くないです。",
      "くありません。"
    ]
  },
  {
    "tile": "b. な形容詞 - 否定型",
    "desp": "～ [br1]",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "きれい[[blue|です]]。 [[dash|-]] "
              },
              {
                "k": "きれい [br1]"
              }
            ],
            "zh": "漂亮，乾淨。 [[dash|-]]  不漂亮，不乾淨。"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "この"
              },
              {
                "k": "肉",
                "f": "にく"
              },
              {
                "k": "は"
              },
              {
                "k": "新",
                "f": "しん"
              },
              {
                "k": "鮮",
                "f": "せん"
              },
              {
                "k": "[[blue|じゃ ないです。]]"
              }
            ],
            "zh": "這塊肉[[blue|不]]新鮮。"
          }
        ]
      },
      {
        "id": 3,
        "dia": [
          {
            "jp": [
              {
                "k": "林",
                "f": "りん"
              },
              {
                "k": "さん[[blue|の]]"
              },
              {
                "k": "彼",
                "f": "かの"
              },
              {
                "k": "女",
                "f": "じょ"
              },
              {
                "k": "は きれい[br2]"
              }
            ],
            "zh": "林先生[[blue|的]]女朋友不漂亮。"
          }
        ]
      },
      {
        "id": 4,
        "dia": [
          {
            "jp": [
              {
                "k": "この"
              },
              {
                "k": "映",
                "f": "えい"
              },
              {
                "k": "画",
                "f": "が"
              },
              {
                "k": "は おもしろ[[strike|い]] [br3]"
              }
            ],
            "zh": "這部電影[[blue|不好看]]。"
          }
        ]
      },
      {
        "id": 5,
        "dia": [
          {
            "jp": [
              {
                "k": "これ は おいし[[strike|い]] [br3]"
              }
            ],
            "zh": "這個[[blue|不好喝]]。"
          }
        ]
      }
    ],
    "br1": [
      "じゃ ないです。",
      "じゃ ありません。",
      "では ありません。"
    ],
    "br2": [
      "じゃないです。",
      "じゃありません。"
    ],
    "br3": [
      "くないです。",
      "くありません。"
    ]
  },
  {
    "tile": "a. い形容詞 - (肯定型) ～いです。",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "おもしろい[[blue|です]]。"
              }
            ],
            "zh": "有趣的"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "その"
              },
              {
                "k": "映",
                "f": "えい"
              },
              {
                "k": "画",
                "f": "が"
              },
              {
                "k": "[[space|は]]おもしろい[[blue|です]]。"
              }
            ],
            "zh": "那部電影很好看。"
          }
        ]
      }
    ],
  },
  {
    "tile": "b. な形容詞 - (肯定型) です。",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "きれい[[blue|です]]。"
              }
            ],
            "zh": "漂亮的"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "林",
                "f": "りん"
              },
              {
                "k": "さん[[space|は]]きれい[[blue|です]]。"
              }
            ],
            "zh": "林小姐很漂亮。"
          }
        ]
      }
    ],
  },
  {
    "tile": "どう  (如何?)",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "A: そのラーメンは [[blue|どう]] ですか。"
              }
            ],
            "zh": "A: 那碗拉麵[[blue|如何]]?"
          },
          {
            "jp": [
              {
                "k": "B: おいしいです。"
              }
            ],
            "zh": "B: 好吃。"
          }
        ]
      }
    ],
  },
  {
    "tile": "名詞 + が + ほしい (想要...)",
    "desp": "指著想要某物",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "車",
                "f": "くるま"
              },
              {
                "k": "[[blue| が ほしいです]]。"
              }
            ],
            "zh": "[[blue|想要]]車子。"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "お"
              },
              {
                "k": "金",
                "f": "かね"
              },
              {
                "k": "[[blue| が ほしいです]]。"
              }
            ],
            "zh": "[[blue|想要]]錢。"
          }
        ]
      },
      {
        "id": 3,
        "dia": [
          {
            "jp": [
              {
                "k": "私",
                "f": "わたし"
              },
              {
                "k": "[[blue| は ]]スマホ[[blue|がほしいです。]]"
              }
            ],
            "zh": "我[[blue|想要]]手機。"
          }
        ]
      }
    ],
  },
  {
    "tile": "~が~[[strike|ます]] + たい~(想做某事)想...",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "1. "
              },
              {
                "k": "食",
                "f": "た"
              },
              {
                "k": "ぺます。"
              }
            ],
            "zh": "吃。"
          },
          {
            "jp": [
              {
                "k": "2. "
              },
              {
                "k": "食",
                "f": "た"
              },
              {
                "k": "ぺ[[strike|ます]]たいです。"
              }
            ],
            "zh": "想吃。"
          },
          {
            "jp": [
              {
                "k": "3. ラ－メン[[blue|を]]"
              },
              {
                "k": "食",
                "f": "た"
              },
              {
                "k": "ぺ[[blue|ます。]]"
              }
            ],
            "zh": "[[blue|吃]]拉麵。"
          },
          {
            "jp": [
              {
                "k": "4. ラ－メン[[blue|が]]"
              },
              {
                "k": "食",
                "f": "た"
              },
              {
                "k": "ぺ[[strike|ます]] [[blue|たいです。]]"
              }
            ],
            "zh": "[[blue|想吃]]拉麵。"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "1. "
              },
              {
                "k": "聞",
                "f": "き"
              },
              {
                "k": "きます。"
              }
            ],
            "zh": "聽，問。"
          }, {
            "jp": [
              {
                "k": "2. "
              },
              {
                "k": "聞",
                "f": "き"
              },
              {
                "k": "き[[strike|ます]]たいです。"
              }
            ],
            "zh": "想聽，想問。"
          }, {
            "jp": [
              {
                "k": "3. "
              },
              {
                "k": "音",
                "f": "おん"
              },
              {
                "k": "楽",
                "f": "がく"
              },
              {
                "k": "[[blue|を]]"
              },
              {
                "k": "聞",
                "f": "き"
              },
              {
                "k": "き[[blue|ます。]]"
              }
            ],
            "zh": "[[blue|聽]]音樂。"
          },
          {
            "jp": [
              {
                "k": "4. "
              },
              {
                "k": "音",
                "f": "おん"
              },
              {
                "k": "楽",
                "f": "がく"
              },
              {
                "k": "[[blue|が]]"
              },
              {
                "k": "聞",
                "f": "き"
              },
              {
                "k": "き[[strike|ます]] [[blue|たいです。]]"
              }
            ],
            "zh": "[[blue|想聽]]音樂。"
          }
        ]
      }
    ],
  },
  {
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "私[[blue|は]]"
              },
              {
                "k": "運",
                "f": "うん"
              },
              {
                "k": "動",
                "f": "どう"
              },
              {
                "k": "し[[blue|たいです。]]"
              }
            ],
            "zh": "我[[blue|想]][[box|運動]][[notetop|[[note2]]]]"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "私[[blue|は]]"
              },
              {
                "k": "靴",
                "f": "くつ"
              },
              {
                "k": "[[box|が]][[blue|ほしいです。]]"
              }
            ],
            "zh": "我[[blue|想要]]鞋子"
          }
        ]
      },
      {
        "id": 3,
        "dia": [
          {
            "jp": [
              {
                "k": "陳さん[[blue|は]]"
              },
              {
                "k": "何",
                "f": "なん"
              },
              {
                "k": "歳",
                "f": "さい"
              },
              {
                "k": "[[blue|まで]]"
              },
              {
                "k": "仕",
                "f": "し"
              },
              {
                "k": "事",
                "f": "ごと"
              },
              {
                "k": "し[[blue|たいですか。]]"
              }
            ],
            "zh": "陳先生[[blue|想]][[box|工作]][[notetop|[[note1]]]][[blue|到]]幾歲呢?",

          }
        ]
      },
    ],
    "note": {
      "note1": [
        {
          "k": "仕",
          "f": "し"
        },
        {
          "k": "事",
          "f": "ごと"
        },
        { "k": "します" }
      ],
      "note2": [
        {
          "k": "運",
          "f": "うん"
        },
        {
          "k": "動",
          "f": "どう"
        },
        { "k": "します" }
      ]
    },
  },
  {
    "tile": [
      {
        "k": "退",
        "f": "たい"
      },
      {
        "k": "職",
        "f": "しょく"
      },
      {
        "k": "します。",
      }
    ],
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "A. "
              },
              {
                "k": "何",
                "f": "なん"
              },
              {
                "k": "歳",
                "f": "さい"
              },
              {
                "k": "退",
                "f": "たい"
              },
              {
                "k": "職",
                "f": "しょく"
              },
              {
                "k": "し[[strike|ます]][[box|たい]]ですか。"
              }
            ],
            "zh": "幾歲想退休呢?"
          },
          {
            "jp": [
              {
                "k": "B. "
              },
              {
                "k": "50",
                "f": "ごじゅっ"
              },
              {
                "k": "歳",
                "f": "さい"
              },
              {
                "k": "[[blue|です。]]"
              }
            ],
            "zh": "50歲。"
          },
          {
            "jp": [
              {
                "k": "A. "
              },
              {
                "k": "~え~",
              },
              {
                "k": "早",
                "f": "はや"
              },
              {
                "k": "い[[blue|ですね。]]"
              }
            ],
            "zh": ""
          }
        ]
      }
    ],

    "visl": ""
  },
  {
    "tile": [
      {
        "k": "~が[[notetop|[[note2]]]] あります (無生命)[[notetop|[[note1]]]]有"
      }
    ],
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "花",
                "f": "はな"
              },
              {
                "k": "[[blue|が あります。]]"
              }
            ],
            "zh": "[[blue|有]]花"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "本",
                "f": "ほん"
              },
              {
                "k": "[[blue|が あります。]]"
              }
            ],
            "zh": "[[blue|有]]書"
          }
        ]
      },
      {
        "id": 3,
        "dia": [
          {
            "jp": [
              {
                "k": "すみません"
              },
              {
                "k": "水",
                "f": "みず"
              },
              {
                "k": "[[blue|が あり]][[yellow|ますか。]]"
              }
            ],
            "zh": "不好意思，[[blue|有]]水嗎?"
          }
        ]
      }
    ],
    "visl": "",
    "note": {
      "note1": [
        {
          "k": "植物，東西"
        }
      ],
      "note2": [
        {
          "k": "有"
        }
      ]
    },
  },
  {
    "tile": [
      {
        "k": "降",
        "f": "[[blue|ふ]]"
      },
      {
        "k": "ります (雨/雪) 下"
      }
    ],
    "trans": "[[blue|動詞第一型]]",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "雨",
                "f": "あま"
              },
              {
                "k": "[[blue|が]]"
              },
              {
                "k": "降",
                "f": "[[blue|ふ]]"
              },
              {
                "k": "[[blue|ります。]]"
              }
            ],
            "zh": "下雨"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "雪",
                "f": "ゆき"
              },
              {
                "k": "[[blue|が]]"
              },
              {
                "k": "降",
                "f": "[[blue|ふ]]"
              },
              {
                "k": "[[blue|ります。]]"
              }
            ],
            "zh": "下雪"
          }
        ]
      }
    ],
  },
  {
    "tile": [
      {
        "k": "降",
        "f": "[[blue|お]]"
      },
      {
        "k": "ります (交通工具) 下"
      }
    ],
    "trans": "[[blue|動詞第二型]]",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "電",
                "f": "でん"
              },
              {
                "k": "車",
                "f": "しゃ"
              },
              {
                "k": "[[blue|を]]"
              },
              {
                "k": "降",
                "f": "[[blue|お]]"
              },
              {
                "k": "[[blue|ります。]]"
              }
            ],
            "zh": "下電車"
          }
        ]
      }
    ],
  },
  {
    "tile": [

      {
        "k": "敬體 - 基本體 (口語)"
      }
    ],
    "table": {
      "caption": "G1",
      "header": ["敬體", " -", "基本體"],
      "rows":
        [
          ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ます]]\"}]", "原形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|く]]\"}]"],
          ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ません]]\"}]", "ない形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"か[[blue|ない]]\"}]"],
          ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ました]]\"}]", "た形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|[[small|っ]]た]]<br/>(跟「て型」變法一樣，「て」字改成「た」字)\"}]"]

        ]

    }
  }
];
