window.grammarData1 = [
  {
    "tile": "a. い形容詞 - 否定型",
    "desp": "([[strike|い]] [br1])",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "高",
                "f": "たか"
              },
              {
                "k": "い[[blue|です]]。 [[dash|-]]"
              },
              {
                "k": "高",
                "f": "たか"
              },
              {
                "k": "[[strike|い]] [br2]"
              }
            ],
            "zh": "高的，貴的。 [[dash|-]]  不高，不貴。"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "安",
                "f": "やす"
              },
              {
                "k": "い[[blue|です]]。 [[dash|-]] "
              },
              {
                "k": "安",
                "f": "やす"
              },
              {
                "k": "[[strike|い]] [br2]"
              }
            ],
            "zh": "便宜的。  [[dash|-]]  不便宜。"
          }
        ]
      },{
        "id": 3,
        "dia": [
          {
            "jp": [
              {
                "k": "この"
              },
              {
                "k": "映",
                "f": "えい"
              },
              {
                "k": "画",
                "f": "が"
              },
              {
                "k": "は おもしろ[[strike|い]] [br2]"
              }
            ],
            "zh": "這部電影[[blue|不好看]]。"
          }
        ]
      },
      {
        "id": 4,
        "dia": [
          {
            "jp": [
              {
                "k": "これ は おいし[[strike|い]] [br2]"
              }
            ],
            "zh": "這個[[blue|不好喝]]。"
          }
        ]
      }
    ],
    "br1": [
      "+ く + ないです。",
      "+ く + ありません。"
    ],
    "br2": [
      "くないです。(口語)",
      "くありません。(偏考試)"
    ],
    "br3": [
      "くないです。",
      "くありません。"
    ],
    "tables": [{
      "header": ["肯定","否定"],
      "rows":
        [
          ["[{\"k\":\"悪\",\"f\":\"わる\"},{\"k\":\"い[[blue|です]]\"}]", "[{\"k\":\"悪\",\"f\":\"わる\"},{\"k\":\"[br3]\"}]"],
          ["[{\"k\":\"おもしろい[[blue|です]]\"}]","[{\"k\":\"おもしろ[br3]\"}]" ],
          ["[{\"k\":\"広\",\"f\":\"ひろ\"},{\"k\":\"い[[blue|です]]\"}]", "[{\"k\":\"広\",\"f\":\"ひろ\"},{\"k\":\"[br3]\"}]"],
        ]

    }]

  },
  {
    "tile": "い形容詞 特例",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "いいです。- [[icon|error-icon]] い[[strike|い]] [br1]"
              },
            ],
            "zh": ""
          },
          {
            "jp": [
              {
                "k": "良",
                "f": "よ"
              },
              {
                "k": "いです。- [[icon|success-icon]] よ[[strike|い]] [br1]"
              },
            ],
            "zh": "好   -    不好"
          }
        ]
      }
    ],
    "br1": [
      "くないです。",
      "くありません。"
    ]
  },
  {
    "tile": "b. な形容詞 - 否定型",
    "desp": "～ [br1]",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "きれい[[blue|です]]。 [[dash|-]] "
              },
              {
                "k": "きれい [br1]"
              }
            ],
            "zh": "漂亮，乾淨。 [[dash|-]]  不漂亮，不乾淨。"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "この"
              },
              {
                "k": "肉",
                "f": "にく"
              },
              {
                "k": "は"
              },
              {
                "k": "新",
                "f": "しん"
              },
              {
                "k": "鮮",
                "f": "せん"
              },
              {
                "k": "[[blue|じゃ ないです。]]"
              }
            ],
            "zh": "這塊肉[[blue|不]]新鮮。"
          }
        ]
      },
      {
        "id": 3,
        "dia": [
          {
            "jp": [
              {
                "k": "林",
                "f": "りん"
              },
              {
                "k": "さん[[blue|の]]"
              },
              {
                "k": "彼",
                "f": "かの"
              },
              {
                "k": "女",
                "f": "じょ"
              },
              {
                "k": "は きれい[br2]"
              }
            ],
            "zh": "林先生[[blue|的]]女朋友不漂亮。"
          }
        ]
      },
      
    
    ],
    "br1": [
      "じゃ ないです。",
      "じゃ ありません。",
      "では ありません。"
    ],
    "br2": [
      "じゃないです。",
      "じゃありません。"
    ],
    "br3": [
      "くないです。",
      "くありません。"
    ],
    "tables": [{
      "header": ["肯定","否定"],
      "rows":
        [
          ["[{\"k\":\"新\",\"f\":\"しん\"},{\"k\":\"鮮\",\"f\":\"せん\"},{\"k\":\"[[blue|です]]\"}]", "[{\"k\":\"新\",\"f\":\"しん\"},{\"k\":\"鮮\",\"f\":\"せん\"},{\"k\":\"[br1]\"}]"],
          ["[{\"k\":\"嫌\",\"f\":\"きら\"},{\"k\":\"[[blue|です]]\"}]", "[{\"k\":\"嫌\",\"f\":\"きら\"},{\"k\":\"[br1]\"}]"],
        ]

    }]
  },
  {
    "tile": "a. い形容詞 - (肯定型) ～いです。",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "おもしろい[[blue|です]]。"
              }
            ],
            "zh": "有趣的"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "その"
              },
              {
                "k": "映",
                "f": "えい"
              },
              {
                "k": "画",
                "f": "が"
              },
              {
                "k": "[[space|は]]おもしろい[[blue|です]]。"
              }
            ],
            "zh": "那部電影很好看。"
          }
        ]
      }
    ],
  },
  {
    "tile": "b. な形容詞 - (肯定型) です。",
    "desp":"有兩個特例是歸在な形 : [br1]",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "きれい[[blue|です]]。"
              }
            ],
            "zh": "漂亮的"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "林",
                "f": "りん"
              },
              {
                "k": "さん[[space|は]]きれい[[blue|です]]。"
              }
            ],
            "zh": "林小姐很漂亮。"
          }
        ]
      }
    ],
    "br1": [
      "きれい (乾淨，漂亮)",
      "[{\"k\":\"嫌\",\"f\":\"きら\"},{\"k\":\"い(討厭)\"}]"
    ]
  },
  {
    "tile": "どう  (如何?)",
    "desp":"[[icon|error-icon]] 不能背: 怎麼樣的",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "A: そのラーメンは [[blue|どう]] ですか。"
              }
            ],
            "zh": "A: 那碗拉麵[[blue|如何]]?"
          },
          {
            "jp": [
              {
                "k": "B: おいしいです。"
              }
            ],
            "zh": "B: 好吃。"
          }
        ]
      },
       {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "A:"
              },
              {
                "k": "陳",
                "f": "ちん"
              },
              {
                "k":"さん[[blue|の]]"
              },
              {
                "k": "彼",
                "f": "かれ"
              },
              {
                "k": "氏",
                "f": "し"
              },
              {
                "k":"は[[blue|どう]]ですか。"
              },
            ],
            "zh": "A: 陳小姐的男朋友[[blue|如何呢]]?"
          },
          {
            "jp": [
              {
                "k": "B: ハンサム[[bule|です。]]"
              }
            ],
            "zh": "B: 英俊。"
          }
        ]
      }
    ],
  },
  {
    "tile": "名詞 + が + ほしい (想要...)",
    "desp": "指著想要某物",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "車",
                "f": "くるま"
              },
              {
                "k": "[[blue| が ほしいです]]。"
              }
            ],
            "zh": "[[blue|想要]]車子。"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "お"
              },
              {
                "k": "金",
                "f": "かね"
              },
              {
                "k": "[[blue| が ほしいです]]。"
              }
            ],
            "zh": "[[blue|想要]]錢。"
          }
        ]
      },
      {
        "id": 3,
        "dia": [
          {
            "jp": [
              {
                "k": "私",
                "f": "わたし"
              },
              {
                "k": "[[blue| は ]]スマホ[[blue|がほしいです。]]"
              }
            ],
            "zh": "我[[blue|想要]]手機。"
          }
        ]
      }
    ],
  },
  {
    "tile": "~が~[[strike|ます]] + たい~(想做某事)想...",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "1. "
              },
              {
                "k": "食",
                "f": "た"
              },
              {
                "k": "べます。"
              }
            ],
            "zh": "吃。"
          },
          {
            "jp": [
              {
                "k": "2. "
              },
              {
                "k": "食",
                "f": "た"
              },
              {
                "k": "べ　　[[strike|ます]]たいです。"
              }
            ],
            "zh": "想吃。"
          },
          {
            "jp": [
              {
                "k": "3. ラ－メン[[blue|を]]"
              },
              {
                "k": "食",
                "f": "た"
              },
              {
                "k": "ぺ[[blue|ます。]]"
              }
            ],
            "zh": "[[blue|吃]]拉麵。"
          },
          {
            "jp": [
              {
                "k": "4. ラ－メン[[blue|が]]"
              },
              {
                "k": "食",
                "f": "た"
              },
              {
                "k": "ぺ[[strike|ます]] [[blue|たいです。]]"
              }
            ],
            "zh": "[[blue|想吃]]拉麵。"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "1. "
              },
              {
                "k": "聞",
                "f": "き"
              },
              {
                "k": "きます。"
              }
            ],
            "zh": "聽，問。"
          }, {
            "jp": [
              {
                "k": "2. "
              },
              {
                "k": "聞",
                "f": "き"
              },
              {
                "k": "き[[strike|ます]]たいです。"
              }
            ],
            "zh": "想聽，想問。"
          }, {
            "jp": [
              {
                "k": "3. "
              },
              {
                "k": "音",
                "f": "おん"
              },
              {
                "k": "楽",
                "f": "がく"
              },
              {
                "k": "[[blue|を]]"
              },
              {
                "k": "聞",
                "f": "き"
              },
              {
                "k": "き[[blue|ます。]]"
              }
            ],
            "zh": "[[blue|聽]]音樂。"
          },
          {
            "jp": [
              {
                "k": "4. "
              },
              {
                "k": "音",
                "f": "おん"
              },
              {
                "k": "楽",
                "f": "がく"
              },
              {
                "k": "[[blue|が]]"
              },
              {
                "k": "聞",
                "f": "き"
              },
              {
                "k": "き[[strike|ます]] [[blue|たいです。]]"
              }
            ],
            "zh": "[[blue|想聽]]音樂。"
          }
        ]
      }
    ],
  },
  {
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "私[[blue|は]]"
              },
              {
                "k": "運",
                "f": "うん"
              },
              {
                "k": "動",
                "f": "どう"
              },
              {
                "k": "し[[blue|たいです。]]"
              }
            ],
            "zh": "我[[blue|想]][[box|運動]][[notetop|[[note2]]]]"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "私[[blue|は]]"
              },
              {
                "k": "靴",
                "f": "くつ"
              },
              {
                "k": "[[box|が]][[blue|ほしいです。]]"
              }
            ],
            "zh": "我[[blue|想要]]鞋子"
          }
        ]
      },
      {
        "id": 3,
        "dia": [
          {
            "jp": [
              {
                "k": "陳さん[[blue|は]]"
              },
              {
                "k": "何",
                "f": "なん"
              },
              {
                "k": "歳",
                "f": "さい"
              },
              {
                "k": "[[blue|まで]]"
              },
              {
                "k": "仕",
                "f": "し"
              },
              {
                "k": "事",
                "f": "ごと"
              },
              {
                "k": "し[[blue|たいですか。]]"
              }
            ],
            "zh": "陳先生[[blue|想]][[box|工作]][[notetop|[[note1]]]][[blue|到]]幾歲呢?",

          }
        ]
      },
    ],
    "note": {
      "note1": [
        {
          "k": "仕",
          "f": "し"
        },
        {
          "k": "事",
          "f": "ごと"
        },
        { "k": "します" }
      ],
      "note2": [
        {
          "k": "運",
          "f": "うん"
        },
        {
          "k": "動",
          "f": "どう"
        },
        { "k": "します" }
      ]
    },
  },
  {
    "tile": [
      {
        "k": "退",
        "f": "たい"
      },
      {
        "k": "職",
        "f": "しょく"
      },
      {
        "k": "します。",
      }
    ],
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "A. "
              },
              {
                "k": "何",
                "f": "なん"
              },
              {
                "k": "歳",
                "f": "さい"
              },
              {
                "k": "退",
                "f": "たい"
              },
              {
                "k": "職",
                "f": "しょく"
              },
              {
                "k": "し[[strike|ます]][[box|たい]]ですか。"
              }
            ],
            "zh": "幾歲想退休呢?"
          },
          {
            "jp": [
              {
                "k": "B. "
              },
              {
                "k": "50",
                "f": "ごじゅっ"
              },
              {
                "k": "歳",
                "f": "さい"
              },
              {
                "k": "[[blue|です。]]"
              }
            ],
            "zh": "50歲。"
          },
          {
            "jp": [
              {
                "k": "A. "
              },
              {
                "k": "~え~",
              },
              {
                "k": "早",
                "f": "はや"
              },
              {
                "k": "い[[blue|ですね。]]"
              }
            ],
            "zh": ""
          }
        ]
      }
    ],

    "visl": ""
  },
  {
    "tile": [
      {
        "k": "~が[[notetop|[[note2]]]] あります (無生命)[[notetop|[[note1]]]]有"
      }
    ],
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "花",
                "f": "はな"
              },
              {
                "k": "[[blue|が あります。]]"
              }
            ],
            "zh": "[[blue|有]]花"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "本",
                "f": "ほん"
              },
              {
                "k": "[[blue|が あります。]]"
              }
            ],
            "zh": "[[blue|有]]書"
          }
        ]
      },
      {
        "id": 3,
        "dia": [
          {
            "jp": [
              {
                "k": "すみません"
              },
              {
                "k": "水",
                "f": "みず"
              },
              {
                "k": "[[blue|が あり]][[yellow|ますか。]]"
              }
            ],
            "zh": "不好意思，[[blue|有]]水嗎?"
          }
        ]
      }
    ],
    "visl": "",
    "note": {
      "note1": [
        {
          "k": "植物，東西"
        }
      ],
      "note2": [
        {
          "k": "有"
        }
      ]
    },
  },
  {
    "tile": [
      {
        "k": "降",
        "f": "[[blue|ふ]]"
      },
      {
        "k": "ります (雨/雪) 下"
      }
    ],
    "trans": "[[blue|動詞第一型]]",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "雨",
                "f": "あま"
              },
              {
                "k": "[[blue|が]]"
              },
              {
                "k": "降",
                "f": "[[blue|ふ]]"
              },
              {
                "k": "[[blue|ります。]]"
              }
            ],
            "zh": "下雨"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "雪",
                "f": "ゆき"
              },
              {
                "k": "[[blue|が]]"
              },
              {
                "k": "降",
                "f": "[[blue|ふ]]"
              },
              {
                "k": "[[blue|ります。]]"
              }
            ],
            "zh": "下雪"
          }
        ]
      }
    ],
  },
  {
    "tile": [
      {
        "k": "降",
        "f": "[[blue|お]]"
      },
      {
        "k": "ります (交通工具) 下"
      }
    ],
    "trans": "[[blue|動詞第二型]]",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "電",
                "f": "でん"
              },
              {
                "k": "車",
                "f": "しゃ"
              },
              {
                "k": "[[blue|を]]"
              },
              {
                "k": "降",
                "f": "[[blue|お]]"
              },
              {
                "k": "[[blue|ります。]]"
              }
            ],
            "zh": "下電車"
          }
        ]
      }
    ],
  },
  {
    "tile": [
      {
        "k": "敬體 - 基本體 (口語)"
      }
    ],
    "tables": [{
      "caption": "G1",
      "header": ["敬體", " - ", "基本體"],
      "rows":
        [
          ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ます]]\"}]", "原形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|く]]\"}]"],
          ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ません]]\"}]", "ない形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"か[[blue|ない]]\"}]"],
          ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ました]]\"}]", "た形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|[[small|っ]]た]]<br/>(跟「て型」變法一樣，「て」字改成「た」字)\"}]"],
          ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ませんでした]]\"}]", "なか[[small|っ]]た形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|かなか[[small|っ]]た]]\"}]"]
        ]
    }]
  },
  {
    "tile": "あります G1 特例",
    "trans": "有沒有的\"有\"。例如: 有水嗎?",
    "tables": [{
      "header": ["敬體", "", "基本體"],
      "rows":
        [
          ["[{\"k\":\"あり[[blue|ます]]\"}]", "原形", "[{\"k\":\"ある\"}]"],
          ["[{\"k\":\"あり[[blue|ません]]\"}]", "ない形", "[{\"k\":\"[[icon|success-icon]][[blue|ない]]<br/>\"},{\"k\":\"[[icon|error-icon]][[blue|あらない]]\"}]"],
          ["[{\"k\":\"あり[[blue|ました]]\"}]", "た形", "[{\"k\":\"あ[[blue|[[small|っ]]た]]\"}]"],
          ["[{\"k\":\"あり[[blue|ませんでした]]\"}]", "なか[[small|っ]]た形", "[{\"k\":\"[[icon|success-icon]][[blue|なか[[small|っ]]た]]<br/>[[icon|error-icon]][[blue|あらなか[[small|っ]]た]]\"}]"]
        ]

    }]
  },
  {
    "tile": "た形",
    "trans": "跟「て型」變法一樣，「て」字改成「た」字",
    "tables": [{
      "header": ["ます形", "原形", "て形", "た形"],
      "caption": "G1",
      "rows":
        [
          ["[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"ります\"}]", "[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|る]]\"}]", "[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|[[small|っ]]て]]\"}]", "[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|[[small|っ]]た]]\"}]"],
          ["[{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"みます\"}]", "[{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"[[blue|む]]\"}]", "[{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"[[blue|んで]]\"}]", "[{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"[[blue|んだ]]\"}]"],
          ["[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"きます\"}]", "[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"[[blue|く]]\"}]", "[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"[[blue|いて]]\"}]", "[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"[[blue|いた]]\"}]"],
          ["[{\"k\":\"急\",\"f\":\"いそ\"},{\"k\":\"ぎます\"}]", "[{\"k\":\"急\",\"f\":\"いそ\"},{\"k\":\"[[blue|ぐ]]\"}]", "[{\"k\":\"急\",\"f\":\"いそ\"},{\"k\":\"[[blue|いで]]\"}]", "[{\"k\":\"急\",\"f\":\"いそ\"},{\"k\":\"[[blue|いだ]]\"}]"]
        ]
    },
    {
      "header": ["ます形", "原形", "て形", "た形"],
      "caption": "G2",
      "rows":
        [
          ["[{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べます\"}]", "[{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|る]]\"}]", "[{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|て]]\"}]", "[{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|た]]\"}]"],
          ["[{\"k\":\"います\"}]", "[{\"k\":\"い[[blue|る]]\"}]", "[{\"k\":\"い[[blue|て]]\"}]", "[{\"k\":\"い[[blue|た]]\"}]"]
        ]

    },
    {
      "header": ["ます形", "原形", "て形", "た形"],
      "caption": "G3",
      "rows":
        [
          ["[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"ます\"}]", "[{\"k\":\"来\",\"f\":\"く\"},{\"k\":\"[[blue|る]]\"}]", "[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|て]]\"}]", "[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|た]]\"}]"],
          ["[{\"k\":\"し[[blue|ます]]\"}]", "[{\"k\":\"[[blue|する]]\"}]", "[{\"k\":\"[[blue|して]]\"}]", "[{\"k\":\"[[blue|した]]\"}]"],
          ["[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|します]\"}]", "[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|する]]\"}]", "[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|して]]\"}]", "[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|した]]\"}]"],
        ]

    },
    ]
  }
];
