window.grammarData1 = [
    {
        "exam": [
            {
                "id": "",
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "黃","f":"こう"
                            },
                            {
                                "k":"さんは"
                            },
                            {
                                "k": "会","f":"かい"
                            },
                            {
                                "k": "社","f":"しゃ"
                            },
                            {
                                "k": "員","f":"いん"
                            },
                            {
                                "k":"ですか。"
                            }
                        ],
                        "zh": "黃先生是公司職員嗎？"
                    },
                    {
                        "jp": [
                            {
                                "k":"はい、そうです"
                            }
                        ],
                        "zh": "是，是的"
                    },
                    {
                        "jp": [
                            {
                                "k": "李","f":"り"
                            },
                            {
                                "k":"さんは"
                            },
                            {
                                "k": "学","f":"がく"
                            },
                            {
                                "k": "生","f":"せい"
                            },
                            {
                                "k":"ですか。"
                            }
                        ],
                        "zh": "李小姐是學生嗎？"
                    },
                    {
                        "jp": [
                            {
                                "k":"いいえ、学生しゃありません"
                            }
                        ],
                        "zh": "是，是的"
                    }
                ]
            },
            {
                "id": "",
                "dia": [
                    {
                        "jp": [
                            {
                                "k":"お"
                            },
                            {
                                "k": "国","f":"くに"
                            },
                            {
                                "k":"はタイですか。"
                            }
                        ],
                        "zh": "國家是泰國嗎？"
                    },
                    {
                        "jp": [
                            {
                                "k":"いいえ、"
                            },
                            {
                                "k": "違","f":"ちが"
                            },
                            {
                                "k":"います。"
                            },
                            {
                                "k": "台","f":"たぃ"
                            },
                            {
                                "k": "湾","f":"わん"
                            },
                            {
                                "k":"です。"
                            }
                        ],
                        "zh": "不，不是，是台灣"
                    }
                ]
            }
        ]
    },
    {
        "tile": "名詞 - 否定句",
        "desp": "A [[blue|は]] B [br1]",
        "trans": "A不是B",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "私","f":"わたし"
                            },
                            {
                                "k":"は"
                            },
                            {
                                "k": "韓","f":"か"
                            },
                            {
                                "k": "国","f":"こく"
                            },
                            {
                                "k": "人","f":"じん"
                            },
                            {
                                "k":"[br1]"
                            }
                        ],
                        "zh": "我不是韓國人"
                    }
                ]
            }
        ],
        "br1": [
            "じゃありません",
            "じゃないです",
            "ではありません"
        ]
    },
    {
        "tile": "名詞 - 疑問句",
        "desp": "A [[blue|は]] B [[blue|ですか]]",
        "trans": "A是B嗎？",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "先","f":"せん"
                            },
                            {
                                "k": "生","f":"せい"
                            },
                            {
                                "k":"は"
                            },
                            {
                                "k": "日","f":"に"
                            },
                            {
                                "k": "本","f":"ほん"
                            },
                            {
                                "k": "人","f":"じん"
                            },
                            {
                                "k":"ですか。"
                            }
                        ],
                        "zh": "老師是日本人嗎？"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "黃","f":"こう"
                            },
                            {
                                "k": "さんは"
                            },
                            {
                                "k": "会","f":"かい"
                            },
                            {
                                "k": "社","f":"しゃ"
                            },
                            {
                                "k": "員","f":"いん"
                            },
                            {
                                "k":"ですか。"
                            }
                        ],
                        "zh": "黃先生是公司職員嗎？"
                    }
                ]
            }
        ]
    },
    {
        "tile": "名詞 - 肯定句",
        "desp": "A [[blue|は]] B [[blue|です]]",
        "trans": "A是B",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "私","f":"わたし"
                            },
                            {
                                "k":"は"
                            },
                            {
                                "k": "蔡","f":"さい"
                            },
                            {
                                "k":"です"
                            }
                        ],
                        "zh": "我是蔡小姐/先生"
                    }
                ]
            },{
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "あの"
                            },
                            {
                                "k": "人","f":"ひと"
                            },
                            {
                                "k":"は"
                            },
                            {
                                "k": "A: 先","f":"せん"
                            },
                            {
                                "k": "A: 生","f":"せい"
                            },
                            {
                                "k":"です"
                            }
                        ],
                        "zh": "那個人是老師"
                    }
                ]
            }
        ]
    }
];