window.grammarData1 = [
    {
        "tile": "複習 名詞 + を + 動詞",
        "desp": "包含口語(動詞變化)。口語:助詞 を 可省略 ",
        "trans": "[[icon-important|]]口語:方向助詞 へ [[yellow|不]]可省略 ",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "カメラ[[blue|を]]"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "い[[blue-underline|ました|]]"
                        }
                        ],
                        "zh": "⬇"
                    },
                    {
                        "jp": [
                            {
                                "k": "カメラ[[blue|(を)]]"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "[[blue|[[small|っ]]た]]"
                            }
                        ],
                        "zh": "買[[blue|了]]相機"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "荷",
                                "f": "に"
                            },
                            {
                                "k": "物",
                                "f": "もつ"
                            },
                            {
                                "k": "[[blue|(を)]]"
                            },
                            {
                                "k": "預",
                                "f": "あず"
                            },
                            {
                                "k": "[[blue-underline|けませんでした|]]"
                            }
                        ],
                        "zh": "⬇"
                    },
                    {
                        "jp": [
                            {
                                "k": "荷",
                                "f": "に"
                            },
                            {
                                "k": "物",
                                "f": "もつ"
                            },
                            {
                                "k": "[[blue|を]]"
                            }, {
                                "k": "預",
                                "f": "あず"
                            },,
                            {
                                "k": "[[blue|けなかった]]"
                            }
                        ],
                        "zh": "[[blue|沒有]]寄放行李箱"
                    }
                ]
            }
        ]
    },
    {
        "tile": "9/23補充",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [{
                            "k": "言",
                            "f": "い"
                        }, {
                            "k": "います→"
                            },
                            {
                                "k": "[[box|\"[{\"k\":\"言\",\"f\":\"い\"}]\"]][[notetop|[[note1]]]]わない"
                        }
                        ],
                        "zh": ""
                    }
                ]
            }
        ],
        "note": {
            "note1": [
                {
                    "k": "念ゆ的發音，不是い。"
                }
            ]
        }
    },
    {
        "tile": "どんな",
        "desp": "(直接加名詞，不可以加[[blue|の]])",
        "trans": "怎麼樣的",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [{
                            "k": "A : "
                        },
                        {
                            "k": "陳",
                            "f": "ちん"
                        },
                        {
                            "k": "さん"
                        },
                        {
                            "k": "[[blue|の]]"
                        },
                        {
                            "k": "彼",
                            "f": "かの"
                        },
                        {
                            "k": "女",
                            "f": "じ[[small|ょ]]"
                        },
                        {
                            "k": "[[blue|は　どんな]]"
                        },
                        {
                            "k": "[[blue|人]]",
                            "f": "ひと"
                        },
                        {
                            "k": "ですか。"
                        }
                        ],
                        "zh": "陳先生[[blue|的]]女朋友是[[blue|怎麼樣的人]]呢?"
                    },
                    {
                        "jp": [{
                            "k": "B : "
                        },
                        {
                            "k": "優",
                            "f": "やさ"
                        },
                        {
                            "k": "し"
                        },
                        {
                            "k": "[[blue|い]]"
                        },
                        {
                            "k": "[[blue|人]]",
                            "f": "ひと"
                        },
                        {
                            "k": "です。"
                        }
                        ],
                        "zh": "溫柔[[blue|的]]人"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [{
                            "k": "A : "
                        },
                        {
                            "k": "韓国料理[[blue|は　どんな料理]]ですか。"
                        }
                        ],
                        "zh": "韓國料理是怎麼樣的料理呢?"
                    },
                    {
                        "jp": [{
                            "k": "B : "
                        },
                        {
                            "k": "辛",
                            "f": "から"
                        },
                        {
                            "k": "い料理"
                        }
                        ],
                        "zh": "[[box|辣的]][[notetop|[[note1]]]]料理"
                    }
                ]
            }
        ],

        "note": {
            "note1": [
                {
                    "k": "辛",
                    "f": "から"
                },
                { "k": "い" }
            ]
        }
    },
    {
        "tile": [
            {
                "k": "何",
                "f": "なん"
            },
            {
                "k": "でもいいです。"
            }
        ],
        "desp": "什麼都可以。",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "何",
                                "f": "なん"
                            },
                            {
                                "k": "でもいいです[[blue|か]]"
                            }
                        ],
                        "zh": "什麼都可以[[blue|嗎？]]"
                    },
                    {
                        "jp": [
                            {
                                "k": "何",
                                "f": "なん"
                            },
                            {
                                "k": "でもい[[pitch-q|\"[{\"k\":\"い\",\"p\":\"H\"}]\"]]([[strike|ですか]])"
                            }
                        ],
                        "zh": "什麼都可以嗎？[[blue|(口語)]](比較常聽到)"
                    }
                ]
            }
        ]
    },
    {
        "tile": "...的...",
        "desp": "[br1]",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "英",
                                "f": "えい"
                            },
                            {
                                "k": "語",
                                "f": "ご"
                            },
                            {
                                "k": "[[blue|の]]"
                            },
                            {
                                "k": "先",
                                "f": "せん"
                            },
                            {
                                "k": "生",
                                "f": "せい"
                            },
                            {
                                "k": "[[blue|です]]"
                            }
                        ],
                        "zh": "英文老師"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "きれい[[blue|な]]"
                            },
                            {
                                "k": "町",
                                "f": "まち"
                            },
                            {
                                "k": "[[blue|です]]"
                            }
                        ],
                        "zh": "漂亮[[blue|的]]城鎮"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "[[blue|いい]]"
                            },
                            {
                                "k": "天",
                                "f": "てん"
                            },
                            {
                                "k": "気",
                                "f": "き"
                            },
                            {
                                "k": "です"
                            }
                        ],
                        "zh": "好[[blue|的]]天氣"
                    }
                ]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "小",
                                "f": "てん"
                            },
                            {
                                "k": "さ[[blue|い]]"
                            },
                            {
                                "k": "[[blue|店]]",
                                "f": "みせ"
                            },
                            {
                                "k": "です。"
                            }
                        ],
                        "zh": "小間[[blue|的店]]"
                    }
                ]
            },
            {
                "id": 5,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "新",
                                "f": "しん"
                            },
                            {
                                "k": "切",
                                "f": "せつ"
                            },
                            {
                                "k": "[[blue|な]]"
                            },
                            {
                                "k": "台",
                                "f": "たい"
                            },
                            {
                                "k": "湾",
                                "f": "わん"
                            },
                            {
                                "k": "人",
                                "f": "じん"
                            },
                            {
                                "k": "です。"
                            }
                        ],
                        "zh": "親切[[blue|的]]台灣人"
                    }
                ]
            },
            {
                "id": 6,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "[[blue|おもしろい]]"
                            },
                            {
                                "k": "映",
                                "f": "えい"
                            },
                            {
                                "k": "画",
                                "f": "が"
                            },
                            {
                                "k": "です。"
                            }
                        ],
                        "zh": "[[blue|好看的]]電影"
                    }
                ]
            },
            {
                "id": 7,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "新",
                                "f": "しん"
                            },
                            {
                                "k": "鮮",
                                "f": "せん"
                            },
                            {
                                "k": "[[blue|な]]"
                            },
                            {
                                "k": "とり"
                            },
                            {
                                "k": "肉",
                                "f": "にく"
                            },
                            {
                                "k": "です。"
                            }
                        ],
                        "zh": "新鮮[[blue|的]]雞肉"
                    }
                ]
            },
            {
                "id": 8,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "きれい[[blue|な]]"
                            },
                            {
                                "k": "日",
                                "f": "に"
                            },
                            {
                                "k": "本",
                                "f": "ほん"
                            },
                            {
                                "k": "語",
                                "f": "ご"
                            },
                            {
                                "k": "[[blue|の]]先生です。"
                            }
                        ],
                        "zh": "漂亮[[blue|的]]日文老師"
                    }
                ]
            }
        ],
        "br1": [
            "名詞 + の + 名詞",
            "な形 + な + 名詞",
            "い形直接加名詞"
        ]

    },
    {
        "tile": "a. い形容詞 - 否定型",
        "desp": "([[strike|い]] [br1])",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "高",
                                "f": "たか"
                            },
                            {
                                "k": "い[[blue|です]]。 [[dash|-]]"
                            },
                            {
                                "k": "高",
                                "f": "たか"
                            },
                            {
                                "k": "[[strike|い]] [br2]"
                            }
                        ],
                        "zh": "高的，貴的。 [[dash|-]]  不高，不貴。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "安",
                                "f": "やす"
                            },
                            {
                                "k": "い[[blue|です]]。 [[dash|-]] "
                            },
                            {
                                "k": "安",
                                "f": "やす"
                            },
                            {
                                "k": "[[strike|い]] [br2]"
                            }
                        ],
                        "zh": "便宜的。  [[dash|-]]  不便宜。"
                    }
                ]
            }, {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "この"
                            },
                            {
                                "k": "映",
                                "f": "えい"
                            },
                            {
                                "k": "画",
                                "f": "が"
                            },
                            {
                                "k": "は おもしろ[[strike|い]] [br2]"
                            }
                        ],
                        "zh": "這部電影[[blue|不好看]]。"
                    }
                ]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "これ は おいし[[strike|い]] [br2]"
                            }
                        ],
                        "zh": "這個[[blue|不好喝]]。"
                    }
                ]
            }
        ],
        "br1": [
            "+ く + ないです。",
            "+ く + ありません。"
        ],
        "br2": [
            "くないです。(口語)",
            "くありません。(偏考試)"
        ],
        "br3": [
            "くないです。",
            "くありません。"
        ],
        "tables": [{
            "header": ["肯定", "否定"],
            "rows":
                [
                    ["[{\"k\":\"悪\",\"f\":\"わる\"},{\"k\":\"い[[blue|です]]\"}]", "[{\"k\":\"悪\",\"f\":\"わる\"},{\"k\":\"[br3]\"}]"],
                    ["[{\"k\":\"おもしろい[[blue|です]]\"}]", "[{\"k\":\"おもしろ[br3]\"}]"],
                    ["[{\"k\":\"広\",\"f\":\"ひろ\"},{\"k\":\"い[[blue|です]]\"}]", "[{\"k\":\"広\",\"f\":\"ひろ\"},{\"k\":\"[br3]\"}]"]
                ]
        }]
    },
    {
        "tile": "い形容詞 特例",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "いいです。- [[icon|error-icon]] い[[strike|い]] [br1]"
                            }
                        ],
                        "zh": ""
                    },
                    {
                        "jp": [
                            {
                                "k": "良",
                                "f": "よ"
                            },
                            {
                                "k": "いです。- [[icon|success-icon]] よ[[strike|い]] [br1]"
                            }
                        ],
                        "zh": "好   -    不好"
                    }
                ]
            }
        ],
        "br1": [
            "くないです。",
            "くありません。"
        ]
    },
    {
        "tile": "b. な形容詞 - 否定型",
        "desp": "～ [br1]",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "きれい[[blue|です]]。 [[dash|-]] "
                            },
                            {
                                "k": "きれい [br1]"
                            }
                        ],
                        "zh": "漂亮，乾淨。 [[dash|-]]  不漂亮，不乾淨。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "この"
                            },
                            {
                                "k": "肉",
                                "f": "にく"
                            },
                            {
                                "k": "は"
                            },
                            {
                                "k": "新",
                                "f": "しん"
                            },
                            {
                                "k": "鮮",
                                "f": "せん"
                            },
                            {
                                "k": "[[blue|じゃ ないです。]]"
                            }
                        ],
                        "zh": "這塊肉[[blue|不]]新鮮。"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "林",
                                "f": "りん"
                            },
                            {
                                "k": "さん[[blue|の]]"
                            },
                            {
                                "k": "彼",
                                "f": "かの"
                            },
                            {
                                "k": "女",
                                "f": "じょ"
                            },
                            {
                                "k": "は きれい[br2]"
                            }
                        ],
                        "zh": "林先生[[blue|的]]女朋友不漂亮。"
                    }
                ]
            }
        ],
        "br1": [
            "じゃ ないです。",
            "じゃ ありません。",
            "では ありません。"
        ],
        "br2": [
            "じゃないです。",
            "じゃありません。"
        ],
        "br3": [
            "くないです。",
            "くありません。"
        ],
        "tables": [{
            "header": ["肯定", "否定"],
            "rows":
                [
                    ["[{\"k\":\"新\",\"f\":\"しん\"},{\"k\":\"鮮\",\"f\":\"せん\"},{\"k\":\"[[blue|です]]\"}]", "[{\"k\":\"新\",\"f\":\"しん\"},{\"k\":\"鮮\",\"f\":\"せん\"},{\"k\":\"[br1]\"}]"],
                    ["[{\"k\":\"嫌\",\"f\":\"きら\"},{\"k\":\"[[blue|です]]\"}]", "[{\"k\":\"嫌\",\"f\":\"きら\"},{\"k\":\"[br1]\"}]"]
                ]

        }]
    },
    {
        "tile": "a. い形容詞 - (肯定型) ～いです。",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "おもしろい[[blue|です]]。"
                            }
                        ],
                        "zh": "有趣的"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "その"
                            },
                            {
                                "k": "映",
                                "f": "えい"
                            },
                            {
                                "k": "画",
                                "f": "が"
                            },
                            {
                                "k": "[[space|は]]おもしろい[[blue|です]]。"
                            }
                        ],
                        "zh": "那部電影很好看。"
                    }
                ]
            }
        ]
    },
    {
        "tile": "b. な形容詞 - (肯定型) です。",
        "desp": "有兩個特例是歸在な形 : [br1]",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "きれい[[blue|です]]。"
                            }
                        ],
                        "zh": "漂亮的"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "林",
                                "f": "りん"
                            },
                            {
                                "k": "さん[[space|は]]きれい[[blue|です]]。"
                            }
                        ],
                        "zh": "林小姐很漂亮。"
                    }
                ]
            }
        ],
        "br1": [
            "きれい (乾淨，漂亮)",
            "[{\"k\":\"嫌\",\"f\":\"きら\"},{\"k\":\"い(討厭)\"}]"
        ]
    },
    {
        "tile": "どう  (如何?)",
        "desp": "[[icon|error-icon]] 不能背: 怎麼樣的",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A: そのラーメンは [[blue|どう]] ですか。"
                            }
                        ],
                        "zh": "A: 那碗拉麵[[blue|如何]]?"
                    },
                    {
                        "jp": [
                            {
                                "k": "B: おいしいです。"
                            }
                        ],
                        "zh": "B: 好吃。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A:"
                            },
                            {
                                "k": "陳",
                                "f": "ちん"
                            },
                            {
                                "k": "さん[[blue|の]]"
                            },
                            {
                                "k": "彼",
                                "f": "かれ"
                            },
                            {
                                "k": "氏",
                                "f": "し"
                            },
                            {
                                "k": "は[[blue|どう]]ですか。"
                            }
                        ],
                        "zh": "A: 陳小姐的男朋友[[blue|如何呢]]?"
                    },
                    {
                        "jp": [
                            {
                                "k": "B: ハンサム[[bule|です。]]"
                            }
                        ],
                        "zh": "B: 英俊。"
                    }
                ]
            }
        ]
    },
    {
        "tile": "名詞 + が + ほしい (想要...)",
        "desp": "指著想要某物",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "車",
                                "f": "くるま"
                            },
                            {
                                "k": "[[blue| が ほしいです]]。"
                            }
                        ],
                        "zh": "[[blue|想要]]車子。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "お"
                            },
                            {
                                "k": "金",
                                "f": "かね"
                            },
                            {
                                "k": "[[blue| が ほしいです]]。"
                            }
                        ],
                        "zh": "[[blue|想要]]錢。"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "私",
                                "f": "わたし"
                            },
                            {
                                "k": "[[blue| は ]]スマホ[[blue|がほしいです。]]"
                            }
                        ],
                        "zh": "我[[blue|想要]]手機。"
                    }
                ]
            }
        ]
    },
    {
        "tile": "~が~[[strike|ます]] + たい~(想做某事)想...",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "1. "
                            },
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "べます。"
                            }
                        ],
                        "zh": "吃。"
                    },
                    {
                        "jp": [
                            {
                                "k": "2. "
                            },
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "べ[[strike|ます]]たいです。"
                            }
                        ],
                        "zh": "想吃。"
                    },
                    {
                        "jp": [
                            {
                                "k": "3. ラ－メン[[blue|を]]"
                            },
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "べ[[blue|ます。]]"
                            }
                        ],
                        "zh": "[[blue|吃]]拉麵。"
                    },
                    {
                        "jp": [
                            {
                                "k": "4. ラ－メン[[blue|が]]"
                            },
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "べ[[strike|ます]] [[blue|たいです。]]"
                            }
                        ],
                        "zh": "[[blue|想吃]]拉麵。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "1. "
                            },
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "きます。"
                            }
                        ],
                        "zh": "聽，問。"
                    }, {
                        "jp": [
                            {
                                "k": "2. "
                            },
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "き[[strike|ます]]たいです。"
                            }
                        ],
                        "zh": "想聽，想問。"
                    }, {
                        "jp": [
                            {
                                "k": "3. "
                            },
                            {
                                "k": "音",
                                "f": "おん"
                            },
                            {
                                "k": "楽",
                                "f": "がく"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "き[[blue|ます。]]"
                            }
                        ],
                        "zh": "[[blue|聽]]音樂。"
                    },
                    {
                        "jp": [
                            {
                                "k": "4. "
                            },
                            {
                                "k": "音",
                                "f": "おん"
                            },
                            {
                                "k": "楽",
                                "f": "がく"
                            },
                            {
                                "k": "[[blue|が]]"
                            },
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "き[[strike|ます]] [[blue|たいです。]]"
                            }
                        ],
                        "zh": "[[blue|想聽]]音樂。"
                    }
                ]
            }
        ]
    },
    {
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "私[[blue|は]]"
                            },
                            {
                                "k": "運",
                                "f": "うん"
                            },
                            {
                                "k": "動",
                                "f": "どう"
                            },
                            {
                                "k": "し[[blue|たいです。]]"
                            }
                        ],
                        "zh": "我[[blue|想]][[box|運動]][[notetop|[[note2]]]]"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "私[[blue|は]]"
                            },
                            {
                                "k": "靴",
                                "f": "くつ"
                            },
                            {
                                "k": "[[box|が]][[blue|ほしいです。]]"
                            }
                        ],
                        "zh": "我[[blue|想要]]鞋子"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "陳さん[[blue|は]]"
                            },
                            {
                                "k": "何",
                                "f": "なん"
                            },
                            {
                                "k": "歳",
                                "f": "さい"
                            },
                            {
                                "k": "[[blue|まで]]"
                            },
                            {
                                "k": "仕",
                                "f": "し"
                            },
                            {
                                "k": "事",
                                "f": "ごと"
                            },
                            {
                                "k": "し[[blue|たいですか。]]"
                            }
                        ],
                        "zh": "陳先生[[blue|想]][[box|工作]][[notetop|[[note1]]]][[blue|到]]幾歲呢?"

                    }
                ]
            }
        ],
        "note": {
            "note1": [
                {
                    "k": "仕",
                    "f": "し"
                },
                {
                    "k": "事",
                    "f": "ごと"
                },
                { "k": "します" }
            ],
            "note2": [
                {
                    "k": "運",
                    "f": "うん"
                },
                {
                    "k": "動",
                    "f": "どう"
                },
                { "k": "します" }
            ]
        }
    },
    {
        "tile": [
            {
                "k": "退",
                "f": "たい"
            },
            {
                "k": "職",
                "f": "しょく"
            },
            {
                "k": "します。"
            }
        ],
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A. "
                            },
                            {
                                "k": "何",
                                "f": "なん"
                            },
                            {
                                "k": "歳",
                                "f": "さい"
                            },
                            {
                                "k": "退",
                                "f": "たい"
                            },
                            {
                                "k": "職",
                                "f": "しょく"
                            },
                            {
                                "k": "し[[strike|ます]][[box|たい]]ですか。"
                            }
                        ],
                        "zh": "幾歲想退休呢?"
                    },
                    {
                        "jp": [
                            {
                                "k": "B. "
                            },
                            {
                                "k": "50",
                                "f": "ごじゅっ"
                            },
                            {
                                "k": "歳",
                                "f": "さい"
                            },
                            {
                                "k": "[[blue|です。]]"
                            }
                        ],
                        "zh": "50歲。"
                    },
                    {
                        "jp": [
                            {
                                "k": "A. "
                            },
                            {
                                "k": "~え~"
                            },
                            {
                                "k": "早",
                                "f": "はや"
                            },
                            {
                                "k": "い[[blue|ですね。]]"
                            }
                        ],
                        "zh": ""
                    }
                ]
            }
        ],

        "visl": ""
    },
    {
        "tile": [
            {
                "k": "~が[[notetop|[[note2]]]] あります (無生命)[[notetop|[[note1]]]]有"
            }
        ],
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "花",
                                "f": "はな"
                            },
                            {
                                "k": "[[blue|が あります。]]"
                            }
                        ],
                        "zh": "[[blue|有]]花"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "本",
                                "f": "ほん"
                            },
                            {
                                "k": "[[blue|が あります。]]"
                            }
                        ],
                        "zh": "[[blue|有]]書"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません"
                            },
                            {
                                "k": "水",
                                "f": "みず"
                            },
                            {
                                "k": "[[blue|が あり]][[yellow|ますか。]]"
                            }
                        ],
                        "zh": "不好意思，[[blue|有]]水嗎?"
                    }
                ]
            }
        ],
        "visl": "",
        "note": {
            "note1": [
                {
                    "k": "植物，東西"
                }
            ],
            "note2": [
                {
                    "k": "有"
                }
            ]
        }
    },
    {
        "tile": [
            {
                "k": "降",
                "f": "[[blue|ふ]]"
            },
            {
                "k": "ります (雨/雪) 下"
            }
        ],
        "trans": "[[blue|動詞第一型]]",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "雨",
                                "f": "あま"
                            },
                            {
                                "k": "[[blue|が]]"
                            },
                            {
                                "k": "降",
                                "f": "[[blue|ふ]]"
                            },
                            {
                                "k": "[[blue|ります。]]"
                            }
                        ],
                        "zh": "下雨"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "雪",
                                "f": "ゆき"
                            },
                            {
                                "k": "[[blue|が]]"
                            },
                            {
                                "k": "降",
                                "f": "[[blue|ふ]]"
                            },
                            {
                                "k": "[[blue|ります。]]"
                            }
                        ],
                        "zh": "下雪"
                    }
                ]
            }
        ]
    },
    {
        "tile": [
            {
                "k": "降",
                "f": "[[blue|お]]"
            },
            {
                "k": "ります (交通工具) 下"
            }
        ],
        "trans": "[[blue|動詞第二型]]",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "電",
                                "f": "でん"
                            },
                            {
                                "k": "車",
                                "f": "しゃ"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "降",
                                "f": "[[blue|お]]"
                            },
                            {
                                "k": "[[blue|ります。]]"
                            }
                        ],
                        "zh": "下電車"
                    }
                ]
            }
        ]
    },
    {
        "tile": [
            {
                "k": "敬體 - 基本體 (口語)"
            }
        ],
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "きょう"
                            },
                            {
                                "k": "李",
                                "f": "り"
                            },
                            {
                                "k": "さん"
                            },
                            {
                                "k": "[[blue|は]]"
                            },
                            {
                                "k": "休",
                                "f": "やす"
                            },
                            {
                                "k": "み[[blue|ました。]]"
                            }
                        ],
                        "zh": "今天李小姐請假了"
                    },
                    {
                        "jp": [
                            {
                                "k": "きょう"
                            },
                            {
                                "k": "李",
                                "f": "り"
                            },
                            {
                                "k": "さん"
                            },
                            {
                                "k": "[[yellow|(は)]]"
                            },
                            {
                                "k": "休",
                                "f": "やす"
                            },
                            {
                                "k": "み[[blue|んだ。]]"
                            }
                        ],
                        "zh": "今天李小姐請假了(口語)"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "スマホ"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "い[[blue|ます。]]"
                            }
                        ],
                        "zh": "買手機"
                    },
                    {
                        "jp": [
                            {
                                "k": "スマホ"
                            },
                            {
                                "k": "[[yellow|(を)]]"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "[[blue|う。]]"
                            }
                        ],
                        "zh": "買手機(口語)"
                    }
                ]
            }
        ],
        "tables": [{
            "caption": "G1",
            "header": ["敬體", "", "基本體"],
            "rows":
                [
                    ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ます]]\"}]", "原形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|く]]\"}]"],
                    ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ません]]\"}]", "ない形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"か[[blue|ない]]\"}]"],
                    ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ました]]\"}]", "た形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|[[small|っ]]た]]<br/>(跟「て型」變法一樣，「て」字改成「た」字)\"}]"],
                    ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ませんでした]]\"}]", "なか[[small|っ]]た形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|かなか[[small|っ]]た]]\"}]"]
                ]
        },
        {
            "caption": "G2",
            "header": ["敬體", "", "基本體"],
            "rows":
                [
                    ["[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ます]]\"}]", "原形", "[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|る]]\"}]"],
                    ["[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ません]]\"}]", "ない形", "[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ない]]\"}]"],
                    ["[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ました]]\"}]", "た形", "[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|た]]\"}]"],
                    ["[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ませんでした]]\"}]", "なか[[small|っ]]た形", "[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|かなか[[small|っ]]た]]\"}]"]
                ]
        },
        {
            "caption": "G3 (1)",
            "header": ["敬體", "", "基本體"],
            "rows":
                [
                    ["[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|ます]]\"}]", "原形", "[{\"k\":\"来\",\"f\":\"く\"},{\"k\":\"[[blue|る]]\"}]"],
                    ["[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|ません]]\"}]", "ない形", "[{\"k\":\"来\",\"f\":\"こ\"},{\"k\":\"[[blue|ない]]\"}]"],
                    ["[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|ました]]\"}]", "た形", "[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|た]]\"}]"],
                    ["[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|ませんでした]]\"}]", "なか[[small|っ]]た形", "[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|かなか[[small|っ]]た]]\"}]"]
                ]
        },
        {
            "caption": "G3 (2)",
            "header": ["敬體", "", "基本體"],
            "rows":
                [
                    ["[{\"k\":\"し\"},{\"k\":\"[[blue|ます]]\"}]", "原形", "[{\"k\":\"し\"},{\"k\":\"[[blue|る]]\"}]"],
                    ["[{\"k\":\"し\"},{\"k\":\"[[blue|ません]]\"}]", "ない形", "[{\"k\":\"し\"},{\"k\":\"[[blue|ない]]\"}]"],
                    ["[{\"k\":\"し\"},{\"k\":\"[[blue|ました]]\"}]", "た形", "[{\"k\":\"し\"},{\"k\":\"[[blue|た]]\"}]"],
                    ["[{\"k\":\"し\"},{\"k\":\"[[blue|ませんでした]]\"}]", "なか[[small|っ]]た形", "[{\"k\":\"し\"},{\"k\":\"[[blue|かなか[[small|っ]]た]]\"}]"]
                ]
        }
        ]
    },
    {
        "tile": "あります G1 特例",
        "trans": "有沒有的\"有\"。例如: 有水嗎?",
        "tables": [{
            "header": ["敬體", "", "基本體"],
            "rows":
                [
                    ["[{\"k\":\"あり[[blue|ます]]\"}]", "原形", "[{\"k\":\"ある\"}]"],
                    ["[{\"k\":\"あり[[blue|ません]]\"}]", "ない形", "[{\"k\":\"[[icon|success-icon]][[blue|ない]]<br/>\"},{\"k\":\"[[icon|error-icon]][[blue|あらない]]\"}]"],
                    ["[{\"k\":\"あり[[blue|ました]]\"}]", "た形", "[{\"k\":\"あ[[blue|[[small|っ]]た]]\"}]"],
                    ["[{\"k\":\"あり[[blue|ませんでした]]\"}]", "なか[[small|っ]]た形", "[{\"k\":\"[[icon|success-icon]][[blue|なか[[small|っ]]た]]<br/>[[icon|error-icon]][[blue|あらなか[[small|っ]]た]]\"}]"]
                ]

        }]
    },
    {
        "tile": "た形",
        "trans": "跟「て型」變法一樣，「て」字改成「た」字",
        "tables": [{
            "header": ["ます形", "原形", "て形", "た形"],
            "caption": "G1",
            "rows":
                [
                    ["[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"ります\"}]", "[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|る]]\"}]", "[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|[[small|っ]]て]]\"}]", "[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|[[small|っ]]た]]\"}]"],
                    ["[{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"みます\"}]", "[{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"[[blue|む]]\"}]", "[{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"[[blue|んで]]\"}]", "[{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"[[blue|んだ]]\"}]"],
                    ["[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"きます\"}]", "[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"[[blue|く]]\"}]", "[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"[[blue|いて]]\"}]", "[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"[[blue|いた]]\"}]"],
                    ["[{\"k\":\"急\",\"f\":\"いそ\"},{\"k\":\"ぎます\"}]", "[{\"k\":\"急\",\"f\":\"いそ\"},{\"k\":\"[[blue|ぐ]]\"}]", "[{\"k\":\"急\",\"f\":\"いそ\"},{\"k\":\"[[blue|いで]]\"}]", "[{\"k\":\"急\",\"f\":\"いそ\"},{\"k\":\"[[blue|いだ]]\"}]"]
                ]
        },
        {
            "header": ["ます形", "原形", "て形", "た形"],
            "caption": "G2",
            "rows":
                [
                    ["[{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べます\"}]", "[{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|る]]\"}]", "[{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|て]]\"}]", "[{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|た]]\"}]"],
                    ["[{\"k\":\"います\"}]", "[{\"k\":\"い[[blue|る]]\"}]", "[{\"k\":\"い[[blue|て]]\"}]", "[{\"k\":\"い[[blue|た]]\"}]"]
                ]

        },
        {
            "header": ["ます形", "原形", "て形", "た形"],
            "caption": "G3",
            "rows":
                [
                    ["[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"ます\"}]", "[{\"k\":\"来\",\"f\":\"く\"},{\"k\":\"[[blue|る]]\"}]", "[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|て]]\"}]", "[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|た]]\"}]"],
                    ["[{\"k\":\"し[[blue|ます]]\"}]", "[{\"k\":\"[[blue|する]]\"}]", "[{\"k\":\"[[blue|して]]\"}]", "[{\"k\":\"[[blue|した]]\"}]"],
                    ["[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|します]]\"}]", "[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|する]]\"}]", "[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|して]]\"}]", "[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|した]]\"}]"]
                ]

        }
        ]
    },
    {
        "tile": "~て形+も+いいですか",
        "trans": "(請求句型)可以……嗎？",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "アイスクリーム"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "べます。"
                            }
                        ],
                        "zh": "吃冰淇淋"
                    },
                    {
                        "jp": [
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "[[blue|べてもいいですか。]]"
                            }
                        ],
                        "zh": "可以吃嗎？"
                    },
                    {
                        "jp": [
                            {
                                "k": "お"
                            },
                            {
                                "k": "母",
                                "f": "かあ"
                            },
                            {
                                "k": "さん、アイスクリームを"
                            },
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "べ[[blue-underline|ても|]][[blue-underline|いい|]][[blue-underline|ですか。|]]"
                            }
                        ],
                        "zh": "媽媽可以吃冰淇淋嗎？"
                    }
                ]
            }
        ]
    },
    {
        "tile": "穿戴動詞搭配:",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "[[blue-underline|きもの|着物]][[blue|を]][[blue-underline|き|着]][[blue|ます]]"
                            }
                        ],
                        "zh": "穿和服"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "スリ[[small|ッ]]パ[[blue|をはきます。]]"
                            }
                        ],
                        "zh": "穿拖鞋"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "ピアス[[blue|をします。]]"
                            }
                        ],
                        "zh": "戴耳環"
                    }]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "めがね[[blue|をかけます。]]"
                            }
                        ],
                        "zh": "戴眼鏡"
                    }]
            },
            {
                "id": 5,
                "dia": [
                    {
                        "jp": [
                            { "k": "帽", "f": "ぼ" },
                            { "k": "子", "f": "うし" },
                            {
                                "k": "[[blue|をかぶります。]]"
                            }
                        ],
                        "zh": "戴帽子"
                    }]
            },
            {
                "id": 6,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "マスク[[blue|をします。]]"
                            }
                        ],
                        "zh": "戴口罩"
                    }]
            },
            {
                "id": 7,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "ゆびわ[[blue|を]][br1]"
                            }
                        ],
                        "zh": "戴戒指<br/>[[icon-important|]]配件類的動詞可以直接用「します」"
                    }
                ]
            }
        ],
        "br1": [
            "つけます。",
            "します。"
        ]
    },
    {
        "tile": "て形+ください",
        "trans": "(有輕微命令的請)",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "きます"
                            }
                        ],
                        "zh": "聽、問"
                    },
                    {
                        "jp": [
                            {
                                "k": "音",
                                "f": "おん"
                            },
                            {
                                "k": "楽",
                                "f": "がく"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "きます。"
                            }
                        ],
                        "zh": "[[blue|聽]]音樂"
                    },
                    {
                        "jp": [
                            {
                                "k": "音",
                                "f": "おん"
                            },
                            {
                                "k": "楽",
                                "f": "がく"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "いて[[blue|ください]]。"
                            }
                        ],
                        "zh": "[[blue|請]]聽音樂"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "預",
                                "f": "あず"
                            },
                            {
                                "k": "けます"
                            }
                        ],
                        "zh": "寄放"
                    },
                    {
                        "jp": [
                            {
                                "k": "荷",
                                "f": "に"
                            },
                            {
                                "k": "物",
                                "f": "もつ"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "預",
                                "f": "あず"
                            },
                            {
                                "k": "けます。"
                            }
                        ],
                        "zh": "寄放行李"
                    },
                    {
                        "jp": [
                            {
                                "k": "荷",
                                "f": "に"
                            },
                            {
                                "k": "物",
                                "f": "もつ"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "預",
                                "f": "あず"
                            },
                            {
                                "k": "け[[blue|てください]]。"
                            }
                        ],
                        "zh": "[[blue|請]]寄放行李"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "います"
                            }
                        ],
                        "zh": "買"
                    },
                    {
                        "jp": [
                            {
                                "k": "切",
                                "f": "きっ"
                            },
                            {
                                "k": "票",
                                "f": "ぷ"
                            },
                            {
                                "k": "/チケット[[blue|を]]"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "います"
                            }
                        ],
                        "zh": "買票"
                    },
                    {
                        "jp": [
                            {
                                "k": "切",
                                "f": "きっ"
                            },
                            {
                                "k": "票",
                                "f": "ぷ"
                            },
                            {
                                "k": "/チケット[[blue|を]]"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "って[[blue|ください]]"
                            }
                        ],
                        "zh": "請買票"
                    }
                ]
            },
            {
                "id": "4 重點",
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "頑",
                                "f": "がん"
                            },
                            {
                                "k": "張",
                                "f": "ば"
                            },
                            {
                                "k": "ります"
                            }
                        ],
                        "zh": "加油"
                    },
                    {
                        "jp": [
                            {
                                "k": "先生："
                            },
                            {
                                "k": "頑",
                                "f": "がん"
                            },
                            {
                                "k": "張",
                                "f": "ば"
                            },
                            {
                                "k": "って[[blue|くださいね]]"
                            }
                        ],
                        "zh": "請加油"
                    },
                    {
                        "jp": [
                            {
                                "k": "[[icon|success-icon]]學生：はい、"
                            },
                            {
                                "k": "頑",
                                "f": "がん"
                            },
                            {
                                "k": "張",
                                "f": "ば"
                            },
                            {
                                "k": "[[blue|ります]]"
                            }
                        ],
                        "zh": "好的，會加油的"
                    },
                    {
                        "jp": [
                            {
                                "k": "[[icon|error-icon]]學生：はい、"
                            },
                            {
                                "k": "頑",
                                "f": "がん"
                            },
                            {
                                "k": "張",
                                "f": "ば"
                            },
                            {
                                "k": "[[blue|って]]"
                            }
                        ],
                        "zh": "(這個回答是錯的)"
                    }
                ]
            }
        ]
    },
    {
        "tile": "で",
        "trans": "(用，有「方法、手段、工具」涵意)",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、"
                            },
                            {
                                "k": "現",
                                "f": "げん"
                            },
                            {
                                "k": "金",
                                "f": "きん"
                            },
                            {
                                "k": "[[box|で]][[blue|お]]"
                            },
                            {
                                "k": "[[blue|願]]",
                                "f": "ねが"
                            },
                            {
                                "k": "[[blue|いします。]]"
                            }
                        ],
                        "zh": "不好意思，我付現金。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、"
                            },
                            {
                                "k": "氷",
                                "f": "こお"
                            },
                            {
                                "k": "り"
                            },
                            {
                                "k": "抜",
                                "f": "ぬ"
                            },
                            {
                                "k": "き"
                            },
                            {
                                "k": "[[box|で]][[blue|お]]"
                            },
                            {
                                "k": "[[blue|願]]",
                                "f": "ねが"
                            },
                            {
                                "k": "[[blue|いします。]]"
                            }
                        ],
                        "zh": "不好意思去冰。"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、"
                            },
                            {
                                "k": "持",
                                "f": "も"
                            },
                            {
                                "k": "ち"
                            },
                            {
                                "k": "帰",
                                "f": "かえ"
                            },
                            {
                                "k": "り"
                            },
                            {
                                "k": "[[box|で]][[blue|お]]"
                            },
                            {
                                "k": "[[blue|願]]",
                                "f": "ねが"
                            },
                            {
                                "k": "[[blue|いします。]]"
                            }
                        ],
                        "zh": "不好意思外帶。"
                    }
                ]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、トリングは"
                            },
                            {
                                "k": "2",
                                "f": "ふた"
                            },
                            {
                                "k": "つ[[blue|ずつ]]"
                            },
                            {
                                "k": "[[blue|お]]"
                            },
                            {
                                "k": "[[blue|願]]",
                                "f": "ねが"
                            },
                            {
                                "k": "[[blue|いします。]]"
                            }
                        ],
                        "zh": "不好意思，飲料麻煩[[blue|各]]2杯"
                    }
                ]
            },

            {
                "id": 5,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、1本ずつ願いします。"
                            }
                        ],
                        "zh": "不好意思，飲料麻煩[[blue|各]]2杯"
                    }
                ]
            }, {
                "id": 6,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、チョコひとつ[[blue|と]]バニラひとつ[[blue|と]]マンゴひとつ[[blue|ずつ]]願いします。"
                            }
                        ],
                        "zh": "不好意思，巧克力、香草、哈蜜瓜冰淇淋各一支"
                    }
                ]
            }
        ]
    }, {
        "tile": "數量詞+[[blue-underline|ずつ|各…]]",
        "trans": "用於平均數量時",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "2人",
                                "f": "ふたり"
                            },
                            {
                                "k": "[[blue|ずつ]]、[[box|\"[{\"k\":\"座\",\"f\":\"すわ\"},{\"k\":\"って\"}]\"]][[notetop|[[note1]]]]ください。"
                            }
                        ],
                        "zh": "請2個人2個人坐。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、このケーキ"
                            },
                            {
                                "k": "2",
                                "f": "ふた"
                            },
                            {
                                "k": "つずつお"
                            },
                            {
                                "k": "願",
                                "f": "ねが"
                            },
                            {
                                "k": "いします。"
                            }
                        ],
                        "zh": "不好意思，這個蛋糕麻煩各2個。"
                    }
                ]
            }
        ],
        "note": {
            "note1": [
                {
                    "k": "座",
                    "f": "すわ"
                },
                { "k": "ります" },
                { "k": " [[blue|G1動詞]]" }
            ]
        }

    },
    {
        "tile": "動詞 (判別類型規則)",
        "tables": [{
            "header": ["類型", "規則"],
            "caption": "有3大類(G1、G2、G3)",
            "rows":
                [
                    ["[{\"k\":\"G1\"}]", "[{\"k\":\"如果判斷該動詞為「G1」動詞，從「ます」前的字母來判斷，ます前的字母[[blue|沒有超過那行字母的第3字母，這動詞為「G1」動詞。]]\"}]"],
                    ["[{\"k\":\"G1範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|き]]ます  \"},{\"k\":\"2.\"},{\"k\":\"入\",\"f\":\"は[[blue|い]]\"},{\"k\":\"ます\"}]"],
                    ["[{\"k\":\"G2\"}]", "[{\"k\":\"如果判斷該動詞為「G2」動詞，從「ます」前的字母來判斷，ます前的字母[[blue|已超過那行字母的第3字母，這動詞為「G2」動詞或「ます」前只有1個50音字母，不管這字母有沒有超過第3字母，這動詞為「G2」動詞。]]\"}]"],
                    ["[{\"k\":\"G2範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"[[blue|べ]]ます  \"},{\"k\":\"2.[[blue|い]]ます  3.\"},{\"k\":\"着\",\"f\":\"[[blue|き]]\"},{\"k\":\"ます\"}]"],
                    ["[{\"k\":\"G3\"}]", "[{\"k\":\"1.\"},{\"k\":\"[[blue|来]]\",\"f\":\"き\"},{\"k\":\"[[blue|ます。]]  2.[[blue|します。+します，2個漢字加「します」為「G3」動詞]]\"}]"],
                    ["[{\"k\":\"G3範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|します]]\"}]"],
                    ["", "[{\"k\":\"[[icon-important|]]1個漢字加「します」為「G1」動詞，例: \"},{\"k\":\"出\",\"f\":\"だ\"},{\"k\":\"[[blue|します]]\"}]"]
                ]
            }
        ]
    }
];
