window.grammarData1 = [
  {
    "tile": "a. い形容詞 - 否定型",
    "desp": "([[strike|い]] [br1])",
    "trans": "",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "高",
                "f": "たか"
              },
              {
                "k": "い[[blue|です]]。 [[dash|-]] "
              },
              {
                "k": "高",
                "f": "たか"
              },
              {
                "k": "[[strike|い]] [br2]"
              }
            ],
            "zh": "高的，貴的。 [[dash|-]]  不高，不貴。"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "安",
                "f": "やす"
              },
              {
                "k": "い[[blue|です]]。 [[dash|-]] "
              },
              {
                "k": "安",
                "f": "やす"
              },
              {
                "k": "[[strike|い]] [br2]"
              }
            ],
            "zh": "便宜的。  [[dash|-]]  不便宜。"
          }
        ]
      }
    ],
    "visl": "",
    "br1": [
      "+ く + ないです。",
      "+ く + ありません。"
    ],
    "br2": [
      "くないです。",
      "くありません。"
    ]
  },
  {
    "tile": "b. な形容詞 - 否定型",
    "desp": "～ [br1]",
    "trans": "",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "きれい[[blue|です]]。 [[dash|-]] "
              },
              {
                "k": "きれい [br1]"
              }
            ],
            "zh": "漂亮，乾淨。 [[dash|-]]  不漂亮，不乾淨。"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "この"
              },
              {
                "k": "肉",
                "f": "にく"
              },
              {
                "k": "は"
              },
              {
                "k": "新",
                "f": "しん"
              },
              {
                "k": "鮮",
                "f": "せん"
              },
              {
                "k": "[[blue|じゃ ないです。]]"
              }
            ],
            "zh": "這塊肉[[blue|不]]新鮮。"
          }
        ]
      },
      {
        "id": 3,
        "dia": [
          {
            "jp": [
              {
                "k": "林",
                "f": "りん"
              },
              {
                "k": "さん[[blue|の]]"
              },
              {
                "k": "彼",
                "f": "かの"
              },
              {
                "k": "女",
                "f": "じょ"
              },
              {
                "k": "は きれい[br2]"
              }
            ],
            "zh": "林先生[[blue|的]]女朋友不漂亮。"
          }
        ]
      },
      {
        "id": 4,
        "dia": [
          {
            "jp": [
              {
                "k": "この"
              },
              {
                "k": "映",
                "f": "えい"
              },
              {
                "k": "画",
                "f": "が"
              },
              {
                "k": "は おもしろ[[strike|い]] [br3]"
              }
            ],
            "zh": "這部電影[[blue|不好看]]。"
          }
        ]
      },
      {
        "id": 5,
        "dia": [
          {
            "jp": [
              {
                "k": "これ は おいし[[strike|い]] [br3]"
              }
            ],
            "zh": "這個[[blue|不好喝]]。"
          }
        ]
      }
    ],
    "visl": "",
    "br1": [
      "じゃ ないです。",
      "じゃ ありません。",
      "では ありません。"
    ],
    "br2": [
      "じゃないです。",
      "じゃありません。"
    ],
    "br3": [
      "くないです。",
      "くありません。"
    ]
  },
  {
    "tile": "a. い形容詞 - (肯定型) ～いです。",
    "desp": "",
    "trans": "",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "おもしろい[[blue|です]]。"
              }
            ],
            "zh": "有趣的"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "その"
              },
              {
                "k": "映",
                "f": "えい"
              },
              {
                "k": "画",
                "f": "が"
              },
              {
                "k": "[[space|は]]おもしろい[[blue|です]]。"
              }
            ],
            "zh": "那部電影很好看。"
          }
        ]
      }
    ],
    "visl": ""
  },
  {
    "tile": "b. な形容詞 - (肯定型) です。",
    "desp": "",
    "trans": "",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "きれい[[blue|です]]。"
              }
            ],
            "zh": "漂亮的"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "林",
                "f": "りん"
              },
              {
                "k": "さん[[space|は]]きれい[[blue|です]]。"
              }
            ],
            "zh": "林小姐很漂亮。"
          }
        ]
      }
    ],
    "visl": ""
  },
  {
    "tile": "どう  (如何?)",
    "desp": "",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "A: そのラーメンは [[blue|どう]] ですか。"
              }
            ],
            "zh": "A: 那碗拉麵[[blue|如何]]?"
          },
          {
            "jp": [
              {
                "k": "B: おいしいです。"
              }
            ],
            "zh": "B: 好吃。"
          }
        ]
      }
    ],
    "visl": ""
  },
  {
    "tile": "名詞 + が + ほしい (想要...)",
    "desp": "指著想要某物",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
              {
                "k": "車",
                "f": "くるま"
              },
              {
                  "k": "[[blue| が ほしいです]]。"
              }
            ],
            "zh": "[[blue|想要]]車子。"
          }
        ]
      },
      {
        "id": 2,
        "dia": [
          {
            "jp": [
              {
                "k": "お"
              },
              {
                "k": "金",
                "f": "かね"
              },
              {
                  "k": "[[blue| が ほしいです]]。"
              }
            ],
            "zh": "[[blue|想要]]錢。"
          }
        ]
      },
      {
        "id": 3,
        "dia": [
          {
            "jp": [
              {
                "k": "私",
                "f": "わたし"
              },
              {
                "k": "[[blue| は ]]スマホ[[blue|がほしいです。]]"
              }
            ],
            "zh": "我[[blue|想要]]手機。"
          }
        ]
      }
    ],
    "visl": ""
  },
  {
    "tile": "~が~[[strike|ます]] + たい~(想做某事)想...",
    "desp": "",
    "exam": [
      {
        "id": 1,
        "dia": [
          {
            "jp": [
                  {
                      "k": "1. "
                  },
              {
                "k": "食",
                "f": "た"
              },
              {
                "k": "ぺます。"
              }
            ],
            "zh": "吃。"
            },
            {
                "jp": [
                    {
                        "k": "2. "
                    },
                    {
                        "k": "食",
                        "f": "た"
                    },
                    {
                        "k": "ぺ[[strike|ます]]たいです。"
                    }
                ],
                "zh": "想吃。"
            },
            {
                "jp": [
                    {
                        "k": "3. ラ－メン[[blue|を]]"
                    },
                    {
                        "k": "食",
                        "f": "た"
                    },
                    {
                        "k": "ぺ[[blue|ます。]]"
                    }
                ],
                "zh": "[[blue|吃]]拉麵。"
            }, {
                "jp": [
                    {
                        "k": "4. ラ－メン[[blue|が]]"
                    },
                    {
                        "k": "食",
                        "f": "た"
                    },
                    {
                        "k": "ぺ[[strike|ます]] [[blue|たいです。]]"
                    }
                ],
                "zh": "[[blue|想吃]]拉麵。"
            }
        ]
        },
      {
            "id": 2,
            "dia": [
                {
                    "jp": [
                        {
                        "k": "1. "
                        },
                        {
                            "k": "聞",
                            "f": "き"
                        },
                        {
                            "k": "きます。"
                        }
                    ],
                    "zh": "聽，問。"
                }, {
                    "jp": [
                        {
                            "k": "2. "
                        },
                        {
                            "k": "聞",
                            "f": "き"
                        },
                        {
                            "k": "き[[strike|ます]]たいです。"
                        }
                    ],
                    "zh": "想聽，想問。"
                }, {
                    "jp": [
                        {
                            "k": "3. "
                        },
                        {
                            "k": "音",
                            "f": "おん"
                        },
                        {
                            "k": "楽",
                            "f": "がく"
                        },
                        {
                            "k": "[[blue|を]]"
                        },
                        {
                            "k": "聞",
                            "f": "き"
                        },
                        {
                            "k": "き[[blue|ます。]]"
                        }
                    ],
                    "zh": "[[blue|聽]]音樂。"
                },
                {
                    "jp": [
                        {
                            "k": "4. "
                        },
                        {
                            "k": "音",
                            "f": "おん"
                        },
                        {
                            "k": "楽",
                            "f": "がく"
                        },
                        {
                            "k": "[[blue|が]]"
                        },
                        {
                            "k": "聞",
                            "f": "き"
                        },
                        {
                            "k": "き[[strike|ます]] [[blue|たいです。]]"
                        }
                    ],
                    "zh": "[[blue|想聽]]音樂。"
                }
            ]
        }
    ],
    "visl": ""
    },
    {
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A. "
                            },
                            {
                                "k": "何",
                                "f": "なん"
                            },
                            {
                                "k": "歳",
                                "f": "さい"
                            },
                            {
                                "k": "退",
                                "f": "たい"
                            },
                            {
                                "k": "職",
                                "f": "しょく"
                            },
                            {
                                "k": "し[[strike|ます]][[box|たい]]ですか。"
                            }
                        ],
                        "zh": "幾歲想退休呢?"
                    },
                    {
                        "jp": [
                            {
                                "k": "B. "
                            },
                            {
                                "k": "50",
                                "f": "ごじゅっ"
                            },
                            {
                                "k": "歳",
                                "f": "さい"
                            },
                            {
                                "k": "[[blue|です。]]"
                            }
                        ],
                        "zh": "50歲。"
                    },
                    {
                        "jp": [
                            {
                                "k": "A. "
                            },
                            {
                                "k": "~え~",
                            },
                            {
                                "k": "早",
                                "f": "はや"
                            },
                            {
                                "k": "い[[blue|ですね。]]"
                            }
                        ],
                        "zh": ""
                    }
                ]
            }
        ],
        "visl": ""
    },

    {
        "tile": [
            {
                "k": "退",
                "f": "たい"
            },
            {
                "k": "職",
                "f": "しょく"
            },
            {
                "k": "します。",
            }
        ],
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A. "
                            },
                            {
                                "k": "何",
                                "f": "なん"
                            },
                            {
                                "k": "歳",
                                "f": "さい"
                            },
                            {
                                "k": "退",
                                "f": "たい"
                            },
                            {
                                "k": "職",
                                "f": "しょく"
                            },
                            {
                                "k": "し[[strike|ます]][[box|たい]]ですか。"
                            }
                        ],
                        "zh": "幾歲想退休呢?"
                    },
                    {
                        "jp": [
                            {
                                "k": "B. "
                            },
                            {
                                "k": "50",
                                "f": "ごじゅっ"
                            },
                            {
                                "k": "歳",
                                "f": "さい"
                            },
                            {
                                "k": "[[blue|です。]]"
                            }
                        ],
                        "zh": "50歲。"
                    },
                    {
                        "jp": [
                            {
                                "k": "A. "
                            },
                            {
                                "k": "~え~",
                            },
                            {
                                "k": "早",
                                "f": "はや"
                            },
                            {
                                "k": "い[[blue|ですね。]]"
                            }
                        ],
                        "zh": ""
                    }
                ]
            }
        ],
        "visl": ""
    }
];
