const grammarData = [{
    "tile": "a. い形容詞 - 否定型",
    "desp": "([[strike|い]] [br1])",
    "trans": "",
    "exam": [
      {
      "id": 1,
      "dia": [
        { "jp": [ { "k": "高", "f": "たか" },{ "k": "い[[blue|です]]。 [[dash|-]] " },{ "k": "高", "f": "たか" },{ "k": "[[strike|い]] [br2]" } ], "zh": "高的，貴的。 [[dash|-]]  不高，不貴。" }
      ]
      },
      {
      "id": 2,
      "dia": [
        { "jp": [ { "k": "安", "f": "やす" },{ "k": "い[[blue|です]]。 [[dash|-]] " },{ "k": "安", "f": "やす" },{ "k": "[[strike|い]] [br2]" } ], "zh": "便宜的。  [[dash|-]]  不便宜。" }
      ]
      }
    ],
    "visl": "",
    "br1":["+ く + ないです。","+ く + ありません。"],
    "br2":["くないです。","くありません。"] 
  },
  {
    "tile": "a. い形容詞 - (肯定型) ～いです。",
    "desp": "",
    "trans": "",
    "exam": [
      {
      "id": 1,
      "dia": [
        { "jp": [ { "k": "おもしろい[[blue|です]]。" } ], "zh": "有趣的" }
      ]
      },{
      "id": 2,
      "dia": [
        { "jp": [ { "k": "その" },{ "k": "映", "f": "えい" },{ "k": "画", "f": "が" },{ "k": "[[space|は]]おもしろい[[blue|です]]。" }  ], "zh": "那部電影很好看。" }
      ]
      },
    ],
    "visl": ""
  },
  {
    "tile": "b. な形容詞 - (肯定型) ～です。",
    "desp": "",
    "trans": "",
    "exam": [
      {
      "id": 1,
      "dia": [
        { "jp": [ { "k": "きれい[[blue|です]]。" } ], "zh": "漂亮的" }
      ]
      },{
      "id": 2,
      "dia": [
        { "jp": [ { "k": "林", "f": "りん" },{ "k": "さん[[space|は]]きれい[[blue|です]]。" }  ], "zh": "林小姐很漂亮。" }
      ]
      },
    ],
    "visl": ""
  },
  {
    "tile": "どう～  (如何?)",
    "desp": "",
    "exam": [
      {
      "id": 1,
      "dia": [
        { "jp": [ { "k": "A: そのラーメンは [[blue|どう]] ですか。" } ], "zh": "A: 那碗拉麵[[blue|如何]]?" },
        { "jp": [ { "k": "B: おいしいです。" } ], "zh": "B: 好吃。" }
      ]
      },
    ],
    "visl": ""
  },
  {
    "tile": "名詞 - 肯定句",
    "desp": "A [[blue|は]] B [[blue|です]]",
    "trans": "測試",
    "exam": [
      {
      "id": 1,
      "dia": [
        { "jp": [ { "k": "A: そのラーメンは [[blue|どう]] ですか。" } ], "zh": "A: 那碗拉麵[[blue|如何]]?" },
        { "jp": [ { "k": "B: おいしいです。" } ], "zh": "B: 好吃。" }
      ]
      }
    ],
    "visl": ""
  },
  {
    "tile": "現在簡單式（～ます形）",
    "desp": "表示習慣、日常或未來會發生的動作，例如：たべます（吃）。",
    "exam": [
      {
      "id": 1,
      "dia": [
        { "jp": [  { "k": "毎日", "f": "まいにち" },
          { "k": "ごはん" },
          { "k": "を" },
          { "k": "食", "f": "た" },
          { "k": "ます" },
          { "k": "。" } ], "zh": "A: 那碗拉麵[[blue|如何]]?" },
        { "jp": [ { "k": "B: おいしいです。" } ], "zh": "B: 好吃。" }
      ]
      }

    ],
    "visl": "example-flow"
  },
  {
    "tile": "て形連接流程",
    "desp": "て形可以用來連接句子，或進行請求動作，例如：たべて ください。",
    "exam": [
      {
      "id": 1,
      "dia": [
        { "jp": [  { "k": "毎日", "f": "まいにち" },
          { "k": "ごはん" },
          { "k": "を" },
          { "k": "食", "f": "た" },
          { "k": "ます" },
          { "k": "。" } ], "zh": "A: 那碗拉麵[[blue|如何]]?" },
        { "jp": [ { "k": "B: おいしいです。" } ], "zh": "B: 好吃。" }
      ]
      }
    ],
    "visl": "te-form-flow"
  }
];
