window.vocabData1 =
{
  "tables": [
    {
      "caption": "單字",
      "rows": [
        {
          "zh": "例句",
          "jp": [
            { "k": "文", "f": "ぶん" },
            { "k": "型", "f": "けい" }
          ],
          "colspan": 1
        },
        {
          "zh": "文法",
          "jp": [
            { "k": "文", "f": "ぶん" },
            { "k": "法", "f": "ぽう" }
          ]
        },
        {
          "zh": "口訣",
          "jp": [
            { "k": "通", "f": "つう" },
            { "k": "訳", "f": "やく" },
            { "k": "します" }
          ]
        },
        {
          "zh": "回覆，回應",
          "jp": [
            { "k": "返", "f": "へん" },
            { "k": "事", "f": "じ" },
            { "k": "します" }
          ],
          "colspan": 1   // 這筆會佔 3 欄（單獨一列）
        },
        {
          "zh": "回答，解答",
          "jp": [
            { "k": "答", "f": "こた" },
            { "k": "えます" }
          ]
        },
        {
          "zh": "會話",
          "jp": [
            { "k": "会", "f": "かい" },
            { "k": "話", "f": "わ" }
          ],
          "colspan": 1   // 這筆會佔 3 欄（單獨一列）
        },
        {
          "zh": "切，剪",
          "jp": [
            { "k": "カットします" },
            { "k": " = " },
            { "k": "切", "f": "き" },
            { "k": "ります" }
          ],
          "colspan": 2
        }
      ]
    },
    {
      "caption": "上半身",
      "rows": [
        {
          "zh": "穿([[blue|上半身]])(如和服、洋裝、上衣都是)",
          "jp": [
            { "k": "着", "f": "き" },
            { "k": "ます" }
          ]
        },
        {
          "zh": "襯衫",
          "jp": [
            { "k": "シ[[small|ャ]]ツ" }
          ]
        },
        {
          "zh": "洋裝",
          "jp": [
            { "k": "ワンピース" }
          ]
        },
        {
          "zh": "女性襯衫",
          "jp": [
            { "k": "ブウンス" }
          ]
        },
        {
          "zh": "和服",
          "jp": [
            { "k": "着", "f": "き" },
            { "k": "物", "f": "もの" },
          ],
        },
        {
          "zh": "衣服(全部衣服統稱)",
          "jp": [
            { "k": "ふく" },
          ]
        },
        {
          "zh": "大衣、外套",
          "jp": [
            { "k": "コート" }
          ],
        },
        {
          "zh": "大衣、外套",
          "jp": [
            { "k": "オーバ" }
          ],
        },
        {
          "zh": "毛衣",
          "jp": [
            { "k": "セーター" }
          ],
        },
        {
          "zh": "浴衣",
          "jp": [
            { "k": "ゆかた" }
          ],
        }
      ]
    },
    {
      "caption": "單字",
      "rows": [
        {
          "zh": "冰淇淋",
          "jp": [
            { "k": "アイスクリーム" }
          ]
        },
        {
          "zh": "口罩",
          "jp": [
            { "k": "マスク" }
          ]
        },
        {
          "zh": "戒指",
          "jp": [
            { "k": "指", "f": "ゆび" },
            { "k": "輪", "f": "わ" },
          ]
        },
        {
          "zh": "耳環",
          "jp": [
            { "k": "ネ[[small|ッ]]クレス" }
          ],
        },
        {
          "zh": "碰、摸",
          "jp": [
            { "k": "触", "f": "さわ" },
            { "k": "ります" },
          ]
        },
        {
          "zh": "眼鏡",
          "jp": [
            { "k": "めがね" }
          ],
        },
        {
          "zh": "戴[[blue|(眼鏡)]]",
          "jp": [
            { "k": "かけます" }
          ],
        },
        {
          "zh": "帽子",
          "jp": [
            { "k": "帽", "f": "ぼ" },
            { "k": "子", "f": "うし" },
          ],
        },
        {
          "zh": "戴[[blue|(帽子)]]",
          "jp": [
            { "k": "かぶります" }
          ],
        },
        {
          "zh": "穿[[blue|(下半身)]](如拖鞋)",
          "jp": [
            { "k": "はきます" }
          ],
        }, {
          "zh": "一般、普通、平常",
          "jp": [
            { "k": "普", "f": "ふ" },
            { "k": "通", "f": "つう" },
          ],
        },
        {
          "zh": "新的",
          "jp": [
            { "k": "新", "f": "あたら" },
            { "k": "しい" },
          ],
        },
        {
          "zh": "舊的",
          "jp": [
            { "k": "古", "f": "ふる" },
            { "k": "い" },
          ],
        },
        {
          "zh": "忙的",
          "jp": [
            { "k": "忙", "f": "いそが" },
            { "k": "い" },
          ],
        },
        {
          "zh": "最、第一",
          "jp": [
            { "k": "一", "f": "いち" },
            { "k": "番", "f": "ばん" },
          ],
        },
        {
          "zh": "而且",
          "jp": [
            { "k": "そして" },
          ],
        },
        {
          "zh": "非常",
          "jp": [
            { "k": "とても" },
          ],
        },
        {
          "zh": "最辛苦、很、糟糕",
          "jp": [
            { "k": "大", "f": "たい" },
            { "k": "変", "f": "へん" },
          ],
        }, {
          "zh": "方便、便利",
          "jp": [
            { "k": "便", "f": "べん" },
            { "k": "利", "f": "り" },
          ],
        }, {
          "zh": "安靜的",
          "jp": [
            { "k": "静", "f": "しず" },
            { "k": "か"},
          ],
        },{
          "zh": "熱鬧的",
          "jp": [
            { "k": "賑", "f": "にぎ" },
            { "k": "やか"},
          ],
        },{
          "zh": "女性用",
          "jp": [
            { "k": "女", "f": "じ[[small|ょ]]" },
            { "k": "性", "f": "せい" },
            { "k": "用", "f": "よう" },
          ],
        },{
          "zh": "男性用",
          "jp": [
            { "k": "男", "f": "だん" },
            { "k": "性", "f": "せい" },
            { "k": "用", "f": "よう" },
          ],
        }, {
    "zh": "停止、停",
    "jp": [
      { "k": "止", "f": "と" },
      { "k": "まります" }
    ]
  },
  {
    "zh": "JR週遊券",
    "jp": [
      { "k": "JRパス" }
    ]
  },
  {
    "zh": "支付",
    "jp": [
      { "k": "支", "f": "し" },
      { "k": "払", "f": "はら" },
      { "k": "い" }
    ]
  },
  {
    "zh": "外國人",
    "jp": [
      { "k": "外", "f": "がい" },
      { "k": "国", "f": "こく" },
      { "k": "人", "f": "じん" },
      { "k": "="},
      { "k": "外", "f": "がい" },
      { "k": "人", "f": "じん" }
    ]
  },
  {
    "zh": "櫃台、服務台",
    "jp": [
      { "k": "フロント" }
    ]
  },
  {
    "zh": "公分",
    "jp": [
      { "k": "センチ" }
    ]
  },
  {
    "zh": "公尺",
    "jp": [
      { "k": "メートル" }
    ]
  },
  {
    "zh": "信箱",
    "jp": [
      { "k": "ポスト" }
    ]
  },
  {
    "zh": "合計",
    "jp": [
      { "k": "合", "f": "ごう" },
      { "k": "計", "f": "けい" }
    ]
  },
  {
    "zh": "當季食物",
    "jp": [
      { "k": "旬", "f": "しゅん" },
      { "k": "の" },
      { "k": "物", "f": "もの" }
    ]
  },
  {
    "zh": "博愛座",
    "jp": [
      { "k": "優", "f": "ゆう" },
      { "k": "先", "f": "せん" },
      { "k": "席", "f": "せき" }
    ]
  },
  {
    "zh": "藥局",
    "jp": [
      { "k": "薬", "f": "や[[small|っ]]" },
      { "k": "局", "f": "き[[small|ょ]]く" }
    ]
  },
  {
    "zh": "全部",
    "jp": [
      { "k": "全", "f": "ぜん" },
      { "k": "部", "f": "ぶ" }
    ]
  },{
    "zh": "終點",
    "jp": [
      { "k": "終", "f": "しゅう" },
      { "k": "点", "f": "てん" }
    ]
  },
  {
    "zh": "少量",
    "jp": [
      { "k": "少", "f": "すく" },
      { "k": "なめ" }
    ]
  },
  {
    "zh": "加麵",
    "jp": [
      { "k": "替", "f": "かえ" },
      { "k": "玉", "f": "だま" }
    ]
  },
  {
    "zh": "取消",
    "jp": [
      { "k": "キャンセル" }
    ]
  },
  {
    "zh": "票",
    "jp": [
      { "k": "き[[small|っ]]ぷ" }
    ]
  },
  {
    "zh": "票",
    "jp": [
      { "k": "チケ[[small|ッ]]ト" }
    ]
  },
  {
    "zh": "護照",
    "jp": [
      { "k": "パスポート" }
    ]
  },
  {
    "zh": "難的",
    "jp": [
      { "k": "難", "f": "むずか" },
      { "k": "しい" }
    ]
  },
  {
    "zh": "漂亮、乾淨",
    "jp": [
      { "k": "きれい" }
    ]
  },
  {
    "zh": "不怎麼",
    "jp": [
      { "k": "あまり" }
    ]
  },
  {
    "zh": "辛苦、很、糟糕",
    "jp": [
      { "k": "大", "f": "たい" },
      { "k": "変", "f": "へん" }
    ]
  },
  {
    "zh": "如何",
    "jp": [
      { "k": "どう" }
    ]
  },
  {
    "zh": "親切",
    "jp": [
      { "k": "親", "f": "しん" },
      { "k": "切", "f": "せつ" }
    ]
  },{
    "zh": "有趣的",
    "jp": [
      { "k": "おもしろい" }
    ]
  },
  {
    "zh": "小的",
    "jp": [
      { "k": "小", "f": "ちい" },
      { "k": "さい" }
    ]
  },
  {
    "zh": "大的",
    "jp": [
      { "k": "大", "f": "おお" },
      { "k": "きい" }
    ]
  },
  {
    "zh": "建築物",
    "jp": [
      { "k": "建", "f": "たて" },
      { "k": "物", "f": "もの" }
    ]
  },
  {
    "zh": "自由座",
    "jp": [
      { "k": "自", "f": "じ" },
      
      { "k": "由", "f": "ゆう" },
      { "k": "席", "f": "せき" }
    ]
  },
  {
    "zh": "改搭、轉車",
    "jp": [
      { "k": "乗", "f": "の" },
      { "k": "り" },
      { "k": "換", "f": "か" },
      { "k": "えます" }
    ]
  },
  {
    "zh": "投幣式置物櫃",
    "jp": [
      { "k": "コインロッカー" }
    ]
  },
  {
    "zh": "寄放",
    "jp": [
      { "k": "預", "f": "あず" },
      { "k": "けます" }
    ]
  },
  {
    "zh": "手拿行李",
    "jp": [
      { "k": "手", "f": "て" },
      { "k": "荷", "f": "に" },
      { "k": "物", "f": "もつ" }
    ]
  },
  {
    "zh": "行李",
    "jp": [
      { "k": "荷", "f": "に" },
      { "k": "物", "f": "もつ" }
    ]
  },
  {
    "zh": "對號座",
    "jp": [
      { "k": "指", "f": "し" },
      { "k": "定", "f": "てい" },
      { "k": "席", "f": "せい" }
    ]
  },
  {
    "zh": "坐位",
    "jp": [
      { "k": "席", "f": "せき" }
    ]
  },  {
    "zh": "郵票",
    "jp": [
      { "k": "切", "f": "き[[small|っ]]" },
      { "k": "手", "f": "て" }
    ]
  },
  {
    "zh": "郵局",
    "jp": [
      { "k": "郵", "f": "ゆう" },
      { "k": "便", "f": "びん" },
      { "k": "局", "f": "き[[small|ょ]]く" }
    ]
  },
  {
    "zh": "海",
    "jp": [
      { "k": "海", "f": "うみ" }
    ]
  },
  {
    "zh": "好的",
    "jp": [
      { "k": "いい" }
    ]
  },
  {
    "zh": "有名的",
    "jp": [
      { "k": "有", "f": "ゆう" },
      { "k": "名", "f": "めい" }
    ]
  },
  {
    "zh": "簡單",
    "jp": [
      { "k": "簡", "f": "かん" },
      { "k": "単", "f": "たん" }
    ]
  },
  {
    "zh": "快樂的([[blue|當下的]])",
    "jp": [
      { "k": "うれしい" }
    ]
  },
  {
    "zh": "快樂的([[blue|長時間的]])",
    "jp": [
      { "k": "楽", "f": "たの" },
      { "k": "しい" }
    ]
  },
  {
    "zh": "櫻花",
    "jp": [
      { "k": "桜", "f": "さくら" }
    ]
  },
  {
    "zh": "山",
    "jp": [
      { "k": "山", "f": "やま" }
    ]
  },
  {
    "zh": "食物",
    "jp": [
      { "k": "食", "f": "た" },
      { "k": "べ"},
      { "k": "物", "f": "もの" }
    ]
  },
  {
    "zh": "怎麼樣的",
    "jp": [
      { "k": "どんな" }
    ]
  }
      ]
    },
  ]
}

