window.vocabData1 =
{
  "tables": [
    {
      "caption":"test",
      "rows": [
        {
          "zh": "例句",
          "jp": [
            { "k": "文", "f": "ぶん" },
            { "k": "型", "f": "けい" }
          ],
          "colspan": 1   
        },
        {
          "zh": "文法",
          "jp": [
            { "k": "文", "f": "ぶん" },
            { "k": "法", "f": "ぽう" }
          ]
        },
        {
          "zh": "口訣",
          "jp": [
            { "k": "通", "f": "つう" },
            { "k": "訳", "f": "やく" },
            { "k": "します" }
          ]
        },
        {
          "zh": "回覆，回應",
          "jp": [
            { "k": "返", "f": "へん" },
            { "k": "事", "f": "じ" },
            { "k": "します" }
          ],
          "colspan": 1   // 這筆會佔 3 欄（單獨一列）
        },
        {
          "zh": "回答，解答",
          "jp": [
            { "k": "答", "f": "こた" },
            { "k": "えます" }
          ]
        },
        {
          "zh": "會話",
          "jp": [
            { "k": "会", "f": "かい" },
            { "k": "話", "f": "わ" }
          ],
          "colspan": 1   // 這筆會佔 3 欄（單獨一列）
        },
        {
          "zh": "切，剪",
          "jp": [
            { "k": "カットします" },
            { "k": " = " },
            { "k": "切", "f": "き" },
            { "k": "ります" }
          ],
          "colspan": 2   
        }
      ]
    },
    {
      "caption":"test1",
      "rows": [
        {
          "zh": "例句",
          "jp": [
            { "k": "文", "f": "ぶん" },
            { "k": "型", "f": "けい" }
          ],
          "colspan": 1   
        },
        {
          "zh": "文法",
          "jp": [
            { "k": "文", "f": "ぶん" },
            { "k": "法", "f": "ぽう" }
          ]
        },
        {
          "zh": "口訣",
          "jp": [
            { "k": "通", "f": "つう" },
            { "k": "訳", "f": "やく" },
            { "k": "します" }
          ]
        },
        {
          "zh": "回覆，回應",
          "jp": [
            { "k": "返", "f": "へん" },
            { "k": "事", "f": "じ" },
            { "k": "します" }
          ],
          "colspan": 1   // 這筆會佔 3 欄（單獨一列）
        },
        {
          "zh": "回答，解答",
          "jp": [
            { "k": "答", "f": "こた" },
            { "k": "えます" }
          ]
        },
        {
          "zh": "會話",
          "jp": [
            { "k": "会", "f": "かい" },
            { "k": "話", "f": "わ" }
          ],
          "colspan": 1   // 這筆會佔 3 欄（單獨一列）
        },
        {
          "zh": "切，剪",
          "jp": [
            { "k": "カットします" },
            { "k": " = " },
            { "k": "切", "f": "き" },
            { "k": "ります" }
          ],
          "colspan": 2   
        }
      ]
    },
    {
      "caption":"test3",
      "rows": [
        {
          "zh": "例句",
          "jp": [
            { "k": "文", "f": "ぶん" },
            { "k": "型", "f": "けい" }
          ],
          "colspan": 1   
        },
        {
          "zh": "文法",
          "jp": [
            { "k": "文", "f": "ぶん" },
            { "k": "法", "f": "ぽう" }
          ]
        },
        {
          "zh": "口訣",
          "jp": [
            { "k": "通", "f": "つう" },
            { "k": "訳", "f": "やく" },
            { "k": "します" }
          ]
        },
        {
          "zh": "回覆，回應",
          "jp": [
            { "k": "返", "f": "へん" },
            { "k": "事", "f": "じ" },
            { "k": "します" }
          ],
          "colspan": 1   // 這筆會佔 3 欄（單獨一列）
        },
        {
          "zh": "回答，解答",
          "jp": [
            { "k": "答", "f": "こた" },
            { "k": "えます" }
          ]
        },
        {
          "zh": "會話",
          "jp": [
            { "k": "会", "f": "かい" },
            { "k": "話", "f": "わ" }
          ],
          "colspan": 1   // 這筆會佔 3 欄（單獨一列）
        },
        {
          "zh": "切，剪",
          "jp": [
            { "k": "カットします" },
            { "k": " = " },
            { "k": "切", "f": "き" },
            { "k": "ります" }
          ],
          "colspan": 2   
        }
      ]
    }
  ]
}

