window.vocabData1 =
{
  "tables": [
    {
      "caption":"單字",
      "rows": [
        {
          "zh": "例句",
          "jp": [
            { "k": "文", "f": "ぶん" },
            { "k": "型", "f": "けい" }
          ],
          "colspan": 1   
        },
        {
          "zh": "文法",
          "jp": [
            { "k": "文", "f": "ぶん" },
            { "k": "法", "f": "ぽう" }
          ]
        },
        {
          "zh": "口訣",
          "jp": [
            { "k": "通", "f": "つう" },
            { "k": "訳", "f": "やく" },
            { "k": "します" }
          ]
        },
        {
          "zh": "回覆，回應",
          "jp": [
            { "k": "返", "f": "へん" },
            { "k": "事", "f": "じ" },
            { "k": "します" }
          ],
          "colspan": 1   // 這筆會佔 3 欄（單獨一列）
        },
        {
          "zh": "回答，解答",
          "jp": [
            { "k": "答", "f": "こた" },
            { "k": "えます" }
          ]
        },
        {
          "zh": "會話",
          "jp": [
            { "k": "会", "f": "かい" },
            { "k": "話", "f": "わ" }
          ],
          "colspan": 1   // 這筆會佔 3 欄（單獨一列）
        },
        {
          "zh": "切，剪",
          "jp": [
            { "k": "カットします" },
            { "k": " = " },
            { "k": "切", "f": "き" },
            { "k": "ります" }
          ],
          "colspan": 2   
        }
      ]
    },
    {
      "caption":"上半身",
      "rows": [
        {
          "zh": "襯衫",
          "jp": [
            { "k": "シ[[small|ャ]]ツ"}
          ]
        },
        {
          "zh": "洋裝",
          "jp": [
            { "k": "ワンピース"}
          ]
        },
        {
          "zh": "女性襯衫",
          "jp": [
            { "k": "ブウンス"}
          ]
        },
        {
          "zh": "和服",
          "jp": [
            { "k": "着", "f": "き" },
            { "k": "物", "f": "もの" },
          ],
        },
        {
          "zh": "衣服(全部衣服統稱)",
          "jp": [
            { "k": "ふく"},
          ]
        },
        {
          "zh": "大衣、外套",
          "jp": [
            { "k": "コート"}
          ],
        },
        {
          "zh": "大衣、外套",
          "jp": [
            { "k": "オーバ" }
          ],
        },
        {
          "zh": "毛衣",
          "jp": [
            { "k": "セーター" }
          ],
        },
        {
          "zh": "浴衣",
          "jp": [
            { "k": "ゆかた" }
          ],
        }
      ]
    },
    {
      "caption":"單字",
      "rows": [
        {
          "zh": "冰淇淋",
          "jp": [
            { "k": "アイスクリーム"}
          ]
        },
        {
          "zh": "口罩",
          "jp": [
            { "k": "マスク"}
          ]
        },
        {
          "zh": "戒指",
          "jp": [
            { "k": "指", "f": "ゆび" },
            { "k": "輪", "f": "わ" },
          ]
        },
        {
          "zh": "耳環",
          "jp": [
            { "k": "ネ[[small|ッ]]クレス" }
          ],
        },
        {
          "zh": "碰、摸",
          "jp": [
            { "k": "触", "f": "さわ" },
            { "k": "ります"},
          ]
        },
        {
          "zh": "眼鏡",
          "jp": [
            { "k": "めがね"}
          ],
        },
        {
          "zh": "戴[[blue|(眼鏡)]]",
          "jp": [
            { "k": "かけます" }
          ],
        },
        {
          "zh": "帽子",
          "jp": [
            { "k": "帽", "f": "ぼ" },
            { "k": "子", "f": "うし" },
          ],
        },
        {
          "zh": "戴[[blue|(帽子)]]",
          "jp": [
            { "k": "かぶります" }
          ],
        },
        {
          "zh": "穿[[blue|(下半身)]](如拖鞋)",
          "jp": [
            { "k": "はきます" }
          ],
        }
      ]
    },
  ]
}

