window.recordData1 = {
  "tables": [
    {
      "rows": [
        { "date": "2025/09/16", "note": "新進度:第七課第三個文法，88頁。(76頁跳88頁)" },
        { "date": "2025/09/09", "note": "動詞 / い形 な形 / 單字大複習。" },
        { "date": "2025/09/02", "note": "單字大複習。" },
        { "date": "2025/08/26", "note": "動詞複習，い形 な形 複習。" },
        { "date": "2025/08/20", "note": "動詞複習，單字複習。" },
        { "date": "2025/08/12", "note": "新進度: い形 な形 否定。複習い形 な形 肯定。" },
        { "date": "2025/08/05", "note": "動詞複習。" },
        { "date": "2025/07/29", "note": "新進度:課本76頁。動詞複習。" },
        // { "date": "2025/08/26", "note": "另一筆紀錄" }
      ]
    }
  ]
};