window.grammarData1 = [
    {
        "tile": "9/30複習",
        "desp": "[br1]",
        "trans": "這週助詞複習",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [{
                            "k": "私",
                            "f": "わたし"
                        }, {
                            "k": "[[yellow|は]]スーパー[[blue|で]]とりにく[[yellow|を]]"
                        },
                        {
                            "k": "買",
                            "f": "か"
                        },
                        {
                            "k": "います。"
                        }
                        ],


                    }, {
                        "jp": [{
                            "k": "私",
                            "f": "わたし"
                        }, {
                            "k": "スーパー[[blue|で]]とりにく"
                        },
                        {
                            "k": "買",
                            "f": "か"
                        },
                        {
                            "k": "います。(口語)"
                        }
                        ],

                        "zh": "我在超市買雞肉"

                    }
                ]
            }
        ],
        "br1": [
            "を : 名詞 + を + 動詞",
            "に : 時間助詞",
            "で : 動態性場所助詞",
            "で : 交通工具(包含走路)",
            "へ : 方向助詞",
        ]
    },
    {
        "tile": "複習 名詞 + を + 動詞",
        "desp": "包含口語(動詞變化)。口語:助詞 を 可省略 ",
        "trans": "[[icon-important|]]口語:方向助詞 へ [[yellow|不]]可省略 ",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "カメラ[[blue|を]]"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "い[[blue-underline|ました|]]"
                            }
                        ],
                        "zh": "⬇"
                    },
                    {
                        "jp": [
                            {
                                "k": "カメラ[[yellow|(を)]]"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "[[blue|[[small|っ]]た]]"
                            }
                        ],
                        "zh": "買[[blue|了]]相機"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "荷",
                                "f": "に"
                            },
                            {
                                "k": "物",
                                "f": "もつ"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "預",
                                "f": "あず"
                            },
                            {
                                "k": "[[blue-underline|けませんでした|]]"
                            }
                        ],
                        "zh": "⬇"
                    },
                    {
                        "jp": [
                            {
                                "k": "荷",
                                "f": "に"
                            },
                            {
                                "k": "物",
                                "f": "もつ"
                            },
                            {
                                "k": "[[yellow|(を)]]"
                            }, {
                                "k": "預",
                                "f": "あず"
                            }, ,
                            {
                                "k": "[[blue|けなかった]]"
                            }
                        ],
                        "zh": "[[blue|沒有]]寄放行李箱"
                    }
                ]
            }
        ]
    },
    {
        "tile": "9/23補充",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [{
                            "k": "言",
                            "f": "い"
                        }, {
                            "k": "います→"
                        },
                        {
                            "k": "[[box|\"[{\"k\":\"言\",\"f\":\"い\"}]\"]][[notetop|[[note1]]]]わない"
                        }
                        ]
                    }
                ]
            }
        ],
        "note": {
            "note1": [
                {
                    "k": "念ゆ的發音，不是い。"
                }
            ]
        }
    },
    {
        "tile": "どんな",
        "desp": "(直接加名詞，不可以加[[blue|の]])",
        "trans": "怎麼樣的",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [{
                            "k": "A : "
                        },
                        {
                            "k": "陳",
                            "f": "ちん"
                        },
                        {
                            "k": "さん"
                        },
                        {
                            "k": "[[blue|の]]"
                        },
                        {
                            "k": "彼",
                            "f": "かの"
                        },
                        {
                            "k": "女",
                            "f": "じ[[small|ょ]]"
                        },
                        {
                            "k": "[[blue|は　どんな]]"
                        },
                        {
                            "k": "[[blue|人]]",
                            "f": "ひと"
                        },
                        {
                            "k": "ですか。"
                        }
                        ],
                        "zh": "陳先生[[blue|的]]女朋友是[[blue|怎麼樣的人]]呢?"
                    },
                    {
                        "jp": [{
                            "k": "B : "
                        },
                        {
                            "k": "優",
                            "f": "やさ"
                        },
                        {
                            "k": "し"
                        },
                        {
                            "k": "[[blue|い]]"
                        },
                        {
                            "k": "[[blue|人]]",
                            "f": "ひと"
                        },
                        {
                            "k": "です。"
                        }
                        ],
                        "zh": "溫柔[[blue|的]]人"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [{
                            "k": "A : "
                        },
                        {
                            "k": "韓国料理[[blue|は　どんな料理]]ですか。"
                        }
                        ],
                        "zh": "韓國料理是怎麼樣的料理呢?"
                    },
                    {
                        "jp": [{
                            "k": "B : "
                        },
                        {
                            "k": "辛",
                            "f": "から"
                        },
                        {
                            "k": "い料理"
                        }
                        ],
                        "zh": "[[box|辣的]][[notetop|[[note1]]]]料理"
                    }
                ]
            }
        ],

        "note": {
            "note1": [
                {
                    "k": "辛",
                    "f": "から"
                },
                { "k": "い" }
            ]
        }
    },
    {
        "tile": [
            {
                "k": "何",
                "f": "なん"
            },
            {
                "k": "でもいいです。"
            }
        ],
        "desp": "什麼都可以。",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "何",
                                "f": "なん"
                            },
                            {
                                "k": "でもいいです[[blue|か]]"
                            }
                        ],
                        "zh": "什麼都可以[[blue|嗎？]]"
                    },
                    {
                        "jp": [
                            {
                                "k": "何",
                                "f": "なん"
                            },
                            {
                                "k": "でもい[[pitch-q|\"[{\"k\":\"い\",\"p\":\"H\"}]\"]]([[strike|ですか]])"
                            }
                        ],
                        "zh": "什麼都可以嗎？[[blue|(口語)]](比較常聽到)"
                    }
                ]
            }
        ]
    },
    {
        "tile": "...的...",
        "desp": "[br1]",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "英",
                                "f": "えい"
                            },
                            {
                                "k": "語",
                                "f": "ご"
                            },
                            {
                                "k": "[[blue|の]]"
                            },
                            {
                                "k": "先",
                                "f": "せん"
                            },
                            {
                                "k": "生",
                                "f": "せい"
                            },
                            {
                                "k": "[[blue|です]]"
                            }
                        ],
                        "zh": "英文老師"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "きれい[[blue|な]]"
                            },
                            {
                                "k": "町",
                                "f": "まち"
                            },
                            {
                                "k": "[[blue|です]]"
                            }
                        ],
                        "zh": "漂亮[[blue|的]]城鎮"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "[[blue|いい]]"
                            },
                            {
                                "k": "天",
                                "f": "てん"
                            },
                            {
                                "k": "気",
                                "f": "き"
                            },
                            {
                                "k": "です"
                            }
                        ],
                        "zh": "好[[blue|的]]天氣"
                    }
                ]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "小",
                                "f": "てん"
                            },
                            {
                                "k": "さ[[blue|い]]"
                            },
                            {
                                "k": "[[blue|店]]",
                                "f": "みせ"
                            },
                            {
                                "k": "です。"
                            }
                        ],
                        "zh": "小間[[blue|的店]]"
                    }
                ]
            },
            {
                "id": 5,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "新",
                                "f": "しん"
                            },
                            {
                                "k": "切",
                                "f": "せつ"
                            },
                            {
                                "k": "[[blue|な]]"
                            },
                            {
                                "k": "台",
                                "f": "たい"
                            },
                            {
                                "k": "湾",
                                "f": "わん"
                            },
                            {
                                "k": "人",
                                "f": "じん"
                            },
                            {
                                "k": "です。"
                            }
                        ],
                        "zh": "親切[[blue|的]]台灣人"
                    }
                ]
            },
            {
                "id": 6,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "[[blue|おもしろい]]"
                            },
                            {
                                "k": "映",
                                "f": "えい"
                            },
                            {
                                "k": "画",
                                "f": "が"
                            },
                            {
                                "k": "です。"
                            }
                        ],
                        "zh": "[[blue|好看的]]電影"
                    }
                ]
            },
            {
                "id": 7,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "新",
                                "f": "しん"
                            },
                            {
                                "k": "鮮",
                                "f": "せん"
                            },
                            {
                                "k": "[[blue|な]]"
                            },
                            {
                                "k": "とり"
                            },
                            {
                                "k": "肉",
                                "f": "にく"
                            },
                            {
                                "k": "です。"
                            }
                        ],
                        "zh": "新鮮[[blue|的]]雞肉"
                    }
                ]
            },
            {
                "id": 8,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "きれい[[blue|な]]"
                            },
                            {
                                "k": "日",
                                "f": "に"
                            },
                            {
                                "k": "本",
                                "f": "ほん"
                            },
                            {
                                "k": "語",
                                "f": "ご"
                            },
                            {
                                "k": "[[blue|の]]先生です。"
                            }
                        ],
                        "zh": "漂亮[[blue|的]]日文老師"
                    }
                ]
            }
        ],
        "br1": [
            "名詞 + の + 名詞",
            "な形 + な + 名詞",
            "い形直接加名詞"
        ]

    },
    {
        "tile": "a. い形容詞 - 否定型",
        "desp": "([[strike|い]] [br1])",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "高",
                                "f": "たか"
                            },
                            {
                                "k": "い[[blue|です]]。 [[dash|-]]"
                            },
                            {
                                "k": "高",
                                "f": "たか"
                            },
                            {
                                "k": "[[strike|い]] [br2]"
                            }
                        ],
                        "zh": "高的，貴的。 [[dash|-]]  不高，不貴。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "安",
                                "f": "やす"
                            },
                            {
                                "k": "い[[blue|です]]。 [[dash|-]] "
                            },
                            {
                                "k": "安",
                                "f": "やす"
                            },
                            {
                                "k": "[[strike|い]] [br2]"
                            }
                        ],
                        "zh": "便宜的。  [[dash|-]]  不便宜。"
                    }
                ]
            }, {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "この"
                            },
                            {
                                "k": "映",
                                "f": "えい"
                            },
                            {
                                "k": "画",
                                "f": "が"
                            },
                            {
                                "k": "は おもしろ[[strike|い]] [br2]"
                            }
                        ],
                        "zh": "這部電影[[blue|不好看]]。"
                    }
                ]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "これ は おいし[[strike|い]] [br2]"
                            }
                        ],
                        "zh": "這個[[blue|不好喝]]。"
                    }
                ]
            }
        ],
        "br1": [
            "+ く + ないです。",
            "+ く + ありません。"
        ],
        "br2": [
            "くないです。(口語)",
            "くありません。(偏考試)"
        ],
        "br3": [
            "くないです。",
            "くありません。"
        ],
        "tables": [{
            "header": ["肯定", "否定"],
            "rows":
                [
                    ["[{\"k\":\"悪\",\"f\":\"わる\"},{\"k\":\"い[[blue|です]]\"}]", "[{\"k\":\"悪\",\"f\":\"わる\"},{\"k\":\"[br3]\"}]"],
                    ["[{\"k\":\"おもしろい[[blue|です]]\"}]", "[{\"k\":\"おもしろ[br3]\"}]"],
                    ["[{\"k\":\"広\",\"f\":\"ひろ\"},{\"k\":\"い[[blue|です]]\"}]", "[{\"k\":\"広\",\"f\":\"ひろ\"},{\"k\":\"[br3]\"}]"]
                ]
        }]
    },
    {
        "tile": "い形容詞 特例",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "いいです。- [[icon|error-icon]] い[[strike|い]] [br1]"
                            }
                        ]
                    },
                    {
                        "jp": [
                            {
                                "k": "良",
                                "f": "よ"
                            },
                            {
                                "k": "いです。- [[icon|success-icon]] よ[[strike|い]] [br1]"
                            }
                        ],
                        "zh": "好   -    不好"
                    }
                ]
            }
        ],
        "br1": [
            "くないです。",
            "くありません。"
        ]
    },
    {
        "tile": "b. な形容詞 - 否定型",
        "desp": "～ [br1]",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "きれい[[blue|です]]。 [[dash|-]] "
                            },
                            {
                                "k": "きれい [br1]"
                            }
                        ],
                        "zh": "漂亮，乾淨。 [[dash|-]]  不漂亮，不乾淨。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "この"
                            },
                            {
                                "k": "肉",
                                "f": "にく"
                            },
                            {
                                "k": "は"
                            },
                            {
                                "k": "新",
                                "f": "しん"
                            },
                            {
                                "k": "鮮",
                                "f": "せん"
                            },
                            {
                                "k": "[[blue|じゃ ないです。]]"
                            }
                        ],
                        "zh": "這塊肉[[blue|不]]新鮮。"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "林",
                                "f": "りん"
                            },
                            {
                                "k": "さん[[blue|の]]"
                            },
                            {
                                "k": "彼",
                                "f": "かの"
                            },
                            {
                                "k": "女",
                                "f": "じょ"
                            },
                            {
                                "k": "は きれい[br2]"
                            }
                        ],
                        "zh": "林先生[[blue|的]]女朋友不漂亮。"
                    }
                ]
            }
        ],
        "br1": [
            "じゃ ないです。",
            "じゃ ありません。",
            "では ありません。"
        ],
        "br2": [
            "じゃないです。",
            "じゃありません。"
        ],
        "br3": [
            "くないです。",
            "くありません。"
        ],
        "tables": [{
            "header": ["肯定", "否定"],
            "rows":
                [
                    ["[{\"k\":\"新\",\"f\":\"しん\"},{\"k\":\"鮮\",\"f\":\"せん\"},{\"k\":\"[[blue|です]]\"}]", "[{\"k\":\"新\",\"f\":\"しん\"},{\"k\":\"鮮\",\"f\":\"せん\"},{\"k\":\"[br1]\"}]"],
                    ["[{\"k\":\"嫌\",\"f\":\"きら\"},{\"k\":\"[[blue|です]]\"}]", "[{\"k\":\"嫌\",\"f\":\"きら\"},{\"k\":\"[br1]\"}]"]
                ]

        }]
    },
    {
        "tile": "a. い形容詞 - (肯定型) ～いです。",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "おもしろい[[blue|です]]。"
                            }
                        ],
                        "zh": "有趣的"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "その"
                            },
                            {
                                "k": "映",
                                "f": "えい"
                            },
                            {
                                "k": "画",
                                "f": "が"
                            },
                            {
                                "k": "[[space|は]]おもしろい[[blue|です]]。"
                            }
                        ],
                        "zh": "那部電影很好看。"
                    }
                ]
            }
        ]
    },
    {
        "tile": "b. な形容詞 - (肯定型) です。",
        "desp": "有兩個特例是歸在な形 : [br1]",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "きれい[[blue|です]]。"
                            }
                        ],
                        "zh": "漂亮的"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "林",
                                "f": "りん"
                            },
                            {
                                "k": "さん[[space|は]]きれい[[blue|です]]。"
                            }
                        ],
                        "zh": "林小姐很漂亮。"
                    }
                ]
            }
        ],
        "br1": [
            "きれい (乾淨，漂亮)",
            "[{\"k\":\"嫌\",\"f\":\"きら\"},{\"k\":\"い(討厭)\"}]"
        ]
    },
    {
        "tile": "どう  (如何?)",
        "desp": "[[icon|error-icon]] 不能背: 怎麼樣的",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A: そのラーメンは [[blue|どう]] ですか。"
                            }
                        ],
                        "zh": "A: 那碗拉麵[[blue|如何]]?"
                    },
                    {
                        "jp": [
                            {
                                "k": "B: おいしいです。"
                            }
                        ],
                        "zh": "B: 好吃。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A:"
                            },
                            {
                                "k": "陳",
                                "f": "ちん"
                            },
                            {
                                "k": "さん[[blue|の]]"
                            },
                            {
                                "k": "彼",
                                "f": "かれ"
                            },
                            {
                                "k": "氏",
                                "f": "し"
                            },
                            {
                                "k": "は[[blue|どう]]ですか。"
                            }
                        ],
                        "zh": "A: 陳小姐的男朋友[[blue|如何呢]]?"
                    },
                    {
                        "jp": [
                            {
                                "k": "B: ハンサム[[bule|です。]]"
                            }
                        ],
                        "zh": "B: 英俊。"
                    }
                ]
            }
        ]
    },
    {
        "tile": "名詞 + が + ほしい (想要...)",
        "desp": "指著想要某物",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "車",
                                "f": "くるま"
                            },
                            {
                                "k": "[[blue| が ほしいです]]。"
                            }
                        ],
                        "zh": "[[blue|想要]]車子。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "お"
                            },
                            {
                                "k": "金",
                                "f": "かね"
                            },
                            {
                                "k": "[[blue| が ほしいです]]。"
                            }
                        ],
                        "zh": "[[blue|想要]]錢。"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "私",
                                "f": "わたし"
                            },
                            {
                                "k": "[[blue| は ]]スマホ[[blue|がほしいです。]]"
                            }
                        ],
                        "zh": "我[[blue|想要]]手機。"
                    }
                ]
            }
        ]
    },
    {
        "tile": "~が~[[strike|ます]] + たい~(想做某事)想...",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "1. "
                            },
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "べます。"
                            }
                        ],
                        "zh": "吃。"
                    },
                    {
                        "jp": [
                            {
                                "k": "2. "
                            },
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "べ[[strike|ます]]たいです。"
                            }
                        ],
                        "zh": "想吃。"
                    },
                    {
                        "jp": [
                            {
                                "k": "3. ラ－メン[[blue|を]]"
                            },
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "べ[[blue|ます。]]"
                            }
                        ],
                        "zh": "[[blue|吃]]拉麵。"
                    },
                    {
                        "jp": [
                            {
                                "k": "4. ラ－メン[[blue|が]]"
                            },
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "べ[[strike|ます]] [[blue|たいです。]]"
                            }
                        ],
                        "zh": "[[blue|想吃]]拉麵。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "1. "
                            },
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "きます。"
                            }
                        ],
                        "zh": "聽，問。"
                    }, {
                        "jp": [
                            {
                                "k": "2. "
                            },
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "き[[strike|ます]]たいです。"
                            }
                        ],
                        "zh": "想聽，想問。"
                    }, {
                        "jp": [
                            {
                                "k": "3. "
                            },
                            {
                                "k": "音",
                                "f": "おん"
                            },
                            {
                                "k": "楽",
                                "f": "がく"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "き[[blue|ます。]]"
                            }
                        ],
                        "zh": "[[blue|聽]]音樂。"
                    },
                    {
                        "jp": [
                            {
                                "k": "4. "
                            },
                            {
                                "k": "音",
                                "f": "おん"
                            },
                            {
                                "k": "楽",
                                "f": "がく"
                            },
                            {
                                "k": "[[blue|が]]"
                            },
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "き[[strike|ます]] [[blue|たいです。]]"
                            }
                        ],
                        "zh": "[[blue|想聽]]音樂。"
                    }
                ]
            }
        ]
    },
    {
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "私[[blue|は]]"
                            },
                            {
                                "k": "運",
                                "f": "うん"
                            },
                            {
                                "k": "動",
                                "f": "どう"
                            },
                            {
                                "k": "し[[blue|たいです。]]"
                            }
                        ],
                        "zh": "我[[blue|想]][[box|運動]][[notetop|[[note2]]]]"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "私[[blue|は]]"
                            },
                            {
                                "k": "靴",
                                "f": "くつ"
                            },
                            {
                                "k": "[[box|が]][[blue|ほしいです。]]"
                            }
                        ],
                        "zh": "我[[blue|想要]]鞋子"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "陳さん[[blue|は]]"
                            },
                            {
                                "k": "何",
                                "f": "なん"
                            },
                            {
                                "k": "歳",
                                "f": "さい"
                            },
                            {
                                "k": "[[blue|まで]]"
                            },
                            {
                                "k": "仕",
                                "f": "し"
                            },
                            {
                                "k": "事",
                                "f": "ごと"
                            },
                            {
                                "k": "し[[blue|たいですか。]]"
                            }
                        ],
                        "zh": "陳先生[[blue|想]][[box|工作]][[notetop|[[note1]]]][[blue|到]]幾歲呢?"

                    }
                ]
            }
        ],
        "note": {
            "note1": [
                {
                    "k": "仕",
                    "f": "し"
                },
                {
                    "k": "事",
                    "f": "ごと"
                },
                { "k": "します" }
            ],
            "note2": [
                {
                    "k": "運",
                    "f": "うん"
                },
                {
                    "k": "動",
                    "f": "どう"
                },
                { "k": "します" }
            ]
        }
    },
    {
        "tile": [
            {
                "k": "退",
                "f": "たい"
            },
            {
                "k": "職",
                "f": "しょく"
            },
            {
                "k": "します。"
            }
        ],
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A. "
                            },
                            {
                                "k": "何",
                                "f": "なん"
                            },
                            {
                                "k": "歳",
                                "f": "さい"
                            },
                            {
                                "k": "退",
                                "f": "たい"
                            },
                            {
                                "k": "職",
                                "f": "しょく"
                            },
                            {
                                "k": "し[[strike|ます]][[box|たい]]ですか。"
                            }
                        ],
                        "zh": "幾歲想退休呢?"
                    },
                    {
                        "jp": [
                            {
                                "k": "B. "
                            },
                            {
                                "k": "50",
                                "f": "ごじゅっ"
                            },
                            {
                                "k": "歳",
                                "f": "さい"
                            },
                            {
                                "k": "[[blue|です。]]"
                            }
                        ],
                        "zh": "50歲。"
                    },
                    {
                        "jp": [
                            {
                                "k": "A. "
                            },
                            {
                                "k": "~え~"
                            },
                            {
                                "k": "早",
                                "f": "はや"
                            },
                            {
                                "k": "い[[blue|ですね。]]"
                            }
                        ]
                    }
                ]
            }
        ],

        "visl": ""
    },
    {
        "tile": [
            {
                "k": "~が[[notetop|[[note2]]]] あります (無生命)[[notetop|[[note1]]]]有"
            }
        ],
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "花",
                                "f": "はな"
                            },
                            {
                                "k": "[[blue|が あります。]]"
                            }
                        ],
                        "zh": "[[blue|有]]花"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "本",
                                "f": "ほん"
                            },
                            {
                                "k": "[[blue|が あります。]]"
                            }
                        ],
                        "zh": "[[blue|有]]書"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません"
                            },
                            {
                                "k": "水",
                                "f": "みず"
                            },
                            {
                                "k": "[[blue|が あり]][[yellow|ますか。]]"
                            }
                        ],
                        "zh": "不好意思，[[blue|有]]水嗎?"
                    }
                ]
            }
        ],
        "visl": "",
        "note": {
            "note1": [
                {
                    "k": "植物，東西"
                }
            ],
            "note2": [
                {
                    "k": "有"
                }
            ]
        }
    },
    {
        "tile": [
            {
                "k": "降",
                "f": "[[blue|ふ]]"
            },
            {
                "k": "ります (雨/雪) 下"
            }
        ],
        "trans": "[[blue|動詞第一型]]",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "雨",
                                "f": "あま"
                            },
                            {
                                "k": "[[blue|が]]"
                            },
                            {
                                "k": "降",
                                "f": "[[blue|ふ]]"
                            },
                            {
                                "k": "[[blue|ります。]]"
                            }
                        ],
                        "zh": "下雨"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "雪",
                                "f": "ゆき"
                            },
                            {
                                "k": "[[blue|が]]"
                            },
                            {
                                "k": "降",
                                "f": "[[blue|ふ]]"
                            },
                            {
                                "k": "[[blue|ります。]]"
                            }
                        ],
                        "zh": "下雪"
                    }
                ]
            }
        ]
    },
    {
        "tile": [
            {
                "k": "降",
                "f": "[[blue|お]]"
            },
            {
                "k": "ります (交通工具) 下"
            }
        ],
        "trans": "[[blue|動詞第二型]]",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "電",
                                "f": "でん"
                            },
                            {
                                "k": "車",
                                "f": "しゃ"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "降",
                                "f": "[[blue|お]]"
                            },
                            {
                                "k": "[[blue|ります。]]"
                            }
                        ],
                        "zh": "下電車"
                    }
                ]
            }
        ]
    },
    {
        "tile": [
            {
                "k": "敬體 - 基本體 (口語)"
            }
        ],
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "きょう"
                            },
                            {
                                "k": "李",
                                "f": "り"
                            },
                            {
                                "k": "さん"
                            },
                            {
                                "k": "[[blue|は]]"
                            },
                            {
                                "k": "休",
                                "f": "やす"
                            },
                            {
                                "k": "み[[blue|ました。]]"
                            }
                        ],
                        "zh": "今天李小姐請假了"
                    },
                    {
                        "jp": [
                            {
                                "k": "きょう"
                            },
                            {
                                "k": "李",
                                "f": "り"
                            },
                            {
                                "k": "さん"
                            },
                            {
                                "k": "[[yellow|(は)]]"
                            },
                            {
                                "k": "休",
                                "f": "やす"
                            },
                            {
                                "k": "み[[blue|んだ。]]"
                            }
                        ],
                        "zh": "今天李小姐請假了(口語)"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "スマホ"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "い[[blue|ます。]]"
                            }
                        ],
                        "zh": "買手機"
                    },
                    {
                        "jp": [
                            {
                                "k": "スマホ"
                            },
                            {
                                "k": "[[yellow|(を)]]"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "[[blue|う。]]"
                            }
                        ],
                        "zh": "買手機(口語)"
                    }
                ]
            }
        ],
        "tables": [{
            "caption": "G1",
            "header": ["敬體", "", "基本體"],
            "rows":
                [
                    ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ます]]\"}]", "原形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|く]]\"}]"],
                    ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ません]]\"}]", "ない形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"か[[blue|ない]]\"}]"],
                    ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ました]]\"}]", "た形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|[[small|っ]]た]]<br/>(跟「て型」變法一樣，「て」字改成「た」字)\"}]"],
                    ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ませんでした]]\"}]", "なか[[small|っ]]た形", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|かなか[[small|っ]]た]]\"}]"]
                ]
        },
        {
            "caption": "G2",
            "header": ["敬體", "", "基本體"],
            "rows":
                [
                    ["[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ます]]\"}]", "原形", "[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|る]]\"}]"],
                    ["[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ません]]\"}]", "ない形", "[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ない]]\"}]"],
                    ["[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ました]]\"}]", "た形", "[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|た]]\"}]"],
                    ["[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ませんでした]]\"}]", "なか[[small|っ]]た形", "[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|かなか[[small|っ]]た]]\"}]"]
                ]
        },
        {
            "caption": "G3 (1)",
            "header": ["敬體", "", "基本體"],
            "rows":
                [
                    ["[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|ます]]\"}]", "原形", "[{\"k\":\"来\",\"f\":\"く\"},{\"k\":\"[[blue|る]]\"}]"],
                    ["[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|ません]]\"}]", "ない形", "[{\"k\":\"来\",\"f\":\"こ\"},{\"k\":\"[[blue|ない]]\"}]"],
                    ["[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|ました]]\"}]", "た形", "[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|た]]\"}]"],
                    ["[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|ませんでした]]\"}]", "なか[[small|っ]]た形", "[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|かなか[[small|っ]]た]]\"}]"]
                ]
        },
        {
            "caption": "G3 (2)",
            "header": ["敬體", "", "基本體"],
            "rows":
                [
                    ["[{\"k\":\"し\"},{\"k\":\"[[blue|ます]]\"}]", "原形", "[{\"k\":\"し\"},{\"k\":\"[[blue|る]]\"}]"],
                    ["[{\"k\":\"し\"},{\"k\":\"[[blue|ません]]\"}]", "ない形", "[{\"k\":\"し\"},{\"k\":\"[[blue|ない]]\"}]"],
                    ["[{\"k\":\"し\"},{\"k\":\"[[blue|ました]]\"}]", "た形", "[{\"k\":\"し\"},{\"k\":\"[[blue|た]]\"}]"],
                    ["[{\"k\":\"し\"},{\"k\":\"[[blue|ませんでした]]\"}]", "なか[[small|っ]]た形", "[{\"k\":\"し\"},{\"k\":\"[[blue|かなか[[small|っ]]た]]\"}]"]
                ]
        }
        ]
    },
    {
        "tile": "あります G1 特例",
        "trans": "有沒有的\"有\"。例如: 有水嗎?",
        "tables": [{
            "header": ["敬體", "", "基本體"],
            "rows":
                [
                    ["[{\"k\":\"あり[[blue|ます]]\"}]", "原形", "[{\"k\":\"ある\"}]"],
                    ["[{\"k\":\"あり[[blue|ません]]\"}]", "ない形", "[{\"k\":\"[[icon|success-icon]][[blue|ない]]<br/>\"},{\"k\":\"[[icon|error-icon]][[blue|あらない]]\"}]"],
                    ["[{\"k\":\"あり[[blue|ました]]\"}]", "た形", "[{\"k\":\"あ[[blue|[[small|っ]]た]]\"}]"],
                    ["[{\"k\":\"あり[[blue|ませんでした]]\"}]", "なか[[small|っ]]た形", "[{\"k\":\"[[icon|success-icon]][[blue|なか[[small|っ]]た]]<br/>[[icon|error-icon]][[blue|あらなか[[small|っ]]た]]\"}]"]
                ]

        }]
    },
    {
        "tile": "た形",
        "trans": "跟「て型」變法一樣，「て」字改成「た」字",
        "tables": [{
            "header": ["ます形", "原形", "て形", "た形"],
            "caption": "G1",
            "rows":
                [
                    ["[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"ります\"}]", "[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|る]]\"}]", "[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|[[small|っ]]て]]\"}]", "[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|[[small|っ]]た]]\"}]"],
                    ["[{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"みます\"}]", "[{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"[[blue|む]]\"}]", "[{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"[[blue|んで]]\"}]", "[{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"[[blue|んだ]]\"}]"],
                    ["[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"きます\"}]", "[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"[[blue|く]]\"}]", "[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"[[blue|いて]]\"}]", "[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"[[blue|いた]]\"}]"],
                    ["[{\"k\":\"急\",\"f\":\"いそ\"},{\"k\":\"ぎます\"}]", "[{\"k\":\"急\",\"f\":\"いそ\"},{\"k\":\"[[blue|ぐ]]\"}]", "[{\"k\":\"急\",\"f\":\"いそ\"},{\"k\":\"[[blue|いで]]\"}]", "[{\"k\":\"急\",\"f\":\"いそ\"},{\"k\":\"[[blue|いだ]]\"}]"]
                ]
        },
        {
            "header": ["ます形", "原形", "て形", "た形"],
            "caption": "G2",
            "rows":
                [
                    ["[{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べます\"}]", "[{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|る]]\"}]", "[{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|て]]\"}]", "[{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|た]]\"}]"],
                    ["[{\"k\":\"います\"}]", "[{\"k\":\"い[[blue|る]]\"}]", "[{\"k\":\"い[[blue|て]]\"}]", "[{\"k\":\"い[[blue|た]]\"}]"]
                ]

        },
        {
            "header": ["ます形", "原形", "て形", "た形"],
            "caption": "G3",
            "rows":
                [
                    ["[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"ます\"}]", "[{\"k\":\"来\",\"f\":\"く\"},{\"k\":\"[[blue|る]]\"}]", "[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|て]]\"}]", "[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|た]]\"}]"],
                    ["[{\"k\":\"し[[blue|ます]]\"}]", "[{\"k\":\"[[blue|する]]\"}]", "[{\"k\":\"[[blue|して]]\"}]", "[{\"k\":\"[[blue|した]]\"}]"],
                    ["[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|します]]\"}]", "[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|する]]\"}]", "[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|して]]\"}]", "[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|した]]\"}]"]
                ]

        }
        ]
    },
    {
        "tile": "~て形+も+いいですか",
        "trans": "(請求句型)可以……嗎？",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "アイスクリーム"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "べます。"
                            }
                        ],
                        "zh": "吃冰淇淋"
                    },
                    {
                        "jp": [
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "[[blue|べてもいいですか。]]"
                            }
                        ],
                        "zh": "可以吃嗎？"
                    },
                    {
                        "jp": [
                            {
                                "k": "お"
                            },
                            {
                                "k": "母",
                                "f": "かあ"
                            },
                            {
                                "k": "さん、アイスクリームを"
                            },
                            {
                                "k": "食",
                                "f": "た"
                            },
                            {
                                "k": "べ[[blue-underline|ても|]][[blue-underline|いい|]][[blue-underline|ですか。|]]"
                            }
                        ],
                        "zh": "媽媽可以吃冰淇淋嗎？"
                    }
                ]
            }
        ]
    },
    {
        "tile": "穿戴動詞搭配:",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "[[blue-underline|きもの|着物]][[blue|を]][[blue-underline|き|着]][[blue|ます]]"
                            }
                        ],
                        "zh": "穿和服"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "スリ[[small|ッ]]パ[[blue|をはきます。]]"
                            }
                        ],
                        "zh": "穿拖鞋"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "ピアス[[blue|をします。]]"
                            }
                        ],
                        "zh": "戴耳環"
                    }]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "めがね[[blue|をかけます。]]"
                            }
                        ],
                        "zh": "戴眼鏡"
                    }]
            },
            {
                "id": 5,
                "dia": [
                    {
                        "jp": [
                            { "k": "帽", "f": "ぼ" },
                            { "k": "子", "f": "うし" },
                            {
                                "k": "[[blue|をかぶります。]]"
                            }
                        ],
                        "zh": "戴帽子"
                    }]
            },
            {
                "id": 6,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "マスク[[blue|をします。]]"
                            }
                        ],
                        "zh": "戴口罩"
                    }]
            },
            {
                "id": 7,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "ゆびわ[[blue|を]][br1]"
                            }
                        ],
                        "zh": "戴戒指<br/>[[icon-important|]]配件類的動詞可以直接用「します」"
                    }
                ]
            }
        ],
        "br1": [
            "つけます。",
            "します。"
        ]
    },
    {
        "tile": "て形+ください",
        "trans": "(有輕微命令的請)",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "きます"
                            }
                        ],
                        "zh": "聽、問"
                    },
                    {
                        "jp": [
                            {
                                "k": "音",
                                "f": "おん"
                            },
                            {
                                "k": "楽",
                                "f": "がく"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "きます。"
                            }
                        ],
                        "zh": "[[blue|聽]]音樂"
                    },
                    {
                        "jp": [
                            {
                                "k": "音",
                                "f": "おん"
                            },
                            {
                                "k": "楽",
                                "f": "がく"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "聞",
                                "f": "き"
                            },
                            {
                                "k": "いて[[blue|ください]]。"
                            }
                        ],
                        "zh": "[[blue|請]]聽音樂"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "預",
                                "f": "あず"
                            },
                            {
                                "k": "けます"
                            }
                        ],
                        "zh": "寄放"
                    },
                    {
                        "jp": [
                            {
                                "k": "荷",
                                "f": "に"
                            },
                            {
                                "k": "物",
                                "f": "もつ"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "預",
                                "f": "あず"
                            },
                            {
                                "k": "けます。"
                            }
                        ],
                        "zh": "寄放行李"
                    },
                    {
                        "jp": [
                            {
                                "k": "荷",
                                "f": "に"
                            },
                            {
                                "k": "物",
                                "f": "もつ"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "預",
                                "f": "あず"
                            },
                            {
                                "k": "け[[blue|てください]]。"
                            }
                        ],
                        "zh": "[[blue|請]]寄放行李"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "います"
                            }
                        ],
                        "zh": "買"
                    },
                    {
                        "jp": [
                            {
                                "k": "切",
                                "f": "きっ"
                            },
                            {
                                "k": "票",
                                "f": "ぷ"
                            },
                            {
                                "k": "/チケット[[blue|を]]"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "います"
                            }
                        ],
                        "zh": "買票"
                    },
                    {
                        "jp": [
                            {
                                "k": "切",
                                "f": "きっ"
                            },
                            {
                                "k": "票",
                                "f": "ぷ"
                            },
                            {
                                "k": "/チケット[[blue|を]]"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "って[[blue|ください]]"
                            }
                        ],
                        "zh": "請買票"
                    }
                ]
            },
            {
                "id": "4 重點",
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "頑",
                                "f": "がん"
                            },
                            {
                                "k": "張",
                                "f": "ば"
                            },
                            {
                                "k": "ります"
                            }
                        ],
                        "zh": "加油"
                    },
                    {
                        "jp": [
                            {
                                "k": "先生："
                            },
                            {
                                "k": "頑",
                                "f": "がん"
                            },
                            {
                                "k": "張",
                                "f": "ば"
                            },
                            {
                                "k": "って[[blue|くださいね]]"
                            }
                        ],
                        "zh": "請加油"
                    },
                    {
                        "jp": [
                            {
                                "k": "[[icon|success-icon]]學生：はい、"
                            },
                            {
                                "k": "頑",
                                "f": "がん"
                            },
                            {
                                "k": "張",
                                "f": "ば"
                            },
                            {
                                "k": "[[blue|ります]]"
                            }
                        ],
                        "zh": "好的，會加油的"
                    },
                    {
                        "jp": [
                            {
                                "k": "[[icon|error-icon]]學生：はい、"
                            },
                            {
                                "k": "頑",
                                "f": "がん"
                            },
                            {
                                "k": "張",
                                "f": "ば"
                            },
                            {
                                "k": "[[blue|って]]"
                            }
                        ],
                        "zh": "(這個回答是錯的)"
                    }
                ]
            }
        ]
    },
    {
        "tile": "で",
        "trans": "(用，有「方法、手段、工具」涵意)",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、"
                            },
                            {
                                "k": "現",
                                "f": "げん"
                            },
                            {
                                "k": "金",
                                "f": "きん"
                            },
                            {
                                "k": "[[box|で]][[blue|お]]"
                            },
                            {
                                "k": "[[blue|願]]",
                                "f": "ねが"
                            },
                            {
                                "k": "[[blue|いします。]]"
                            }
                        ],
                        "zh": "不好意思，我付現金。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、"
                            },
                            {
                                "k": "氷",
                                "f": "こお"
                            },
                            {
                                "k": "り"
                            },
                            {
                                "k": "抜",
                                "f": "ぬ"
                            },
                            {
                                "k": "き"
                            },
                            {
                                "k": "[[box|で]][[blue|お]]"
                            },
                            {
                                "k": "[[blue|願]]",
                                "f": "ねが"
                            },
                            {
                                "k": "[[blue|いします。]]"
                            }
                        ],
                        "zh": "不好意思去冰。"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、"
                            },
                            {
                                "k": "持",
                                "f": "も"
                            },
                            {
                                "k": "ち"
                            },
                            {
                                "k": "帰",
                                "f": "かえ"
                            },
                            {
                                "k": "り"
                            },
                            {
                                "k": "[[box|で]][[blue|お]]"
                            },
                            {
                                "k": "[[blue|願]]",
                                "f": "ねが"
                            },
                            {
                                "k": "[[blue|いします。]]"
                            }
                        ],
                        "zh": "不好意思外帶。"
                    }
                ]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、トリングは"
                            },
                            {
                                "k": "2",
                                "f": "ふた"
                            },
                            {
                                "k": "つ[[blue|ずつ]]"
                            },
                            {
                                "k": "[[blue|お]]"
                            },
                            {
                                "k": "[[blue|願]]",
                                "f": "ねが"
                            },
                            {
                                "k": "[[blue|いします。]]"
                            }
                        ],
                        "zh": "不好意思，飲料麻煩[[blue|各]]2杯"
                    }
                ]
            },

            {
                "id": 5,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、1本ずつ願いします。"
                            }
                        ],
                        "zh": "不好意思，飲料麻煩[[blue|各]]2杯"
                    }
                ]
            }, {
                "id": 6,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、チョコひとつ[[blue|と]]バニラひとつ[[blue|と]]マンゴひとつ[[blue|ずつ]]願いします。"
                            }
                        ],
                        "zh": "不好意思，巧克力、香草、哈蜜瓜冰淇淋各一支"
                    }
                ]
            }
        ]
    }, {
        "tile": "數量詞+[[blue-underline|ずつ|各…]]",
        "trans": "用於平均數量時",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "2人",
                                "f": "ふたり"
                            },
                            {
                                "k": "[[blue|ずつ]]、[[box|\"[{\"k\":\"座\",\"f\":\"すわ\"},{\"k\":\"って\"}]\"]][[notetop|[[note1]]]]ください。"
                            }
                        ],
                        "zh": "請2個人2個人坐。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "すみません、このケーキ"
                            },
                            {
                                "k": "2",
                                "f": "ふた"
                            },
                            {
                                "k": "つずつお"
                            },
                            {
                                "k": "願",
                                "f": "ねが"
                            },
                            {
                                "k": "いします。"
                            }
                        ],
                        "zh": "不好意思，這個蛋糕麻煩各2個。"
                    }
                ]
            }
        ],
        "note": {
            "note1": [
                {
                    "k": "座",
                    "f": "すわ"
                },
                { "k": "ります" },
                { "k": " [[blue|G1動詞]]" }
            ]
        }

    },
    {
        "tile": "動詞 (判別類型規則)",
        "tables": [{
            "header": ["類型", "規則"],
            "caption": "有3大類(G1、G2、G3)",
            "rows":
                [
                    ["[{\"k\":\"G1\"}]", "[{\"k\":\"如果判斷該動詞為「G1」動詞，從「ます」前的字母來判斷，ます前的字母[[blue|沒有超過那行字母的第3字母，這動詞為「G1」動詞。]]\"}]"],
                    ["[{\"k\":\"G1範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|き]]ます  \"},{\"k\":\"2.\"},{\"k\":\"入\",\"f\":\"は[[blue|い]]\"},{\"k\":\"ます\"}]"],
                    ["[{\"k\":\"G2\"}]", "[{\"k\":\"如果判斷該動詞為「G2」動詞，從「ます」前的字母來判斷，ます前的字母[[blue|已超過那行字母的第3字母，這動詞為「G2」動詞或「ます」前只有1個50音字母，不管這字母有沒有超過第3字母，這動詞為「G2」動詞。]]\"}]"],
                    ["[{\"k\":\"G2範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"[[blue|べ]]ます  \"},{\"k\":\"2.[[blue|い]]ます  3.\"},{\"k\":\"着\",\"f\":\"[[blue|き]]\"},{\"k\":\"ます\"}]"],
                    ["[{\"k\":\"G3\"}]", "[{\"k\":\"1.\"},{\"k\":\"[[blue|来]]\",\"f\":\"き\"},{\"k\":\"[[blue|ます。]]  2.[[blue|します。+します，2個漢字加「します」為「G3」動詞]]\"}]"],
                    ["[{\"k\":\"G3範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|します]]\"}]"],
                    ["", "[{\"k\":\"[[icon-important|]]1個漢字加「します」為「G1」動詞，例: \"},{\"k\":\"出\",\"f\":\"だ\"},{\"k\":\"[[blue|します]]\"}]"]
                ]
        }
        ]
    },
    {
        "tile": "動詞「原形」",
        "desp": "~ます → 「原形」",
        "trans": "（肯定形）",
        "tables": [{
            "header": ["類型", "規則"],
            "rows":
                [
                    ["[{\"k\":\"G1\"}]", "[{\"k\":\"確定該動詞為「G1」動詞時，[[blue|把ます去掉，ます前面的字母變第3個字母。]]\"}]"],
                    ["[{\"k\":\"G1範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|き]]ます  [[yellow|→]]\"},{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[blue|く]]<br>2.\"},{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|り]]ます  [[yellow|→]]\"},{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|る]]<br>3.\"},{\"k\":\"出\",\"f\":\"だ\"},{\"k\":\"[[blue|し]]ます  [[yellow|→]]\"},{\"k\":\"出\",\"f\":\"だ\"},{\"k\":\"[[blue|す]]\"}]"],
                    ["", "[{\"k\":\"[[icon-important|「します」前只有一個漢字為「G1」]]\"}]"],
                    ["[{\"k\":\"G2\"}]", "[{\"k\":\"把[[blue|ます]]去掉直接加[[blue|「る」]]。\"}]"],
                    ["[{\"k\":\"G2範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"[[blue|べ]]ます  [[yellow|→]]\"},{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"[[blue|べ]]る\"},{\"k\":\"<br>2.[[blue|い]]ます    [[yellow|→]]  [[blue|い]]る<br>3.\"},{\"k\":\"教\",\"f\":\"おし\"},{\"k\":\"[[blue|え]]ます    [[yellow|→]]\"},{\"k\":\"教\",\"f\":\"おし\"},{\"k\":\"[[blue|え]]る\"}]"],
                    ["", "[{\"k\":\"[[icon-important|「ます」前只有一個50音為「G2」]]\"}]"],
                    ["[{\"k\":\"G3\"}]", "[{\"k\":\"把[[blue|ます]]去掉直接加[[blue|「る」，ます前面的字母變第3個字母]]\"}]"],
                    ["[{\"k\":\"G3範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"ます  [[yellow|→]]\"},{\"k\":\"来\",\"f\":\"く\"},{\"k\":\"[[blue|る]]\"}]"],
                    ["", "[{\"k\":\"[[icon-important|2個漢字加「します」為「G3」動詞]]\"}]"],
                    ["[{\"k\":\"2個漢字範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"遅\",\"f\":\"ち\"},{\"k\":\"刻\",\"f\":\"こく\"},{\"k\":\"[[blue|します]]  [[yellow|→]]\"},{\"k\":\"遅\",\"f\":\"ち\"},{\"k\":\"刻\",\"f\":\"こく\"},{\"k\":\"[[blue|する]]\"},{\"k\":\"<br>2.\"},{\"k\":\"面\",\"f\":\"めん\"},{\"k\":\"倒\",\"f\":\"どう\"},{\"k\":\"[[blue|します]]  [[yellow|→]]\"},{\"k\":\"面\",\"f\":\"めん\"},{\"k\":\"倒\",\"f\":\"どう\"},{\"k\":\"[[blue|する]]\"}]"]
                ]
        }
        ]
    },
    {
        "tile": "動詞「ない形」",
        "desp": "~ません → 「ない形」",
        "trans": "（否定形）",
        "tables": [{
            "header": ["類型", "規則"],
            "rows":
                [
                    ["[{\"k\":\"G1\"}]", "[{\"k\":\"將動詞語尾的假名改成對應的[[blue|「あ段音」]]，再加「ない」。\"}]"],
                    ["[{\"k\":\"G1範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[yellow|き]][[blue|ません]]  [[yellow|→]]\"},{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[yellow|か]][[blue|ない]]<br>2.\"},{\"k\":\"休\",\"f\":\"やす\"},{\"k\":\"[[yellow|み]][[blue|ません]]  [[yellow|→]]\"},{\"k\":\"休\",\"f\":\"やす\"},{\"k\":\"[[yellow|ま]][[blue|ない]]<br>3.\"},{\"k\":\"会\",\"f\":\"あ\"},{\"k\":\"[[yellow|い]][[blue|ません]]  [[yellow|→]]\"},{\"k\":\"会\",\"f\":\"あ\"},{\"k\":\"[[strike|あ]][[yellow|わ]][[blue|ない]]<br>[[icon-important|如果有遇到變到「あ」一律改為「わ」]]\"}]"],
                    ["[{\"k\":\"G2\"}]", "[{\"k\":\"把[[blue|ません]]去掉直接加[[blue|「ない」]]。\"}]"],
                    ["[{\"k\":\"G2範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|ません]]  [[yellow|→]]\"},{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|ない]]<br>2.\"},{\"k\":\"寝\",\"f\":\"ね\"},{\"k\":\"[[blue|ません]] [[yellow|→]]\"},{\"k\":\"寝\",\"f\":\"ね\"},{\"k\":\"[[blue|ない]]<br>3.\"},{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ません]]    [[yellow|→]]\"},{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ない]]\"}]"],
                    ["[{\"k\":\"G3\"}]", "[{\"k\":\"把[[blue|ません]]去掉直接加[[blue|「ない」]]。（跟G2一樣)\"}]"],
                    ["[{\"k\":\"G3範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"ません   [[yellow|→]]\"},{\"k\":\"来\",\"f\":\"こ\"},{\"k\":\"[[blue|ない]]<br>2.\"},{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"し[[blue|ません]][[yellow|→]]\"},{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"し[[blue|ない]]\"}]"],

                ]
        }
        ]
    },
    {
        "tile": "動詞「て形」",
        "desp": "~ます → 「原形」 → 「て形」",
        "tables": [{
            "header": ["類型", "規則"],
            "rows":
                [
                    ["[{\"k\":\"G1\"}]", "[{\"k\":\"う、つ、る [[yellow|→]] って\"}]"],
                    ["[{\"k\":\"って範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"買\",\"f\":\"か\"},{\"k\":\"います  [[yellow| → ]]\"},{\"k\":\"買\",\"f\":\"か\"},{\"k\":\"[[blue|う]][[yellow| → ]]\"},{\"k\":\"買\",\"f\":\"か\"},{\"k\":\"[[blue|って]]<br>2.\"},{\"k\":\"立\",\"f\":\"た\"},{\"k\":\"ちます[[yellow| → ]]\"},{\"k\":\"立\",\"f\":\"た\"},{\"k\":\"[[blue|っ]][[yellow|→]]\"},{\"k\":\"立\",\"f\":\"た\"},{\"k\":\"[[blue|って]]<br>3.\"},{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"ります[[yellow|→]]\"},{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|る]][[yellow|→]]\"},{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[blue|って]]\"}]"],
                    ["", "[{\"k\":\"ぶ、む、ぬ  [[yellow|→]] んで\"}]"],
                    ["[{\"k\":\"んで範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"呼\",\"f\":\"よ\"},{\"k\":\"びます  [[yellow| → ]]\"},{\"k\":\"呼\",\"f\":\"よ\"},{\"k\":\"[[blue|ぶ]][[yellow| → ]]\"},{\"k\":\"呼\",\"f\":\"よ\"},{\"k\":\"[[blue|んで]]<br>2.\"},{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"みます[[yellow| → ]]\"},{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"[[blue|む]][[yellow|→]]\"},{\"k\":\"読\",\"f\":\"よ\"},{\"k\":\"[[blue|んで]]<br>3.\"},{\"k\":\"死\",\"f\":\"し\"},{\"k\":\"こます[[yellow|→]]\"},{\"k\":\"死\",\"f\":\"し\"},{\"k\":\"[[blue|ぬ]][[yellow|→]]\"},{\"k\":\"死\",\"f\":\"し\"},{\"k\":\"[[blue|んで]]\"}]"],
                    ["", "[{\"k\":\"す  [[yellow| → ]] して\"}]"],
                    ["[{\"k\":\"して範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"出\",\"f\":\"だ\"},{\"k\":\"す  [[yellow| → ]]\"},{\"k\":\"出\",\"f\":\"だ\"},{\"k\":\"[[blue|して]]\"}]"],
                    ["", "[{\"k\":\"く  [[yellow|→]] いて\"}]"],
                    ["[{\"k\":\"いて範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"動\",\"f\":\"うご\"},{\"k\":\"く  [[yellow| → ]]\"},{\"k\":\"動\",\"f\":\"うご\"},{\"k\":\"[[blue|いて]]\"}]"],
                    ["", "[{\"k\":\"ぐ  [[yellow|→]] いで\"}]"],
                    ["[{\"k\":\"いで範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"騒\",\"f\":\"さわ\"},{\"k\":\"ぐ  [[yellow| → ]]\"},{\"k\":\"騒\",\"f\":\"さわ\"},{\"k\":\"[[blue|いで]]\"}]"],
                    ["[{\"k\":\"G1綜合範例\"}]", "[{\"k\":\"割\",\"f\":\"わ\"},{\"k\":\"[[blue|る]]  [[yellow| → ]]\"},{\"k\":\"割\",\"f\":\"わ\"},{\"k\":\"[[blue|って]]<br>\"},{\"k\":\"会\",\"f\":\"あ\"},{\"k\":\"[[blue|う]]  [[yellow| → ]]\"},{\"k\":\"会\",\"f\":\"あ\"},{\"k\":\"[[blue|って]]<br>\"},{\"k\":\"打\",\"f\":\"う\"},{\"k\":\"[[blue|つ]]  [[yellow| → ]]\"},{\"k\":\"打\",\"f\":\"う\"},{\"k\":\"[[blue|って]]<br>\"},{\"k\":\"遊\",\"f\":\"あそ\"},{\"k\":\"[[blue|ぶ]]  [[yellow| → ]]\"},{\"k\":\"遊\",\"f\":\"あそ\"},{\"k\":\"[[blue|んで]]\"}]"],
                    ["[{\"k\":\"G2\"}]", "[{\"k\":\"~る  →  て。\"}]"],
                    ["[{\"k\":\"G2範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べます  [[yellow| → ]]\"},{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|る]] [[yellow| → ]]\"},{\"k\":\"食\",\"f\":\"た\"},{\"k\":\"べ[[blue|て]]<br>2.います [[yellow| → ]] い[[blue|る]] [[yellow| → ]]い[[blue|て]]\"}]"],
                    ["[{\"k\":\"G3\"}]", "[{\"k\":\"~する  →  して。\"}]"],
                    ["[{\"k\":\"G3範例\"}]", "[{\"k\":\"1.\"},{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"ます   [[yellow|→]]\"},{\"k\":\"来\",\"f\":\"く\"},{\"k\":\"[[blue|る]]  [[yellow|→]]\"},{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|て]]<br>2.\"},{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|します]][[yellow|→]]\"},{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|する]][[yellow|→]]\"},{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|して]]\"}]"],

                ]
        }
        ]
    },
    {
        "tile": "以下為特列的「G2」動詞",
        "tables": [{
            "header": ["中文", "~ます → 「原形」"],
            "rows":
                [
                    ["[{\"k\":\"沖、淋\"}]", "[{\"k\":\"浴\",\"f\":\"あ\"},{\"k\":\"[[blue|び]]ます  [[yellow| → ]]\"},{\"k\":\"浴\",\"f\":\"あ\"},{\"k\":\"び[[blue|る]]\"}]"],
                    ["[{\"k\":\"掉落\"}]", "[{\"k\":\"落\",\"f\":\"お\"},{\"k\":\"[[blue|ち]]ます  [[yellow| → ]]\"},{\"k\":\"落\",\"f\":\"お\"},{\"k\":\"ち[[blue|る]]\"}]"],
                    ["[{\"k\":\"起床\"}]", "[{\"k\":\"起\",\"f\":\"お\"},{\"k\":\"[[blue|き]]ます  [[yellow| → ]]\"},{\"k\":\"起\",\"f\":\"お\"},{\"k\":\"き[[blue|る]]\"}]"],
                    ["[{\"k\":\"(有生命)有、在\"}]", "[{\"k\":\"[[blue|い]]ます  [[yellow| → ]] [[い|る]]\"}]"],
                    ["[{\"k\":\"借進來\"}]", "[{\"k\":\"借\",\"f\":\"か\"},{\"k\":\"[[blue|り]]ます  [[yellow| → ]]\"},{\"k\":\"借\",\"f\":\"か\"},{\"k\":\"り[[blue|る]]\"}]"],
                    ["[{\"k\":\"(交通工具)下<br>電車、船、新幹線\"}]", "[{\"k\":\"降\",\"f\":\"お\"},{\"k\":\"[[blue|り]]ます  [[yellow| → ]]\"},{\"k\":\"降\",\"f\":\"お\"},{\"k\":\"り[[blue|る]]\"}]"]
                ]
        }
        ]
    },
    {
        "tile": "動詞「なかった形」",
        "desp": "~ませんでした →「なかった形」<br>規則: な[[strike|い]] + かった",
        "trans": "否定過去式，意思是「沒有做...」、「沒發生...」",
        "tables": [{
            "header": ["敬體", "口語"],
            "caption": "G1",
            "rows":
                [
                    ["[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ませんでした]]\"}]", "[{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"[[box|[[blue|か]]]][[blue|な[[strike|い]]かった]]\"}]"],
                    ["[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"り[[blue|ませんでした]]\"}]", "[{\"k\":\"帰\",\"f\":\"かえ\"},{\"k\":\"[[box|[[blue|ら]]]][[blue|な[[strike|い]]かった]]\"}]"],
                    ["[{\"k\":\"休\",\"f\":\"やす\"},{\"k\":\"み[[blue|ませんでした]]\"}]", "[{\"k\":\"休\",\"f\":\"やす\"},{\"k\":\"[[box|[[blue|ま]]]][[blue|な[[strike|い]]かった]]\"}]"],
                    ["[{\"k\":\"取\",\"f\":\"と\"},{\"k\":\"り[[blue|ませんでした]]\"}]", "[{\"k\":\"取\",\"f\":\"と\"},{\"k\":\"[[box|[[blue|ら]]]][[blue|な[[strike|い]]かった]]\"}]"],
                    ["[{\"k\":\"立\",\"f\":\"た\"},{\"k\":\"ち[[blue|ませんでした]]\"}]", "[{\"k\":\"立\",\"f\":\"た\"},{\"k\":\"[[box|[[blue|た]]]][[blue|な[[strike|い]]かった]]\"}]"],
                    ["[{\"k\":\"立\",\"f\":\"た\"},{\"k\":\"ち[[blue|ませんでした]]\"}]", "[{\"k\":\"立\",\"f\":\"た\"},{\"k\":\"[[box|[[blue|た]]]][[blue|な[[strike|い]]かった]]\"}]"]
                ]
        },
        {
            "header": ["敬體", "口語"],
            "caption": "G2",
            "rows":
                [
                    ["[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|ませんでした]]\"}]", "[{\"k\":\"入\",\"f\":\"い\"},{\"k\":\"れ[[blue|な[[strike|い]]かった]]\"}]"],
                    ["[{\"k\":\"い[[blue|ませんでした]]\"}]", "[{\"k\":\"い[[blue|な[[strike|い]]かった]]\"}]"],
                    ["[{\"k\":\"教\",\"f\":\"おし\"},{\"k\":\"え[[blue|ませんでした]]\"}]", "[{\"k\":\"教\",\"f\":\"おし\"},{\"k\":\"え[[blue|な[[strike|い]]かった]]\"}]"],
                ]
        },
        {
            "header": ["敬體", "口語"],
            "caption": "G3",
            "rows":
                [
                    ["[{\"k\":\"来\",\"f\":\"き\"},{\"k\":\"[[blue|ませんでした]]\"}]", "[{\"k\":\"来\",\"f\":\"こ\"},{\"k\":\"[[blue|な[[strike|い]]かった]]\"}]"],
                    ["[{\"k\":\"し[[blue|ませんでした]]\"}]", "[{\"k\":\"し[[blue|な[[strike|い]]かった]]\"}]"],
                    ["[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"し[[blue|ませんでした]]\"}]", "[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"し[[blue|な[[strike|い]]かった]]\"}]"],
                ]
        }
        ]
    },
    {
        "tile": "場所 へ",
        "desp": [{
            "k": "い",
            "f": "行"
        },
        {
            "k": "きます  (去)<br>"
        }, {
            "k": "き",
            "f": "来"
        }, {
            "k": "ます    (來)<br>"
        }, {
            "k": "かえ",
            "f": "帰"
        }, {
            "k": "ります  (回來、回去)"
        }],
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "日",
                                "f": "に"
                            },
                            {
                                "k": "本",
                                "f": "ほん"
                            },
                            {
                                "k": "[[blue|へ]]"
                            },
                            {
                                "k": "[[blue|行]]",
                                "f": "い"
                            },
                            {
                                "k": "[[blue|きます]]"
                            }
                        ],
                        "zh": "[[blue|去]]日本"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "うち"
                            },
                            {
                                "k": "[[blue|へ]]"
                            },
                            {
                                "k": "[[blue|帰]]",
                                "f": "かえ"
                            },
                            {
                                "k": "[[blue|ります]]"
                            }
                        ],
                        "zh": "[[blue|回]]家"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A：さんはどこへいきますか。"
                            }
                        ],
                        "zh": "林先生[[blue|去哪裡]]？"
                    },
                    {
                        "jp": [
                            {
                                "k": "B："
                            },
                            {
                                "k": "公",
                                "f": "こう"
                            },
                            {
                                "k": "園",
                                "f": "えん"
                            },
                            {
                                "k": "[[blue|へ]]"
                            }, {
                                "k": "[[blue|行]]",
                                "f": "い"
                            },
                            {
                                "k": "[[blue|きます]]。"
                            }
                        ],
                        "zh": "[[blue|去]]公園"
                    }
                ]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "居",
                                "f": "い"
                            },
                            {
                                "k": "酒",
                                "f": "ざか"
                            },
                            {
                                "k": "屋",
                                "f": "や"
                            },
                            {
                                "k": "[[blue|へ]]"
                            },
                            {
                                "k": "[[blue|行]]",
                                "f": "い"
                            },
                            {
                                "k": "[[blue|きます]]。"
                            }
                        ],
                        "zh": "去居酒屋"
                    }
                ]
            },
            {
                "id": 5,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "友",
                                "f": "とも"
                            },
                            {
                                "k": "達",
                                "f": "だち"
                            },
                            {
                                "k": "[[blue|の]]"
                            },
                            {
                                "k": "会",
                                "f": "かい"
                            },
                            {
                                "k": "社",
                                "f": "しゃ"
                            },
                            {
                                "k": "[[blue|へ]]"
                            },
                            {
                                "k": "[[blue|来]]",
                                "f": "き"
                            },
                            {
                                "k": "[[blue|ます]]。"
                            }
                        ],
                        "zh": "來朋友的公司"
                    }
                ]
            },
            {
                "id": 6,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "くに[[blue|へ]]"
                            },
                            {
                                "k": "[[blue|帰]]",
                                "f": "かえ"
                            },
                            {
                                "k": "り[[blue|ます]]。"
                            }
                        ],
                        "zh": "回國"
                    }
                ]
            }
        ]

    },
    {
        "tile": "に(時間助詞)在",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "黃",
                                "f": "こう"
                            },
                            {
                                "k": "さん[[blue|は]]"
                            },
                            {
                                "k": "11",
                                "f": "じゅいち"
                            },
                            {
                                "k": "月",
                                "f": "がつ"
                            },
                            {
                                "k": "18",
                                "f": "じゅうはち"
                            },
                            {
                                "k": "日",
                                "f": "にち"
                            },
                            {
                                "k": "[[blue|に]]"
                            },
                            {
                                "k": "日",
                                "f": "に"
                            },
                            {
                                "k": "本",
                                "f": "ほん"
                            },
                            {
                                "k": "[[blue|へ]]"
                            },
                            {
                                "k": "行",
                                "f": "い"
                            },
                            {
                                "k": "きます。"
                            }
                        ],
                        "zh": "黃小姐[[blue|在]]11月18號去日本"
                    }
                ]
            }, {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A ： "
                            },
                            {
                                "k": "陳",
                                "f": "ちん"
                            },
                            {
                                "k": "さん[[blue|は]][[box|[[blue|いつ]]]]ここ[[blue|へ]]"
                            },
                            {
                                "k": "[[blue|来]]",
                                "f": "き"
                            },
                            {
                                "k": "ましたか。"
                            }
                        ],
                        "zh": "陳先生什麼時候來了這裡呢？"
                    },
                    {
                        "jp": [
                            {
                                "k": "[[icon-important|いつ：什麼時候，用在時間大範圍上。時、分不可用。]]"
                            }
                        ]
                    }, {
                        "jp": [
                            {
                                "k": "B ： きのう"
                            },
                            {
                                "k": "[[blue|来]]",
                                "f": "き"
                            },
                            {
                                "k": "[[blue|ました]]"
                            }
                        ],
                        "zh": "昨天[[blue|來的]]"
                    },
                ]
            }
        ]

    },
    {
        "tile": "~ で ~ 搭",
        "desp": "交通工具",
        "exam": [
            {
                "id": "",
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "1. バス[[blue|で]]"
                            }
                        ],
                        "zh": "[[blue|搭]]公車"
                    },
                    {
                        "jp": [
                            {
                                "k": "飛",
                                "f": "ひ"
                            }, {
                                "k": "行",
                                "f": "こう"
                            }, {
                                "k": "機",
                                "f": "き"
                            }, {
                                "k": "[[blue|で]]"
                            }
                        ],
                        "zh": "[[blue|搭]]飛機"
                    },
                    {
                        "jp": [
                            {
                                "k": "電",
                                "f": "でん"
                            }, {
                                "k": "車",
                                "f": "しゃ"
                            }, {
                                "k": "[[blue|で]]"
                            }
                        ],
                        "zh": "[[blue|搭]]電車"
                    },
                    {
                        "jp": [
                            {
                                "k": "バイク[[blue|で]]"
                            }
                        ],
                        "zh": "[[blue|騎]]機車"
                    },
                    {
                        "jp": [{
                            "k": "步",
                            "f": "ある"
                        },
                        {
                            "k": "[[blue|いて]]"
                        }
                        ],
                        "zh": "走路"
                    }
                ]
            }, {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "お"
                            },
                            {
                                "k": "父",
                                "f": "とう"
                            },
                            {
                                "k": "さん[[blue|は]]"
                            },
                            {
                                "k": "会",
                                "f": "かい"
                            },
                            {
                                "k": "社",
                                "f": "しゃ"
                            },
                            {
                                "k": "[[blue|へ]]"
                            },
                            {
                                "k": "[[blue|行]]",
                                "f": "い"
                            },
                            {
                                "k": "[[blue|きます]]。"
                            }
                        ],
                        "zh": "爸爸[[blue|去]]公司"
                    },
                    {
                        "jp": [
                            {
                                "k": "お"
                            },
                            {
                                "k": "父",
                                "f": "とう"
                            },
                            {
                                "k": "さん[[blue|は]]"
                            },
                            {
                                "k": "車",
                                "f": "くるま"
                            },
                            {
                                "k": "[[blue|で]]"
                            },
                            {
                                "k": "会",
                                "f": "かい"
                            },
                            {
                                "k": "社",
                                "f": "しゃ"
                            },
                            {
                                "k": "[[blue|へ]]"
                            },
                            {
                                "k": "[[blue|行]]",
                                "f": "い"
                            },
                            {
                                "k": "[[blue|きます]]。"
                            }
                        ],
                        "zh": "爸爸[[blue|開車去]]公司"
                    },
                    {
                        "jp": [
                            {
                                "k": "お"
                            },
                            {
                                "k": "父",
                                "f": "とう"
                            },
                            {
                                "k": "さん[[blue|は]]"
                            },
                            {
                                "k": "每",
                                "f": "まい"
                            },
                            {
                                "k": "朝",
                                "f": "あさ"
                            },
                            {
                                "k": "7",
                                "f": "しち"
                            },
                            {
                                "k": "時",
                                "f": "じ"
                            },
                            {
                                "k": "半",
                                "f": "はん"
                            },
                            {
                                "k": "車",
                                "f": "くるま"
                            },
                            {
                                "k": "[[blue|で]]"
                            },
                            {
                                "k": "会",
                                "f": "かい"
                            },
                            {
                                "k": "社",
                                "f": "しゃ"
                            },
                            {
                                "k": "[[blue|へ]]"
                            },
                            {
                                "k": "[[blue|行]]",
                                "f": "い"
                            },
                            {
                                "k": "[[blue|きます]]。"
                            }
                        ],
                        "zh": "爸爸每天早上[[blue|在]]7點半[[blue|開車去]]公司"
                    }
                ]
            }
        ]

    },
    {
        "tile": "主語 は 時間 に 交通工具 で 場所へ",
        "desp": [{
            "k": "い",
            "f": "行"
        },
        {
            "k": "きます  (去)<br>"
        }, {
            "k": "き",
            "f": "来"
        }, {
            "k": "ます    (來)<br>"
        }, {
            "k": "かえ",
            "f": "帰"
        }, {
            "k": "ります  (回來、回去)"
        }],
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "友",
                                "f": "とも"
                            },
                            {
                                "k": "達",
                                "f": "だち"
                            },
                            {
                                "k": "[[blue|は]]"
                            },
                            {
                                "k": "11",
                                "f": "じゅいち"
                            },
                            {
                                "k": "月",
                                "f": "がつ"
                            },
                            {
                                "k": "[[blue|に]]"
                            },
                            {
                                "k": "船",
                                "f": "ふね"
                            },
                            {
                                "k": "[[blue|で]]"
                            },
                            {
                                "k": "日",
                                "f": "に"
                            },
                            {
                                "k": "本",
                                "f": "ほん"
                            },
                            {
                                "k": "[[blue|へ]]"
                            },
                            {
                                "k": "行",
                                "f": "い"
                            },
                            {
                                "k": "きます。"
                            }
                        ],
                        "zh": "朋友11月份[[blue|搭]]船[[blue|去]]日本。"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "友",
                                "f": "とも"
                            },
                            {
                                "k": "達",
                                "f": "だち"
                            },
                            {
                                "k": "[[blue|は]]"
                            },
                            {
                                "k": "飛",
                                "f": "ひ"
                            },
                            {
                                "k": "行",
                                "f": "こう"
                            },
                            {
                                "k": "機",
                                "f": "き"
                            },
                            {
                                "k": "[[blue|で]]"
                            },
                            {
                                "k": "国",
                                "f": "くに"
                            },
                            {
                                "k": "[[blue|へ]]"
                            },
                            {
                                "k": "[[blue|帰]]",
                                "f": "かえ"
                            },
                            {
                                "k": "[[blue|ります]]。"
                            }
                        ],
                        "zh": "朋友[[blue|搭]]飛機[[blue|回]]國。"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "お"
                            },
                            {
                                "k": "母",
                                "f": "かあ"
                            },
                            {
                                "k": "さん[[blue|は]]"
                            },
                            {
                                "k": "朝",
                                "f": "あさ"
                            },
                            {
                                "k": "コンビニ[[blue|で]]"
                            },
                            {
                                "k": "牛",
                                "f": "ぎゅう"
                            },
                            {
                                "k": "乳",
                                "f": "にゅう"
                            },
                            {
                                "k": "を"
                            },
                            {
                                "k": "買",
                                "f": "か"
                            },
                            {
                                "k": "います。"
                            }
                        ],
                        "zh": "媽媽早上在便利商店買牛奶。"
                    }
                ]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "同",
                                "f": "どう"
                            },
                            {
                                "k": "僚",
                                "f": "りょう"
                            },
                            {
                                "k": "[[blue|は]]"
                            },
                            {
                                "k": "朝",
                                "f": "あさ"
                            },
                            {
                                "k": "步",
                                "f": "ある"
                            },
                            {
                                "k": "[[blue|いて]]ここ[[blue|へ]]"
                            },
                            {
                                "k": "来",
                                "f": "き"
                            },
                            {
                                "k": "ます。"
                            }
                        ],
                        "zh": "同事早上走路來這裡。"
                    }
                ]
            },
            {
                "id": 5,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "主",
                                "f": "しゅ"
                            },
                            {
                                "k": "人",
                                "f": "じん"
                            },
                            {
                                "k": "[[blue|は]]"
                            },
                            {
                                "k": "每",
                                "f": "まい"
                            },
                            {
                                "k": "晚",
                                "f": "ばん"
                            },
                            {
                                "k": "バス[[blue|で]]うち[[blue|へ]]"
                            },
                            {
                                "k": "[[blue|帰]]",
                                "f": "かえ"
                            },
                            {
                                "k": "[[blue|ります]]。"
                            }
                        ],
                        "zh": "老公每天晚上搭公車回家。"
                    }
                ]
            }

        ]

    },
    {
        "tile": "と (和)",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "[[icon|error-icon]] 錯的用法"
                            },
                            {
                                "k": "私",
                                "f": "わたし"
                            },
                            {
                                "k": "[[blue|と]]"
                            },
                            {
                                "k": "友",
                                "f": "とも"
                            },
                            {
                                "k": "達",
                                "f": "だち"
                            },
                            {
                                "k": "[[blue|は]]"
                            },
                            {
                                "k": "日",
                                "f": "に"
                            },
                            {
                                "k": "本",
                                "f": "ほん"
                            },
                            {
                                "k": "[[blue|へ]]"
                            },
                            {
                                "k": "行",
                                "f": "い"
                            },
                            {
                                "k": "きます。"
                            }
                        ]
                    },
                    {
                        "jp": [
                            {
                                "k": "[[icon|success-icon]] 對的用法"
                            },
                            {
                                "k": "わたし",
                                "f": "私"
                            },
                            {
                                "k": "[[blue|は]]"
                            },
                            {
                                "k": "友",
                                "f": "とも"
                            },
                            {
                                "k": "達",
                                "f": "だち"
                            },
                            {
                                "k": "[[blue|と]]"
                            },
                            {
                                "k": "日",
                                "f": "に"
                            },
                            {
                                "k": "本",
                                "f": "ほん"
                            },
                            {
                                "k": "[[blue|へ]]"
                            },
                            {
                                "k": "行",
                                "f": "い"
                            },
                            {
                                "k": "きます。"
                            }
                        ],
                        "zh": "我和朋友去日本"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A :"
                            },
                            {
                                "k": "誰",
                                "f": "だれ"
                            },
                            {
                                "k": "[[blue|と]]"
                            },
                            {
                                "k": "晚",
                                "f": "ばん"
                            },
                            {
                                "k": "ごはん"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "[[blue|食]]",
                                "f": "た"
                            },
                            {
                                "k": "[[blue|べますか]]。"
                            }
                        ],
                        "zh": "[[blue|和]]誰吃晚餐呢？"
                    },
                    {
                        "jp": [
                            {
                                "k": "A :"
                            },
                            {
                                "k": "妻",
                                "f": "つま"
                            },
                            {
                                "k": "[[blue|と]]"
                            },
                            {
                                "k": "一",
                                "f": "いっ"
                            },
                            {
                                "k": "緒",
                                "f": "しょ"
                            },
                            {
                                "k": "に"
                            },
                            {
                                "k": "[[blue|食]]",
                                "f": "た"
                            },
                            {
                                "k": "[[blue|べます]]。"
                            }
                        ],
                        "zh": "[[blue|和]]老婆一起吃。"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "わたし",
                                "f": "私"
                            },
                            {
                                "k": "[[blue|は]][[yellow|フルーツ]][[blue|と]]"
                            },
                            {
                                "k": "野",
                                "f": "や"
                            },
                            {
                                "k": "菜",
                                "f": "さい"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "[[blue|買]]",
                                "f": "か"
                            },
                            {
                                "k": "[[blue|います]]。"
                            }
                        ]
                    },
                    {
                        "jp": [
                            {
                                "k": "わたし",
                                "f": "私"
                            },
                            {
                                "k": "[[blue|は]]"
                            },
                            {
                                "k": "果",
                                "f": "くた"
                            },
                            {
                                "k": "物",
                                "f": "もの"
                            },
                            {
                                "k": "[[blue|は]]"
                            },
                            {
                                "k": "野",
                                "f": "や"
                            },
                            {
                                "k": "菜",
                                "f": "さい"
                            },
                            {
                                "k": "[[blue|を]]"
                            },
                            {
                                "k": "[[blue|買]]",
                                "f": "か"
                            },
                            {
                                "k": "[[blue|います]]。"
                            }
                        ],
                        "zh": "我[[blue|買]]水果[[blue|和]]蔬菜。"
                    }
                ]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "あした、お"
                            },
                            {
                                "k": "父",
                                "f": "とう"
                            },
                            {
                                "k": "さん[[blue|は]]お"
                            },
                            {
                                "k": "母",
                                "f": "かあ"
                            },
                            {
                                "k": "さん[[blue|と]]デパート[[blue|へ]]"
                            },
                            {
                                "k": "行",
                                "f": "い"
                            },
                            {
                                "k": "きます。"
                            }
                        ],
                        "zh": "明天爸爸[[blue|和]]媽媽去百貨公司。"
                    }
                ]
            }

        ]

    },
    {
        "tile": "~[[strike|ます]]+ませんか",
        "desp": "[br1]<br>⬇<br>[br2]",
        "trans": "ませんか : (委婉邀約) ……好嗎？",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A : "
                            },
                            {
                                "k": "黃",
                                "f": "こう"
                            },
                            {
                                "k": "さん"
                            },
                            {
                                "k": "今",
                                "f": "こん"
                            },
                            {
                                "k": "晩",
                                "f": "ばん"
                            },
                            {
                                "k": "一",
                                "f": "いっ"
                            },
                            {
                                "k": "緒",
                                "f": "しょ"
                            },
                            {
                                "k": "に"
                            },
                            {
                                "k": "飲",
                                "f": "の"
                            },
                            {
                                "k": "み[[strike|ます]][[blue|ませんか]]。"
                            }
                        ],
                        "zh": "黃小姐，今晚一起[[blue|喝一杯好嗎？]]"
                    },
                    {
                        "jp": [
                            {
                                "k": "B : すみません.ちょっと…… "
                            }
                        ],
                        "zh": "不好意思……"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "A :"
                            },
                            {
                                "k": "一",
                                "f": "いっ"
                            },
                            {
                                "k": "緒",
                                "f": "しょ"
                            },
                            {
                                "k": "に"
                            },
                            {
                                "k": "帰",
                                "f": "かえ"
                            },
                            {
                                "k": "り[[strike|ます]][[blue|ませんか]]。"
                            }
                        ],
                        "zh": "一起回家[[blue|好嗎]]？"
                    },
                    {
                        "jp": [
                            {
                                "k": "B : ええ. いいですね。"
                            }
                        ],
                        "zh": "嗯.好啊！"
                    },
                    {
                        "jp": [
                            {
                                "k": "B : はい、"
                            },
                            {
                                "k": "帰",
                                "f": "かえ"
                            },
                            {
                                "k": "り[[strike|ます]][[blue|ましょう]]。"
                            }
                        ],
                        "zh": "嗯.回家[[blue|吧！]]"
                    }
                ]
            }
        ],
        "br1": [
            "A : ~[[strike|ます]]+ませんか      (委婉邀約) ……好嗎？",
            "B : ~[[strike|ます]]+ましょう      ……吧！",
            "B : ええ.いいですね。      (嗯！好啊！)",
            "B : すみません.ちょっと……(不好意思……)",
        ],
        "br2": [
            "[{\"k\":\"一\",\"f\":\"いっ\"},{\"k\":\"緒\",\"f\":\"しょ\"},{\"k\":\"にトイレへ\"},{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ませんか]]\"}]",
            "一起去廁所[[blue|好嗎？]]",
            "[{\"k\":\"一\",\"f\":\"いっ\"},{\"k\":\"緒\",\"f\":\"しょ\"},{\"k\":\"にトイレへ\"},{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"き[[blue|ましょう]]\"}]",
            "一起去廁所[[blue|吧！]]",
        ]
    },
    {
        "tile": "<點餐>",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            {
                                "k": "店員 : いらっしゃいませ。"
                            },
                            {
                                "k": "[[blue|何]]",
                                "f": "なん"
                            },
                            {
                                "k": "[[blue|名]]",
                                "f": "めい"
                            },
                            {
                                "k": "[[blue|様]]",
                                "f": "さま"
                            },
                            {
                                "k": "ですか。"
                            }
                        ],
                        "zh": "歡迎光臨，[[blue|幾位呢？]]"
                    },
                    {
                        "jp": [
                            {
                                "k": "客人 : "
                            },
                            {
                                "k": "[[blue|4]]",
                                "f": "よ"
                            },
                            {
                                "k": "[[blue|人]]",
                                "f": "にん"
                            },
                            {
                                "k": "です。"
                            }
                        ],
                        "zh": "4個人"
                    },
                    {
                        "jp": [
                            {
                                "k": "店員 : "
                            },
                            {
                                "k": "[[blue|4]]",
                                "f": "よ"
                            },
                            {
                                "k": "[[blue|名]]",
                                "f": "めい"
                            },
                            {
                                "k": "[[blue|様]]",
                                "f": "さま"
                            },
                            {
                                "k": "ですね。"
                            }
                        ],
                        "zh": "4位"
                    },
                    {
                        "jp": [
                            {
                                "k": "客人 : はい。"
                            }
                        ],
                        "zh": "是的"
                    },
                    {
                        "jp": [
                            {
                                "k": "店員 : こちら へ どうぞ。"
                            }
                        ],
                        "zh": "這邊請"
                    },
                    {
                        "jp": [
                            { "k": "<幾分後><br>店員： ご" },
                            { "k": "注", "f": "ちゅう" },
                            { "k": "文", "f": "もん" },
                            { "k": "お" },
                            { "k": "決", "f": "き" },
                            { "k": "まりですか。" }
                        ],
                        "zh": "可以點餐了嗎？"
                    },
                    {
                        "jp": [
                            { "k": "客人 : はい、[[blue|カレー]]" },
                            { "k": "[[yellow|2]]", "f": "ふた" },
                            { "k": "[[yellow|つ]]と[[blue|みそラーメン]]" },
                            { "k": "[[yellow|2]]", "f": "ふた" },
                            { "k": "[[yellow|つ]]お" },
                            { "k": "願", "f": "ねが" },
                            { "k": "[[blue|いします。]]" }
                        ],
                        "zh": "麻煩2份咖哩飯和2碗味噌拉麵"
                    },
                    {
                        "jp": [
                            { "k": "ドリンクは" },
                            { "k": "生", "f": "なま" },
                            { "k": "ビール" },
                            { "k": "[[yellow|4]]", "f": "よっ" },
                            { "k": "[[yellow|つ]]お" },
                            { "k": "願", "f": "ねが" },
                            { "k": "[[blue|いします。]]" }
                        ],
                        "zh": "飲料，麻煩給4杯生啤酒"
                    },
                    {
                        "jp": [
                            { "k": "店員： ご" },
                            { "k": "注", "f": "ちゅう" },
                            { "k": "文", "f": "もん" },
                            { "k": "は" },
                            { "k": "以", "f": "い" },
                            { "k": "上", "f": "じょう" },
                            { "k": "よろしい[br1]" }
                        ],
                        "zh": "就點以上這些嗎？"
                    },
                    {
                        "jp": [
                            { "k": "客人： はい、" },
                            { "k": "以", "f": "い" },
                            { "k": "上", "f": "じょう" },
                            { "k": "でお" },
                            { "k": "願", "f": "ねが" },
                            { "k": "いします。" }
                        ],
                        "zh": "是的，就以上這些"
                    },
                    {
                        "jp": [
                            { "k": "店員： はい、(では/じゃ)[[notetop|[[note1]]]]ご" },
                            { "k": "注", "f": "ちゅう" },
                            { "k": "文", "f": "もん" },
                            { "k": "でお" },
                            { "k": "以", "f": "い" },
                            { "k": "上", "f": "じょう" },
                            { "k": "を" },
                            { "k": "繰", "f": "く" },
                            { "k": "り" },
                            { "k": "返", "f": "かえ" },
                            { "k": "します。" }
                        ],
                        "zh": " 好，那麼我重複一下餐點"
                    },
                    {
                        "jp": [
                            {
                                "k": "客人 : はい。"
                            }
                        ],
                        "zh": "是的"
                    },
                    {
                        "jp": [
                            { "k": "店員： カレー" },
                            { "k": "2", "f": "ふた" },
                            { "k": "つとみそラーメン" },
                            { "k": "2", "f": "ふた" },
                            { "k": "つと" },
                            { "k": "生", "f": "なま" },
                            { "k": "ビール" },
                            { "k": "4", "f": "よっ" },
                            { "k": "つです[[blue-underline|ね|確認語氣]]" }
                        ],
                        "zh": "咖哩2份、味噌拉麵2份和4杯生啤酒"
                    },
                    {
                        "jp": [
                            {
                                "k": "客人 : はい。"
                            }
                        ],
                        "zh": "是的。"
                    },
                    {
                        "jp": [
                            { "k": "店員： かしこまりました。" },
                            { "k": "少", "f": "しょう" },
                            { "k": "々", "f": "しょう" },
                            { "k": "お" },
                            { "k": "待", "f": "ま" },
                            { "k": "ちください。" }
                        ],
                        "zh": "了解、明白，請稍等。"
                    },
                    {
                        "jp": [
                            {
                                "k": "客人 : はい。"
                            }
                        ],
                        "zh": "是的。"
                    },
                    {
                        "jp": [
                            {
                                "k": "<"
                            },
                            {
                                "k": "食",
                                "f": "しょく"
                            },
                            {
                                "k": "後",
                                "f": "ご"
                            },
                            {
                                "k": ">餐後"
                            }
                        ]
                    },
                    {
                        "jp": [
                            {
                                "k": "客人 : ごちそうさまでした。<br> [[icon-important|]]可以再加上[[blue-underline|おいしかったです|]]。"
                            }
                        ],
                        "zh": "吃飽了，謝謝招待。"
                    },
                    {
                        "jp": [
                            { "k": "店員： ありがとうございます。お" },
                            { "k": "会", "f": "かい" },
                            { "k": "計", "f": "けい" },
                            { "k": "はどうしますか。" }
                        ],
                        "zh": "謝謝。要怎麼結帳呢？"
                    },
                    {
                        "jp": [
                            { "k": "客人： [br2]" },
                            { "k": "は" },
                            { "k": "一", "f": "いっ" },
                            { "k": "緒", "f": "しょ" },
                            { "k": "でお" },
                            { "k": "願", "f": "ねが" },
                            { "k": "いします。" }
                        ],
                        "zh": "麻煩一起結帳"
                    },
                    {
                        "jp": [
                            { "k": "店員： はい。お" },
                            { "k": "会", "f": "かい" },
                            { "k": "計", "f": "けい" },
                            { "k": "は" },
                            { "k": "10600", "f": "いちまんろっぴゃく" },
                            { "k": "円", "f": "えん" },
                            { "k": "[[blue-underline|でございます|です]]" }
                        ],
                        "zh": "好的，帳單是10600元。"
                    },
                    {
                        "jp": [
                            { "k": "客人： はい。" }
                        ],
                        "zh": "好的。"
                    }
                ]
            }
        ],
        "br1": [
            "ですか。",
            "でしょうか。"
        ],
        "br2": [
            "[{\"k\":\"会\",\"f\":\"かい\"},{\"k\":\"計\",\"f\":\"けい\"}]",
            "[{\"k\":\"勘\",\"f\":\"かん\"},{\"k\":\"定\",\"f\":\"じょう\"}]"
        ],
        "note": {
            "note1": [
                {
                    "k": "那麼/那麼"
                }
            ]
        }
    },
    {
        "tile": [
            {
                "k": "~を お"
            },
            {
                "k": "願",
                "f": "ねが"
            },
            {
                "k": "いします  (拜託，麻煩。)"
            }
        ],
        "exam": [
            {
                "id": 1,
                "dia": [

                    {
                        "jp": [
                            { "k": "すみませ。" },
                            { "k": "水", "f": "みず" },
                            { "k": "[[blue-underline|(を)|可省略]][[blue|お]]" },
                            { "k": "[[blue|願]]", "f": "ねが" },
                            { "k": "[[blue|いします]]。" }
                        ],
                        "zh": "麻煩[[blue|給水]]"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            { "k": "すみませ。" },
                            { "k": "水", "f": "みず" },
                            { "k": "[[blue-underline|(を)|可省略]]" },
                            { "k": "[[blue|3]]", "f": "みっ" },
                            { "k": "[[blue|つお]]" },
                            { "k": "[[blue|願]]", "f": "ねが" },
                            { "k": "[[blue|いします]]。" }
                        ],
                        "zh": "麻煩給3杯水"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            { "k": "すみませ。ねぎま" },
                            { "k": "[[blue-underline|(を)|可省略]]" },
                            { "k": "[[blue|2]]", "f": "に" },
                            { "k": "[[blue|本]]", "f": "ほん" },
                            { "k": "[[blue|お]]" },
                            { "k": "[[blue|願]]", "f": "ねが" },
                            { "k": "[[blue|いします]]。" }
                        ],
                        "zh": "麻煩2串雞蔥串"
                    }
                ]
            }
        ]
    },
    {
        "tile": [
            {
                "k": "何",
                "f": "なん"
            },
            {
                "k": "時",
                "f": "じ"
            },
            {
                "k": "(時間疑問詞)幾點"
            }
        ],
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            { "k": "今", "f": "いま" },
                            { "k": "8", "f": "はち" },
                            { "k": "時", "f": "じ" },
                            { "k": "半", "f": "はん" },
                            { "k": "[[blue|です]]。" }
                        ],
                        "zh": "現在8點半"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            { "k": "A：" },
                            { "k": "今", "f": "いま" },
                            { "k": "9", "f": "くじ" },
                            { "k": "時", "f": "じ" },
                            { "k": "10", "f": "じゅっ" },
                            { "k": "分", "f": "ぷん" },
                            { "k": "[[blue|ですか]]。" }
                        ],
                        "zh": "現在是9點10分嗎？"
                    },
                    {
                        "jp": [
                            { "k": "B：いいえ。" },
                            { "k": "9", "f": "くじ" },
                            { "k": "時", "f": "じ" },
                            { "k": "10", "f": "じゅっ" },
                            { "k": "分", "f": "ぷん" },
                            { "k": "[[blue|じゃないです]]。" },
                            { "k": "10", "f": "じゅう" },
                            { "k": "時", "f": "じ" },
                            { "k": "です。" }
                        ],
                        "zh": "不，[[blue|不是]]9點10分. 是10點"
                    },
                    {
                        "jp": [
                            { "k": "B：いいえ。" },
                            { "k": "10", "f": "じゅう" },
                            { "k": "時", "f": "じ" },
                            { "k": "です" }
                        ],
                        "zh": "不，是10點。"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            { "k": "A：いま" },
                            { "k": "[[blue|何]]", "f": "なん" },
                            { "k": "[[blue|時]]", "f": "じ" },
                            { "k": "[[blue|ですか]]。" }
                        ],
                        "zh": "現在[[blue|幾點]]呢？"
                    },
                    {
                        "jp": [
                            { "k": "B：" },
                            { "k": "11", "f": "じゅういち" },
                            { "k": "時", "f": "じ" },
                            { "k": "です。" }
                        ],
                        "zh": "11點"
                    }
                ]
            }
        ]
    },
    {
        "tile": [
            {
                "k": "~から"
            },
            {
                "k": "~まで"
            }
        ],
        "desp": "~は [br1] [[blue-underline|から|從，開始]] [br1] [[blue-underline|まで|到，為止]]",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            { "k": "このレストラン[[blue|は]]" },
                            { "k": "10", "f": "じゅう" },
                            { "k": "時", "f": "じ" },
                            { "k": "[[blue|から]]。" },
                            { "k": "22", "f": "にじゅうに" },
                            { "k": "時", "f": "じ" },
                            { "k": "[[blue|までです]]。" }
                        ],
                        "zh": "這間餐廳[[blue|從]]10點[[blue|到]]晚上10點"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            { "k": "おとうさんは" },
                            { "k": "土", "f": "ど" },
                            { "k": "曜", "f": "よう" },
                            { "k": "日", "f": "び" },
                            { "k": "[[blue|から]]" },
                            { "k": "日", "f": "にち" },
                            { "k": "曜", "f": "よう" },
                            { "k": "日", "f": "び" },
                            { "k": "[[blue|まで]]" },
                            { "k": "休", "f": "やす" },
                            { "k": "みます。" }
                        ],
                        "zh": "爸爸[[blue|從]]星期六休假[[blue|到]]星期日"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            { "k": "台", "f": "たい" },
                            { "k": "湾", "f": "わん" },
                            { "k": "[[blue|の]]" },
                            { "k": "銀", "f": "ぎん" },
                            { "k": "行", "f": "こう" },
                            { "k": "[[blue|は]]" },
                            { "k": "何", "f": "なん" },
                            { "k": "時", "f": "じ" },
                            { "k": "[[blue|まで]]ですか。" }
                        ],
                        "zh": "台灣[[blue|的]]銀行[[blue|到]]幾點呢？"
                    }
                ]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            { "k": "高", "f": "たか" },
                            { "k": "雄", "f": "お" },
                            { "k": "[[blue|から]]" },
                            { "k": "台", "f": "たい" },
                            { "k": "南", "f": "なん" },
                            { "k": "[[blue|まで]]" },
                            { "k": "40", "f": "よんじゅっ" },
                            { "k": "分", "f": "ぷん" },
                            { "k": "[[blue|かかります]]。" }
                        ],
                        "zh": "[[blue|從]]高雄[[blue|到]]台南要[[blue|花]]40分鐘"
                    }
                ]
            },
            {
                "id": 5,
                "dia": [
                    {
                        "jp": [
                            { "k": " このレストラン[[blue|は]]" },
                            { "k": "10", "f": "じゅう" },
                            { "k": "時", "f": "じ" },
                            { "k": "[[blue|まで]]" },
                            { "k": "[[blue|営]]", "f": "えい" },
                            { "k": "[[blue|業]]", "f": "ぎょう" },
                            { "k": "[[blue|します]]。" }
                        ],
                        "zh": "這間餐廳[[blue|營業]]到10點。"
                    }
                ]
            },
            {
                "id": 6,
                "dia": [
                    {
                        "jp": [
                            { "k": " このレストラン[[blue|は]]" },
                            { "k": "10", "f": "じゅう" },
                            { "k": "時", "f": "じ" },
                            { "k": "[[blue|まで]]" },
                            { "k": "[[blue|営]]", "f": "えい" },
                            { "k": "[[blue|業]]", "f": "ぎょう" },
                            { "k": "[[blue|します]]。" }
                        ],
                        "zh": "電影院[[blue|從]]早上8點開。"
                    }
                ]
            },
            {
                "id": 7,
                "dia": [
                    {
                        "jp": [
                            { "k": "映", "f": "えい" },
                            { "k": "画", "f": "が" },
                            { "k": "館", "f": "かん" },
                            { "k": "[[blue|は]]" },
                            { "k": "朝", "f": "あさ" },
                            { "k": "8", "f": "はち" },
                            { "k": "時", "f": "じ" },
                            { "k": "[[blue|からです]]。" }
                        ],
                        "zh": "電影院[[blue|從]]早上8點開。"
                    }
                ]
            },
            {
                "id": 8,
                "dia": [
                    {
                        "jp": [
                            { "k": "会", "f": "かい" },
                            { "k": "社", "f": "しゃ" },
                            { "k": "[[blue|は]]" },
                            { "k": "朝", "f": "あさ" },
                            { "k": "8", "f": "はち" },
                            { "k": "時", "f": "じ" },
                            { "k": "[[blue|から]]" },
                            { "k": "午", "f": "ご" },
                            { "k": "後", "f": "ご" },
                            { "k": "5", "f": "ご" },
                            { "k": "時", "f": "じ" },
                            { "k": "[[blue|までです]]。" }
                        ],
                        "zh": "公司從早上8點到下午5點。"
                    }
                ]
            }
        ],
        "br1": [
            "時間名詞",
            "地點名詞"
        ]
    },
    {
        "tile": "動詞",
        "tables": [{
            "header": ["肯定形", "否定形", "過去形", "否定過去形"],
            "rows":
                [
                    ["ます", "ません", "ました", "ませんでした"],
                    ["[{\"k\":\"飲\",\"f\":\"の\"},{\"k\":\"み[[blue|ます]]\"}]", "[{\"k\":\"飲\",\"f\":\"の\"},{\"k\":\"み[[blue|ません]]\"}]", "[{\"k\":\"飲\",\"f\":\"の\"},{\"k\":\"み[[blue|ました]]\"}]", "[{\"k\":\"飲\",\"f\":\"の\"},{\"k\":\"み[[blue|ませんでした]]\"}]"],
                    ["喝", "[[blue|不]]喝", "喝[[blue|了]]", "[[blue|沒]]喝"],
                    ["[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"き[[blue|ます]]\"}]", "[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"き[[blue|ません]]\"}]", "[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"き[[blue|ました]]\"}]", "[{\"k\":\"聞\",\"f\":\"き\"},{\"k\":\"き[[blue|ませんでした]]\"}]"],
                    ["聽，問", "[[blue|不]]聽，[[blue|不]]問", "聽[[blue|了]]，問[[blue|了]]", "[[blue|沒]]聽，[[blue|沒]]問"],
                ]
        },
        {
            "header": ["", "動詞範例"],
            "rows":
                [
                    ["肯定", "[{\"k\":\"[[blue|あした]]、\"},{\"k\":\"友\",\"f\":\"とも\"},{\"k\":\"達\",\"f\":\"だち\"},{\"k\":\"[[blue|と]]\"},{\"k\":\"一\",\"f\":\"いっ\"},{\"k\":\"緒\",\"f\":\"しょ\"},{\"k\":\"に\"},{\"k\":\"映\",\"f\":\"えい\"},{\"k\":\"画\",\"f\":\"が\"},{\"k\":\"[[blue|を]]み[[blue|ます]]。\"}]"],
                    ["", "[{\"k\":\"[[blue|明天]]和朋友一起[[blue|看]]電影\"}]"],
                    ["否定", "[{\"k\":\"[[blue|あした]]、\"},{\"k\":\"友\",\"f\":\"とも\"},{\"k\":\"達\",\"f\":\"だち\"},{\"k\":\"[[blue|と]]\"},{\"k\":\"一\",\"f\":\"いっ\"},{\"k\":\"緒\",\"f\":\"しょ\"},{\"k\":\"に\"},{\"k\":\"映\",\"f\":\"えい\"},{\"k\":\"画\",\"f\":\"が\"},{\"k\":\"[[blue|を]]み[[blue|ません]]。\"}]"],
                    ["", "[{\"k\":\"[[blue|明天不]]和朋友一起[[blue|看]]電影\"}]"],
                    ["過去", "[{\"k\":\"[[blue|きのう]]、\"},{\"k\":\"友\",\"f\":\"とも\"},{\"k\":\"達\",\"f\":\"だち\"},{\"k\":\"[[blue|と]]\"},{\"k\":\"一\",\"f\":\"いっ\"},{\"k\":\"緒\",\"f\":\"しょ\"},{\"k\":\"に\"},{\"k\":\"映\",\"f\":\"えい\"},{\"k\":\"画\",\"f\":\"が\"},{\"k\":\"[[blue|を]]み[[blue|ました]]。\"}]"],
                    ["", "[{\"k\":\"[[blue|昨天]]和朋友一起[[blue|看了]]電影\"}]"],
                    ["否定過去", "[{\"k\":\"[[blue|きのう]]、\"},{\"k\":\"友\",\"f\":\"とも\"},{\"k\":\"達\",\"f\":\"だち\"},{\"k\":\"[[blue|と]]\"},{\"k\":\"一\",\"f\":\"いっ\"},{\"k\":\"緒\",\"f\":\"しょ\"},{\"k\":\"に\"},{\"k\":\"映\",\"f\":\"えい\"},{\"k\":\"画\",\"f\":\"が\"},{\"k\":\"[[blue|を]]み[[blue|ませんでした]]。\"}]"],
                    ["", "[{\"k\":\"[[blue|昨天]]沒有和朋友一起[[blue|看]]電影\"}]"]
                ]
        }
        ]
    },
    {
        "tile": "します",
        "tables": [{
            "header": ["類別 1 ", "運動類加的動詞 → 「します」"],
            "rows":
                [
                    ["", "テニスを[[blue|します]]<br>([[blue|打]]網球)"],
                    ["", "[{\"k\":\"運\",\"f\":\"うん\"},{\"k\":\"動\",\"f\":\"どう\"},{\"k\":\"[[blue|をします]]<br>(運動)\"}]"],
                    ["", "サッカー[[blue|をします]]<br>([[blue|踢]]足球)"],
                ]
        },
        {
            "header": ["類別 2 ", "二個漢字加的動詞→「します」"],
            "rows":
                [
                    ["", "[{\"k\":\"掃\",\"f\":\"そう\"},{\"k\":\"除\",\"f\":\"じ\"},{\"k\":\"[[blue|をします]]<br>(打掃)\"}]"],
                    ["", "[{\"k\":\"洗\",\"f\":\"せん\"},{\"k\":\"濯\",\"f\":\"たく\"},{\"k\":\"[[blue|をします]]<br>(洗衣服)\"}]"],
                ]
        },
        {
            "header": ["類別 3 ", "外來語加的動詞 → 「します」"],
            "rows":
                [
                    ["", "アルバイトを[[blue|します]]<br>([[blue|打]]工)"],
                    ["", "コンサートを[[blue|します]]<br>([[blue|辦]]音樂會)"]
                ]
        }
        ]
    },
    {
        "tile": "に(時間助詞)在",
        "tables": [{

            "col": ["20%", "80%"],
            "header": ["類別 1 ", "[{\"k\":\"~\"},{\"k\":\"時\",\"f\":\"じ\"},{\"k\":\"~\"},{\"k\":\"分\",\"f\":\"ふん\"},{\"k\":\"/\"},{\"k\":\"分\",\"f\":\"ぷん\"},{\"k\":\"(~點~分) に\"}]"],
            "rows":
                [
                    ["", "[{\"k\":\"きょう\"},{\"k\":\"7\",\"f\":\"しち\"},{\"k\":\"時\",\"f\":\"じ\"},{\"k\":\"[[blue|に]]\"},{\"k\":\"起\",\"f\":\"お\"},{\"k\":\"きました。\"}]"],
                    ["", "今天[[blue|在]]7點起床"],
                ]
        },
        {
            "col": ["20%", "80%"],
            "header": ["類別 2 ", "[{\"k\":\"~\"},{\"k\":\"月\",\"f\":\"がつ\"},{\"k\":\"~\"},{\"k\":\"日\",\"f\":\"にち\"},{\"k\":\"(~月~日) に\"}]"],
            "rows":
                [
                    ["", "[{\"k\":\"私\",\"f\":\"わたし\"},{\"k\":\"は\"},{\"k\":\"3\",\"f\":\"さん\"},{\"k\":\"月\",\"f\":\"がつ\"},{\"k\":\"1日\",\"f\":\"ついたち\"},{\"k\":\"[[blue|に]]\"},{\"k\":\"日\",\"f\":\"に\"},{\"k\":\"本\",\"f\":\"ほん\"},{\"k\":\"[[blue|へ]]\"},{\"k\":\"行\",\"f\":\"い\"},{\"k\":\"きました。\"}]"],
                    ["", "我[[blue|在]]3月1日去日本"],
                ]
        },
        {
            "col": ["20%", "80%"],
            "header": ["類別 3 ", "[{\"k\":\"~\"},{\"k\":\"年\",\"f\":\"ねん\"},{\"k\":\"(~年) に\"}]"],
            "rows":
                [
                    ["", "[{\"k\":\"田\",\"f\":\"たな\"},{\"k\":\"中\",\"f\":\"か\"},{\"k\":\"さんは\"},{\"k\":\"2000\",\"f\":\"にせん\"},{\"k\":\"年\",\"f\":\"ねん\"},{\"k\":\"[[blue|に]]\"},{\"k\":\"生\",\"f\":\"う\"},{\"k\":\"まれました。\"}]"],
                    ["", "田中小姐[[blue|在]]2000年出生的"],
                ]
        },
        {
            "col": ["20%", "80%"],
            "header": ["類別 4 ", "[{\"k\":\"~\"},{\"k\":\"曜\",\"f\":\"よう\"},{\"k\":\"日\",\"f\":\"び\"},{\"k\":\"~に (に)星期~ 可加可不加\"}]"],
            "rows":
                [
                    ["", "[{\"k\":\"日\",\"f\":\"にち\"},{\"k\":\"曜\",\"f\":\"よう\"},{\"k\":\"日\",\"f\":\"び\"},{\"k\":\"[[blue|(に)]]\"},{\"k\":\"休\",\"f\":\"やす\"},{\"k\":\"みます。\"}]"],
                    ["", "星期日休假"],
                ]
        },
        {
            "col": ["20%", "80%"],
            "header": ["類別 5 ", "[br1]に"],
            "rows":
                [
                    ["", "[{\"k\":\"弟\",\"f\":\"おとうと\"},{\"k\":\"は\"},{\"k\":\"夏\",\"f\":\"なつ\"},{\"k\":\"休\",\"f\":\"やす\"},{\"k\":\"[[blue|(に)]]\"},{\"k\":\"学\",\"f\":\"がっ\"},{\"k\":\"校\",\"f\":\"こう\"},{\"k\":\"を\"},{\"k\":\"休\",\"f\":\"やす\"},{\"k\":\"みます。\"}]"],
                    ["", "弟弟[[blue|在]]暑假學校休息"],
                ]
        }
        ],
        "br1": [
            "[{\"k\":\"春\",\"f\":\"はる\"},{\"k\":\"休\",\"f\":\"やす\"},{\"k\":\"み  春假\"}]",
            "[{\"k\":\"夏\",\"f\":\"なつ\"},{\"k\":\"休\",\"f\":\"やす\"},{\"k\":\"み  暑假\"}]",
            "[{\"k\":\"秋\",\"f\":\"あき\"},{\"k\":\"休\",\"f\":\"やす\"},{\"k\":\"み  秋假\"}]",
            "[{\"k\":\"冬\",\"f\":\"ふゆ\"},{\"k\":\"休\",\"f\":\"やす\"},{\"k\":\"み  寒假\"}]"
        ]
    },
    {
        "tile": "に(時間助詞)在 特例",
        "desp": "以下不加時間助詞「に」",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            { "k": "今", "f": "こん" },
                            { "k": "週", "f": "しゅう" }
                        ],
                        "zh": "今週"
                    },
                    {
                        "jp": [
                            { "k": "来", "f": "らい" },
                            { "k": "週", "f": "しゅう" }
                        ],
                        "zh": "下週"
                    },
                    {
                        "jp": [
                            { "k": "先", "f": "せん" },
                            { "k": "週", "f": "しゅう" }
                        ],
                        "zh": "上週"
                    }
                ]
            },
            {
                "id": 2,
                "dia": [
                    {
                        "jp": [
                            { "k": "今", "f": "こ" },
                            { "k": "年", "f": "とし" }
                        ],
                        "zh": "今年"
                    },
                    {
                        "jp": [
                            { "k": "来", "f": "らい" },
                            { "k": "年", "f": "ねん" }
                        ],
                        "zh": "明年"
                    },
                    {
                        "jp": [
                            { "k": "去", "f": "きょ" },
                            { "k": "年", "f": "ねん" }
                        ],
                        "zh": "去年"
                    }
                ]
            },
            {
                "id": 3,
                "dia": [
                    {
                        "jp": [
                            { "k": "今", "f": "こん" },
                            { "k": "月", "f": "げつ" }
                        ],
                        "zh": "這個月"
                    },
                    {
                        "jp": [
                            { "k": "来", "f": "らい" },
                            { "k": "月", "f": "げつ" }
                        ],
                        "zh": "下個月"
                    },
                    {
                        "jp": [
                            { "k": "先", "f": "せん" },
                            { "k": "月", "f": "げつ" }
                        ],
                        "zh": "上個月"
                    }
                ]
            },
            {
                "id": 4,
                "dia": [
                    {
                        "jp": [
                            { "k": "毎", "f": "まい" },
                            { "k": "朝", "f": "あさ" }
                        ],
                        "zh": "每天早上"
                    },
                    {
                        "jp": [
                            { "k": "今", "f": "け" },
                            { "k": "朝", "f": "さ" }
                        ],
                        "zh": "今天早上"
                    },
                    {
                        "jp": [
                            { "k": "毎", "f": "まい" },
                            { "k": "晚", "f": "ばん" }
                        ],
                        "zh": "每天晚上"
                    },
                    {
                        "jp": [
                            { "k": "毎", "f": "まい" },
                            { "k": "日", "f": "にち" }
                        ],
                        "zh": "每天"
                    },
                    {
                        "jp": [
                            { "k": "毎", "f": "まい" },
                            { "k": "月", "f": "つき" }
                        ],
                        "zh": "每個月"
                    }
                ]
            },
            {
                "id": 5,
                "dia": [
                    {
                        "jp": [
                            { "k": "きょう"}
                        ],
                        "zh": "今天"
                    },
                    {
                        "jp": [
                            { "k": "あした"}
                        ],
                        "zh": "明天"
                    },
                    {
                        "jp": [
                            { "k": "あさって"}
                        ],
                        "zh": "後天"
                    },
                    {
                        "jp": [
                            { "k": "おととい"}
                        ],
                        "zh": "前天"
                    },
                    {
                        "jp": [
                            { "k": "きのう"}
                        ],
                        "zh": "昨天"
                    }
                ]
            },
            {
                "id": 6,
                "dia": [
                    {
                        "jp": [
                            { "k": "今", "f":"いま"}
                        ],
                        "zh": "現在"
                    },
                    {
                        "jp": [
                            { "k": "朝", "f":"あさ"}
                        ],
                        "zh": "早上"
                    },
                    {
                        "jp": [
                            { "k": "昼", "f":"ひる"}
                        ],
                        "zh": "中午"
                    },
                    {
                        "jp": [
                            { "k": "晚", "f":"ばん"}
                        ],
                        "zh": "晚上"
                    },
                    {
                        "jp": [
                            { "k": "夜", "f":"よる"}
                        ],
                        "zh": "夜晚"
                    }
                ]
            },
            {
                "id": 7,
                "dia": [
                    {
                        "jp": [
                            { "k": "午", "f":"ご"},
                            { "k": "前", "f":"ぜん"}
                        ],
                        "zh": "上午"
                    },
                    {
                        "jp": [
                            { "k": "午", "f":"ご"},
                            { "k": "後", "f":"ご"}
                        ],
                        "zh": "下午"
                    },
                    {
                        "jp": [
                            { "k": "いつ"}
                        ],
                        "zh": "什麼時候"
                    }
                ]
            }
        ]
    },
    {
        "tile": "ごろ",
        "desp":"(時刻點)左右",
        "trans":"補充",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            { "k": "私", "f": "わたし" },
                            { "k": "[[blue|は]]"},
                            { "k": "每", "f": "まい" },
                            { "k": "日", "f": "にち" },
                            { "k": "7", "f": "しち" },
                            { "k": "時", "f": "じ" },
                            { "k": "[[blue|ころ]]"},
                            { "k": "起", "f": "お" },
                                                        { "k": "き[[blue|ます]]。"}
                        ],
                        "zh": " 我每日7點[[blue|左右]]起床"
                    },
                ]
            }
        ]
    },
    {
        "tile": "~ ぬきで",
        "desp":" ~ 去掉 ",
        "trans":"補充",
        "exam": [
            {
                "id": 1,
                "dia": [
                    {
                        "jp": [
                            { "k": "氷", "f": "こおり" },
                            { "k": "[[yellow|を]][[blue|ぬきで]]お"},
                            { "k": "いします。"}
                        ],
                        "zh": "麻煩[[blue|去]]冰"
                    },
                ]
            }
        ]
    }
];
